{
    "entity-not-found": [
        "Show me some 4-star rated movies that are not rated for general audience",
        "Can you recommend a movie from the 1950s that is a must-see?",
        "Who directed the movie King Leonidas and what year was it released?",
        "Who directed the film that takes place in the 1890s and features a teen romance?",
        "Can you recommend a movie with Al Pacino that has a 10/10 viewers' rating?",
        "who directed the movie Forrest Gump that does not have a specific rating?",
        "is Morpheus in any must-see historical films",
        "can you recommend a movie with a 5-star rating that features a robot uprising",
        "show me a movie directed by Rob Reiner that was released between 2002 and 2007",
        "Can you recommend a good historical drama available for streaming on Hulu?",
        "Who directed the action movie with Anne Hathaway that has a plot about time travel?",
        "Is Professor Dumbledore a character in any 3/10 rated movies?",
        "can you recommend a movie that won't leave me disappointed",
        "Can you give me an excerpt from the movie Vertigo?",
        "what is a solid documentary about the making of the lord of the rings trilogy",
        "Who directed The Grand Budapest Hotel",
        "Show me a movie with a 4.5-star rating.",
        "Find me a thriller released between 1980 and 1985.",
        "What is the latest Trailer release for a film directed by Denis Villeneuve?",
        "Can I see a Preview clip of the new science fiction movie directed by Denis Villeneuve?",
        "who directed the latest movie featuring Elastigirl and what year did it come out?",
        "Is General Grievous in any documentary film about independent cinema",
        "Do you have an extended trailer for Shrek?",
        "Can you recommend a cult movie released between 1984 and 1989?",
        "Can you recommend any movies directed by Robert Redford between 1980 and 2000?",
        "Unbelievable! Can you tell me the director of the movie Phantom Thread?",
        "Who directed the film Star Wars: The Force Awakens?",
        "Who directed the behind the scenes documentary about the making of Jurassic Park?",
        "Can you recommend a G or PG-rated movie similar to Interstellar?",
        "When did Captain America: The First Avenger come out?",
        "Is there a satire movie suitable for teens that is unrated?",
        "Can you recommend a movie with a love triangle released between 2020 and 2025?",
        "Could you recommend an animated movie with the song 'Under the Sea'?",
        "What is the genre of the movie Angelina Jolie starred in between 1977 and 1981",
        "What historical films from the 1840s are considered must-sees?",
        "Can you recommend a movie that features a truly special performance by Queen?",
        "Who directed the PG-rated movie Moonlight, and what year was it released?",
        "Who directed the movie Captain Phillips and what is the rating",
        "What genre is the movie The Bourne Ultimatum directed by Paul Greengrass",
        "Who directed the new James Bond film, and what is the musical score like?",
        "Can you recommend a supernatural movie with impressive set design from the year 2000",
        "I'm looking for a movie with a very detailed narrative that is not rated.",
        "Which mockumentary film has won an award for best costume design?",
        "I'm looking for a movie with dialogue writing that has received great reviews, perhaps something directed by The Dude.",
        "Have more movies been released between 1965 and 1970 than after 2000",
        "Can you recommend a survival movie released between 1975 and 1985?",
        "What movie starred Matt Damon and was directed by Darren Aronofsky between 2012 and 2015?",
        "What is the MPAA rating for Star Wars: Episode IX?",
        "Who directed Iron Man and what would viewers rate it?",
        "When was the movie Jurassic Park released?",
        "What is the genre of the movie Casino?",
        "What post-apocalyptic movies were released between 2018 and 2020?",
        "What year was the movie Moana released?",
        "What movie features a western showdown and is considered a must-see?",
        "What are some movies with a well-matched cast and crew similar to Bo Burnham's style?",
        "Could you tell me the year of release for The Terminator directed by James Cameron?",
        "Who produced the movie Jurassic World, and what is the storyline?",
        "Do you have any information about a movie with a production diary released between 2018 and 2023?",
        "What are the best movies released between 1964 and 1968?",
        "who directed the movie The Babadook",
        "Show me the trailer for Romeo + Juliet directed by Baz Luhrmann",
        "Is Amy Adams starring in any romantic comedies that came out between 1950 and 1960?",
        "What year was the movie Titanic released and which famous song is associated with it?",
        "Who directed the movie Yellow Submarine and what year was it released?",
        "What remarkable movies did M. Night Shyamalan direct in the 90s",
        "Can you recommend an astounding movie from the 1960s to 1962",
        "Who directed the movie Gladiator and what genre is it",
        "Is The Godfather considered a must-see movie by most viewers?",
        "Can you recommend a movie with remarkable production design and believable performances by Amy Adams that falls under the crime genre",
        "I'm looking for an in-depth documentary about movies made between 1963 and 1968, can you help?",
        "Who directed the movie I Will Follow Him and when was it released",
        "Show me a trailer for a romantic movie featuring Rachel McAdams",
        "Who won the Australian Academy of Cinema and Television Arts award for best actress between 1996 and 2000?",
        "Who directed the movie The Blues Brothers and what was the rating for costume design?",
        "Are there any must-see historical movies directed by David O. Russell?",
        "I heard the soundtrack for a new movie received a 3.5-star rating, which movie is it?",
        "Who directed the movie Titanic and what genre does it belong to?",
        "who directed the supernatural film The Lighthouse, released in 2019",
        "show me a classic movie from 1968 that won an Emmy Award",
        "What movie released between 1992 and 1998 has a similar genre to The Dark Knight?",
        "When was the movie Back to the Future released?",
        "Who directed the movie that has the song 'I Will Always Love You' in it?",
        "Tell me about any layered narrative movies released between 2020 and 2022",
        "Which movie features a character named Leonard 'Bones' McCoy?"
    ],
    "missing-entity-type": [
        "What 2011 movie directed by Patty Jenkins received standout performances by Jessica Chastain?",
        "Could you recommend a film with a Taylor Swift song in the trailer?",
        "Show me a trailer for Captain Marvel.",
        "Do you have any historical films from the 1980s that are not available for streaming?",
        "Can you recommend any M. Night Shyamalan movies available for streaming?",
        "Can I see the Trailer for The Wizard of Oz",
        "What year did the movie Ghostbusters, starring Emma Watson, receive its MPAA rating?",
        "What is the average score of the movie directed by Kenneth Branagh?",
        "Show me a trailer of the movie where Rust Cohle plays a lead role",
        "Is there a Robert Rodriguez movie that I can access through streaming services",
        "Can I stream on the go the film with the song 'A Whole New World' from Aladdin",
        "What movie features the song 'I Will Always Love You' and has an official trailer?",
        "Who directed the action movie with the title 'Die Hard' and a viewers' rating of 5 stars?",
        "Can I stream The Lion King with closed captioning?",
        "what are some good mystery movies with a twist ending",
        "who is the director of the goodfellas movie",
        "show me a good horror movie from the 1980s",
        "What is the plot of the movie The Blind Side, in which Sandra Bullock stars?",
        "Can I see a trailer for the new artificial intelligence uprising film?",
        "What is the MPAA rating for the movie Amadeus",
        "Could you tell me the genre of Interstellar and who directed The Wizard of Oz?",
        "Can you tell me the genre of the movie Predator directed by John McTiernan in 1987?",
        "Do you have any clips of the film Desperado, directed by Robert Rodriguez in 1995?",
        "What is the viewers' rating for the movie Frozen starring Rachel McAdams?",
        "Show me a trailer for a movie that premiered at the Sundance Film Festival",
        "Can I watch a movie available on a streaming platform that Christian Bale starred in as an undercover agent?",
        "Can you tell me the plot of King Kong?",
        "What is the MPAA rating for the movie M directed by Fritz Lang?",
        "what is a good comedy movie available on streaming apps with a PG rating",
        "who directed the classic film The Godfather and what year was it released"
    ],
    "not-allowed-entity-type": [
        "What is the viewers' rating for the movie with the song 'Eye of the Tiger' performed by Survivor?",
        "Can you recommend a film with the song 'I Will Survive' and excellent makeup and hairstyling assessment?",
        "I'd like to hear an excerpt from a Ryan Reynolds movie from 2009.",
        "Can you recommend a James Bond film set in New York City?",
        "Can you recommend a movie from 2019 with impressive set design?",
        "Could you suggest a movie known for its exceptional costume and makeup design?",
        "Show me a movie from the 1980s with a soundtrack by Michael Jackson",
        "What is the MPAA rating for The Big Lebowski and where is the location of the film set?",
        "When is the trailer release for the new martial arts film starring Jet Li",
        "Who directed the movie approved by critics with the song 'Glory' by H.E.R. and Taylor Swift?",
        "Do you have any promo material for the disappointing M rated movie released in 2021?",
        "Can you recommend a movie with a song by Ariana Grande?",
        "can you recommend a movie featuring Elton John's music",
        "is there a movie where Ron Weasley plays a role as Alex in a G-rated film",
        "Who directed the Sundance Film Festival winner that came out in 2019 and has a female protagonist?",
        "Can you recommend a movie with a haunting score?",
        "I'm interested in finding a movie with a gripping soundtrack from the mid 2010s, perhaps one featuring Alicia Keys.",
        "I'm looking for a good inspiring movie that has recently been released in the box office",
        "What movies are not recommended by viewers that received Academy Awards",
        "Can you recommend a movie with a Witness Protection theme, composed by John Williams, and starring Chris Pratt?",
        "Can you recommend a cyberpunk dystopia film with a 4.5-star rating and available on streaming websites?",
        "I'm looking for a Sherlock Holmes movie starring Gerard Butler and directed by an award-winning director.",
        "Has Samuel L. Jackson ever won an award at the Sundance Film Festival?",
        "Can you recommend an innovative GP movie from the 1990s?",
        "what movie won the best picture oscar in 2019",
        "can you show me some footage from the latest James Bond movie",
        "I'm looking for a British Independent Film Award nominee starring Ryan Gosling, do you have any recommendations?",
        "Can you provide a visual effects critique for the latest Clint Eastwood movie?",
        "Can I watch on Netflix a comedy movie from the 1980s with Princess Leia as a character",
        "Who was the set designer for the film Casablanca?",
        "Name a movie from 1982 with great screen presence and the name of the producer",
        "who directed the movie with impressive visual effects",
        "can I get an inside look at the newest Luke Skywalker film"
    ],
    "entity-pair-decode": [
        "what type of movie genre is the southpaw that is rated MA15+"
    ],
    "entity-not-found-overlap": [
        "Can I have a first look at the trailer for the movie A that came out in 1980?"
    ],
    "low-logprob": [
        "Who is the director of the movie with the most plot twists",
        "Is Margot Robbie in any historical films that are a must see with a GP rating?",
        "Who directed the Harry Potter film featuring James P. Sullivan as a character?",
        "Can you recommend a women's sports movie from 1993?",
        "who directed the 2015 film about the American Civil War with a strong female lead",
        "do you have any recommendations for a good action movie",
        "Have movies with George Lucas as the director ever been rated 0 out of 10",
        "Is The Exorcist known for mixed reviews related to its fame?",
        "Can you recommend a movie from 2010-2015 with Beyoncé as one of the main characters?",
        "I'm looking for footage from the movie Casablanca, directed by Michael Curtiz. Can you help with that?",
        "find a thriller with iconic characters like Hannibal Lecter",
        "What is the main plot of the action film directed by Christopher Nolan?",
        "recommend a masterful sci-fi movie released in 2025",
        "Can you recommend a movie from the independent film era that is as thrilling as Hotel California",
        "What is the plot of the highest-rated action movie of the year?",
        "I'm looking for a movie with supernatural forces and a strong viewers' rating",
        "Can you recommend a GP-rated fantasy movie featuring the character Jason Voorhees?",
        "What year was Titanic released?",
        "Could you show me the trailer for the new Han Solo movie?",
        "show me a movie similar to Across the Universe with a feel-good soundtrack",
        "can you recommend a superhero movie directed by Tim Burton",
        "Could you recommend a movie directed by Wes Anderson and rated as the best picture?",
        "What year did the movie 'The Matrix' come out and who directed it?",
        "Can you recommend a cyberpunk movie that has exceeded expectations?",
        "where can I find a movie preview for a crime thriller",
        "What movie genre did the film Back to the Future belong to and who was the director?",
        "Show me the in-depth making-of featurette for the movie Happy",
        "What movie from the 80s is known for its remarkable use of special effects?",
        "What is a good movie producer for action films?",
        "What year was the movie American Sniper released, and who is the director?",
        "show me a thought-provoking movie with a Parental Guidance Suggested rating",
        "is there a production diary available for the movie Black Widow",
        "I'm curious to know if there were any notable stunt double scenes in the behind-the-scenes of a popular action movie.",
        "I am looking for a superhero origin film with LGBTQ+ representation",
        "Can you recommend a zombie movie directed by Sam Mendes?",
        "Please show me the trailer for M - the iconic German thriller film.",
        "Are there any fresh action films directed by Christopher Nolan?",
        "Can you recommend a movie with atmospheric scores that adds excitement to the scenes?",
        "Show me a movie from the 2000s that Dominic Toretto from the Fast & Furious series would enjoy.",
        "Can you recommend a historical film that received high viewers' ratings?",
        "What's the most action-packed film of all time according to viewers?",
        "What year did the movie Jasmine come out and who is the director?",
        "Show me a PG movie that features the song I Just Called to Say I Love You",
        "What is the viewers' rating for the latest Jordan Peele horror movie?",
        "What is the best musical of all time",
        "what is the viewers' rating for X movie",
        "What type of movie genre is Black Panther considered to be",
        "Can you recommend a Stellar movie from 2019?",
        "Can you show me a trailer for a movie where Jango Fett is a character?",
        "What movie features a song about a rescue mission?",
        "I'm in the mood for a classic war film. Do you have any recommendations?",
        "show me the trailer for the new Kristen Stewart film",
        "Which movie genre is best suited for a character like Dev Patel in a historical film?",
        "Can you recommend a courtroom film with a gripping plot and directed by Steven Spielberg?",
        "What was the highest-grossing movie in 2016?",
        "Show me the official trailer for a corporate espionage movie.",
        "Can you recommend any movies with a technological revolution theme?",
        "Is Snow White and the Seven Dwarfs considered an Unforgettable movie",
        "I'm interested in a movie related to punk rock rebellion, preferably directed by E.",
        "show me a trailer for the latest sci-fi movie starring Tom Cruise",
        "Can you recommend a fresh World War II resistance movie that's worth watching?",
        "Can I get a glimpse of the new horror movies involving human cloning",
        "I want to watch a film with an amazing song, maybe one with a song by Spike Lee?",
        "What year was A Few Good Men released and who directed it?",
        "What movie is known for its thrilling revenge plot just like in the Fast & Furious series with Dominic Toretto?",
        "show me a movie with an intriguing forbidden romance",
        "Can you suggest a good family drama movie with a rating of X or higher?",
        "Which movies feature characters from Norse mythology?",
        "Can you recommend a political movie directed by Quentin Tarantino",
        "Find me a movie from the 90s with a character named 'Indiana Jones'.",
        "What is the best movie that came out in the year 1997?",
        "Can you show me a clip from a movie featuring Arya Stark?",
        "Can you recommend a movie with approved musically enhanced scenes?",
        "Can I get exclusive access to the trailer of the latest Eye-opening documentary?",
        "recommend a moving drama rated X from 2005",
        "Who directed the action movie with a plot involving time travel and a dystopian future?",
        "Show me a trailer for a movie by George Lucas that features lightsabers.",
        "what is a good documentary to watch on the best streaming platform for this movie",
        "Could you recommend a movie with a beautiful orchestral arrangement?",
        "What environmental activism film did Guillermo del Toro direct?",
        "Is Forrest Gump considered a classic in the drama genre?",
        "Can you recommend a superhero movie directed by the Coen Brothers?",
        "What are some historical movies with action-packed scenes that have no adult content?",
        "Is there a movie directed by Steven Soderbergh that features the song Stayin' Alive?",
        "What is the viewers' rating for A Beautiful Mind",
        "Can you recommend a mystery movie released in the past year?",
        "Is Lieutenant Dan in any award-winning movies?",
        "Who is the director of the most impressive romantic comedy of the year?",
        "Does the movie Zombie have a high viewers' rating?",
        "What is the viewers' rating for the cyberpunk movie featuring a character named Neo?",
        "Can you recommend a good biography movie about a musician like Moon River for me to watch?",
        "Who are the Misfit cast members in the movie Singin' in the Rain?",
        "What EDM song is featured in the movie M?",
        "What is the plot of the popular choice movie road trip?",
        "Can you recommend a movie from the 90s with a strong female lead and a great Plot?",
        "Can you play the trailer for the new Wonder Woman movie?",
        "Who directed the game-changing film in 2006 with memorable performances?",
        "show me a musical with an exciting plot",
        "Is Johnny Depp in any action films rated GP, like Knives Out?",
        "I'm looking for a thriller involving organized crime and betrayal and double-cross.",
        "Who is the actor that plays the main character in the movie M?",
        "Could you recommend a Judd Apatow movie that is both funny and compelling?",
        "What Tony Award-winning movie did Vito Corleone appear in",
        "Which movie features a film montage similar to Mary Poppins",
        "Show me a movie with cinematography highlights and a song by U",
        "Are there any movie trailers for films about a zombie apocalypse directed by Joss Whedon?",
        "Is there a movie with time travel in it that was released in 1967?",
        "When is the trailer release of the movie Touching Love Story?",
        "Can you recommend a movie with some uplifting songs in its original score?",
        "Can you recommend a heartwarming movie released in 2010?",
        "Who directed the film 'Life after Death' and can you show me a trailer?",
        "What are the top-rated mystery movies released in the 1990s?",
        "What is the viewers' rating for The Bodyguard movie?",
        "Can you recommend a movie similar to The Truman Show with exceptional costumes?",
        "show me a trailer of the latest action movie directed by Kathryn Bigelow",
        "Show me a Sam Mendes movie with a suspenseful plot.",
        "What movie showings are playing Somewhere Over the Rainbow?",
        "Can you recommend any TV-MA rated movies with a social message?",
        "What year did the movie with the title 'Blazing Saddles' come out, and what genre does it belong to?",
        "Show me a movie with an opera scene and a 5-star rating",
        "Is there a new action movie coming out starring Tony Stark's character?",
        "Show me the official trailer for Paul Thomas Anderson's latest movie.",
        "Can you recommend a zombie movie with impressive visual effects?",
        "Is the plot of GoodFellas too complicated?",
        "Is Robert Downey Jr. starring in any upcoming action movies?",
        "Show me a trailer for the latest movie with Tom Cruise as the lead actor.",
        "who directed the epic film Gladiator",
        "What year was the movie GP released?",
        "Can you recommend me a Palme d'Or winner that was released in the 90s?",
        "Show me a movie that is unrated and has an exciting plot",
        "can I stream from tablet the superhero origin story movie about a character named Diana Prince",
        "Can you recommend a complicated sci-fi movie from 1978 directed by George Lucas?",
        "Can you provide me with a touching movie featuring Jake Gyllenhaal?",
        "Who directed the film 'Butch Cassidy and the Sundance Kid' released in 1969?",
        "Can you play the trailer for the movie rated B- that came out in 1999?",
        "What is the name of the biographical film about Adele's life?",
        "Can you recommend a movie with a great soundtrack similar to the one in A Star is Born",
        "Could you list some titles of movies with a strong character development and a thrilling plot from the 2000s?",
        "Can you recommend a solid GP-rated movie from the 1980s",
        "Can you recommend a romantic comedy with impressive production design?",
        "what is considered the most divisive supernatural movie of the past decade",
        "Can you recommend a romance film directed by Kathryn Bigelow?",
        "can you recommend a movie with subtle humor that is rated R",
        "I need information about an original and captivating movie directed by Christopher Nolan",
        "Is there a movie called Battle for Justice that was rated Not Rated?",
        "Show me a trailer of a movie starring Sandra Oh and Alfred Hitchcock.",
        "Show me a trailer for a movie featuring Hermione Granger",
        "Can you recommend a movie with a highlight performance by Nicole Kidman?",
        "What are some must-see movies that came out 12 years ago?",
        "Are there any cinema listings for Grease, the movie with the character Mad Hatter?",
        "Is Ava DuVernay's latest film rated PG-13?",
        "What is the viewers' rating for Lee Daniels' The Butler?",
        "Show me a movie trailer for the latest James Bond film.",
        "I heard Rob Reiner directed a film based on Frankenstein. Can you provide some details about it?",
        "Is the new Spider-Man movie getting good reviews",
        "Can you recommend a movie directed by Sofia Coppola that was a pleasant surprise?",
        "Who directed the highest-rated vampire movie of the 21st century?",
        "Give me the official trailer for the new buddy cop movie starring Ryan Reynolds and Samuel L. Jackson",
        "Can you recommend a thrilling survival adventure movie?",
        "Can I watch an extended preview of the upcoming movie directed by Christopher Nolan?",
        "Could you show me a clip from The Sound of Music with the song Unchained Melody?",
        "Is The Princess Bride streamable on Netflix?",
        "I'm interested in watching a movie with a featurette about Queen. Do you have any suggestions?",
        "Can you recommend any movies from 1973 directed by Steven Soderbergh that feature instrumental music?",
        "What year did the movie Les Misérables come out?",
        "Can you recommend a movie with a terrible rating?",
        "What sci-fi thriller film has the highest viewers' rating?",
        "Which film from the 1990s is considered the most haunting psychological thriller?",
        "show me a review of the action movie with the title Die Hard",
        "can you recommend a feel-good musical movie from the 2020s",
        "What is the viewers' rating for the movie starring R and Luke Skywalker?",
        "Is there a Tyler Perry movie released in 2015 with a song similar to Kiss from a Rose",
        "Show me the trailer for a movie with the character named Indiana Jones",
        "What is your opinion on The Hateful Eight? How would you rate it in terms of plot and acting?",
        "Can you recommend a compelling movie from 1975?",
        "show me a G-rated film for kids with an instrumental music soundtrack",
        "Are there any action movies with a strong female lead character, similar to the role played by Jennifer Lawrence in Red Sparrow?",
        "What is the viewers' rating for the most recent Spider-Man movie?",
        "Who directed the film with the title 'Unique' and a PG-13 rating?",
        "Can you recommend a good teen movie with Justin Bieber?",
        "can you recommend any groundbreaking movies directed by Akira Kurosawa",
        "Can you recommend a short musical film from the 1980s?",
        "Show me a movie set in a medieval kingdom from the year 2000",
        "Show me a trailer for a movie directed by a female filmmaker that came out in the 90s",
        "can you show me a trailer for the latest solid action movie",
        "What's a PG rated movie with a captivating plot",
        "What late 1990s action movies star Luke Skywalker?",
        "Who directed the space opera film released in 1980 with the title The Empire Strikes Back?",
        "I'm looking for a highly recommended crime thriller from the 90s",
        "Can you recommend a highly-rated movie from the 90s with the actor Tom Hanks?",
        "What is the viewers' rating for the movie Bohemian Rhapsody?",
        "I believe Exquisite is the best song in the movie I watched last night, can you identify the title?",
        "I'm looking for a movie that features the song Eye of the Tiger by A.R. Rahman.",
        "What is the love triangle movie starring Jennifer Lawrence that was a box office flop",
        "What is the plot of the movie Black Swan?",
        "Can you recommend an unrated action movie directed by John Woo?",
        "can you recommend a movie with cinematic music from the 1820s",
        "What psychological thriller films has Baz Luhrmann directed?",
        "Can you recommend a compelling film in the genre 'Glimpse' with a poor rating?",
        "I heard there's a PG-rated movie considered the best movie of the year. Can you give me more details?",
        "Show me a promotional clip for the movie featuring the song 'Can't Stop the Feeling'",
        "what is the plot of the epic movie Lawrence of Arabia",
        "What movie from 1965 features a song that became popular in the 1980s?",
        "What is the plot of A Nightmare on Elm Street?",
        "Are there any recent movies with a strong female lead character like Wonder Woman?",
        "can you recommend a sci-fi movie similar to Aliens",
        "recommend a mesmerizing and intense science fiction movie with supernatural forces",
        "What is a must-see movie from 1983 about World War II",
        "Can you recommend a comedic film from the 1990s with a viewers' rating of at least 4 stars",
        "Show me a trailer featuring Katniss Everdeen in a dystopian society rebel role",
        "Show me a trailer of the 2020 movie with a phenomenal soundtrack.",
        "What movie has the most cinematic visual effects of all time?",
        "What is the viewers' rating for the Sam Mendes movie about war?",
        "Can I watch a movie snippet of The Sound of Silence?",
        "Could you find a trailer for the 2007 film Remy and also provide the viewers' rating?",
        "Can I see a clip of the movie 'Across the Universe'?",
        "What is a movie highlight featuring Darth Vader and released in 1977?",
        "I'm interested in watching a space opera movie with a character named Captain Kirk. Can you suggest one?",
        "Can you recommend a movie with a phenomenal ensemble cast, like Ocean's Eleven?",
        "Can you recommend a movie with Saoirse Ronan in it that has exceptional production design?",
        "Show me a thrilling and action-packed New Wave movie from the 1980s.",
        "What movie from the 1990s features a song that became a cultural phenomenon?",
        "Can you recommend a biographical film about a famous inventor?",
        "Can you recommend a movie that has received The recipient of numerous nominations for best picture?",
        "Is Marlon Brando in any movie directed by Mark Joffe, and rated R?",
        "What is the viewers' rating for the new musical film inspired by the life of Freddie Mercury?",
        "which musical movie, released in 1952, has the highest viewers' rating",
        "What's the viewers' rating for the movie Black Widow?",
        "What type of movie genre is 2001 classified as?",
        "Could you recommend a movie starring Heath Ledger that is suitable for children?",
        "Can you recommend a movie with cinematic musical arrangements?",
        "What movie did Cary Joji Fukunaga direct that provides a glimpse into the world of espionage?",
        "Could you show me a Western movie with standout soundtrack highlights?",
        "What is the plot of the movie Prison Break?",
        "When did Mufasa first appear in a movie",
        "What are the best fantasy movies similar to The Lord of the Rings?",
        "Should I avoid at all costs the film with the amazing set design?",
        "what is the highest Viewers' Rating comedy film from the 1990s",
        "I'm interested in watching a movie with Morgan Freeman and a mind-bending plot like Inception. Can you suggest a film?",
        "Show me a movie with musically enhanced scenes like in Deadpool.",
        "what is the viewers' rating for the 1995 crime movie starring Denzel Washington",
        "can you show me exclusive footage of the terrifying movie directed by David Lynch in 1977",
        "Can you recommend an Urban Fantasy movie that is considered unpredictable",
        "Can you recommend a movie with great cast cohesion, like The Avengers?",
        "Can I watch an extended trailer for a Western comedy film?",
        "What year did the movie Jai Ho come out and who directed it",
        "Are there any movies from 2005 featuring Severus Snape",
        "Who directed the James Bond film 'Skyfall' and what year was it released?",
        "What is the viewers' rating for the movie Superman",
        "Is there a movie with an A+ rating that is not rated for violent content?",
        "When was the movie Mulan released and who is the lead actress?",
        "Can you recommend a comedy film from 2005 with world domination as the plot?",
        "are there any recent movies with mixed reviews worth watching",
        "Show me a trailer of the latest movie directed by David O. Russell",
        "Show me a movie with the trailer that features the song 'Bohemian Rhapsody'",
        "Are there any movies that combine the genres of metal and harmonious music, and are emotionally resonant?",
        "Who directed the latest James Bond film that came out in 2019?",
        "What movie starring Charlize Theron has a four-star rating and is perfectly crafted by Tim Burton?",
        "Can you recommend a G-rated movie for a family movie night?",
        "Could I get an exclusive look at the new Back to the Future movie?",
        "Show me a trailer for a movie directed by Kate Winslet.",
        "show me a thriller film directed by david fincher with brad pitt as the main character",
        "Can you recommend an exhilarating and unique movie from the 1990s?",
        "Can I watch a preview of the Lion King movie with the song Circle of Life?",
        "Can you recommend a movie with an exciting treasure hunt plot starring Nicole Kidman?",
        "Can you highlight any movies about cyber warfare?",
        "Can I find any impactful movies by Robert De Niro?",
        "What is the viewers' rating for Sister Act",
        "I'm interested in a movie trailer breakdown for the latest Star Wars film featuring Finn.",
        "Which director is known for creating movies about supernatural forces?",
        "Can you show me the trailer release for the new Leonardo DiCaprio movie?",
        "Can you recommend a G-rated movie from the 90s with an exciting plot?",
        "What documentary film is rated NR",
        "what is the plot of Battle for justice",
        "When was the movie 1866 released and who directed it?",
        "What is the view rating for the movie 'Noir: A Love Story'?",
        "tell me about a raw and mind-bending science fiction film",
        "Can you provide a trailer breakdown for the film Harry Potter and the Sorcerer's Stone?",
        "Is Rachel McAdams starring in any new romantic films this year?",
        "I'm looking for a documentary film about the life of a famous undercover cop.",
        "Can you recommend a psychological thriller from 1976 that is considered unique?",
        "Show me the trailer for the new Spider-Man movie directed by Sam Raimi.",
        "What movie has engaging performances and a cast unity like 'The Breakfast Club'?",
        "What is the highest viewers' rated movie directed by JJ Abrams and starring Will Smith",
        "Can you recommend a top-notch movie directed by Rob Marshall?",
        "Can you recommend a Woody Allen movie that is both short and spellbinding?",
        "What is the plot of the movie where Sandra Bullock plays a high school student like Cher Horowitz in the film Fame",
        "What type of movie genre is The Matrix known for?",
        "Can you recommend a movie with an impressive ensemble cast",
        "find a horror movie from the 1980s with a high IMDb rating",
        "Can you play a preview for the movie Flawless directed by Joel Schumacher",
        "When is the trailer release date for Wes Anderson's next movie",
        "What crime movies were directed by Christopher Nolan?",
        "Can you tell me the year when the movie 'Inception' was released and its director?",
        "I'm looking for a movie featuring a heavy metal band in its plot",
        "Can you recommend a recent movie with a soundtrack as iconic as Black Panther's?",
        "Which Harry Potter movie has the highest viewers' rating?",
        "Can you recommend an electronic genre film from the 2000s?",
        "Show me a trailer for the new James Bond film with the song Skyfall.",
        "What is a phenomenal movie that showcases stellar performances by the actors?",
        "what is the best action movie from the 1980s",
        "What is the genre of the movie that features the song 'A Whole New World'?",
        "Can you recommend a movie with an outstanding ensemble cast?",
        "Show me a trailer of the movie The Dark Knight",
        "what type of movie genre is the indiana jones series",
        "what genre does the Harry Potter series belong to",
        "What movies in history have a PG-14 rating and fall into the thriller genre?",
        "Are there any movies with a similar plot to The Terminator released in the same year?",
        "can you recommend a movie with great instrumental soundtrack highlights",
        "is Maleficent considered an intense and gripping film",
        "who directed the classic film from 2002 in the thriller genre",
        "What year did the movie The Matrix come out and what is its genre?",
        "What movie features the song 'Don't You (Forget About Me)' and is set in a cyberpunk dystopia?",
        "Who directed the action film with Kylo Ren as the lead character",
        "Are there any action movies with a soundtrack featuring the song Eye of the Tiger?",
        "Show me a thriller movie from the 2010s with a high viewers' rating",
        "Can you recommend any Sci-Fi movies directed by John Doe that have a strong Plot and are highly rated?",
        "What movie features a memorable soundtrack by Pharrell Williams?",
        "Can you provide me with the plot of the movie Once Upon a Time in Hollywood directed by Quentin Tarantino?",
        "Who is the director of the film Annie",
        "Could you play the trailer for Saturday Night Fever?",
        "What is the viewers' rating for the movie Jailhouse Rock?",
        "Show me a movie directed by Spike Lee that has a memorable plot",
        "What is the viewers' rating for the movie Titanic?",
        "Is there a director known for making thought-provoking films similar to those of Christopher Nolan?",
        "Who directed the coming-of-age film with a love triangle that has an average rating of at least 7",
        "What is the viewers' rating for the film starring Hermione Granger?",
        "Can you recommend any movies with believable performances from 1976?",
        "What is the director of the opera film with an original score that is rated R",
        "Who directed the science fiction movie with James T. Kirk as one of the characters?",
        "Can you recommend a movie with a teaser that came out in 2008?"
    ],
    "sentences": [
        "Show me some 4-star rated movies that are not rated for general audience",
        "Can you recommend a movie from the 1950s that is a must-see?",
        "Who directed the movie King Leonidas and what year was it released?",
        "Who directed the film that takes place in the 1890s and features a teen romance?",
        "Can you recommend a movie with Al Pacino that has a 10/10 viewers' rating?",
        "who directed the movie Forrest Gump that does not have a specific rating?",
        "is Morpheus in any must-see historical films",
        "can you recommend a movie with a 5-star rating that features a robot uprising",
        "show me a movie directed by Rob Reiner that was released between 2002 and 2007",
        "Can you recommend a good historical drama available for streaming on Hulu?",
        "Who directed the action movie with Anne Hathaway that has a plot about time travel?",
        "Is Professor Dumbledore a character in any 3/10 rated movies?",
        "can you recommend a movie that won't leave me disappointed",
        "Can you give me an excerpt from the movie Vertigo?",
        "what is a solid documentary about the making of the lord of the rings trilogy",
        "Who directed The Grand Budapest Hotel",
        "Show me a movie with a 4.5-star rating.",
        "Find me a thriller released between 1980 and 1985.",
        "What is the latest Trailer release for a film directed by Denis Villeneuve?",
        "Can I see a Preview clip of the new science fiction movie directed by Denis Villeneuve?",
        "who directed the latest movie featuring Elastigirl and what year did it come out?",
        "Is General Grievous in any documentary film about independent cinema",
        "Do you have an extended trailer for Shrek?",
        "Can you recommend a cult movie released between 1984 and 1989?",
        "Can you recommend any movies directed by Robert Redford between 1980 and 2000?",
        "Unbelievable! Can you tell me the director of the movie Phantom Thread?",
        "Who directed the film Star Wars: The Force Awakens?",
        "Who directed the behind the scenes documentary about the making of Jurassic Park?",
        "Can you recommend a G or PG-rated movie similar to Interstellar?",
        "When did Captain America: The First Avenger come out?",
        "Is there a satire movie suitable for teens that is unrated?",
        "Can you recommend a movie with a love triangle released between 2020 and 2025?",
        "Could you recommend an animated movie with the song 'Under the Sea'?",
        "What is the genre of the movie Angelina Jolie starred in between 1977 and 1981",
        "What historical films from the 1840s are considered must-sees?",
        "Can you recommend a movie that features a truly special performance by Queen?",
        "Who directed the PG-rated movie Moonlight, and what year was it released?",
        "Who directed the movie Captain Phillips and what is the rating",
        "What genre is the movie The Bourne Ultimatum directed by Paul Greengrass",
        "Who directed the new James Bond film, and what is the musical score like?",
        "Can you recommend a supernatural movie with impressive set design from the year 2000",
        "I'm looking for a movie with a very detailed narrative that is not rated.",
        "Which mockumentary film has won an award for best costume design?",
        "I'm looking for a movie with dialogue writing that has received great reviews, perhaps something directed by The Dude.",
        "Have more movies been released between 1965 and 1970 than after 2000",
        "Can you recommend a survival movie released between 1975 and 1985?",
        "What movie starred Matt Damon and was directed by Darren Aronofsky between 2012 and 2015?",
        "What is the MPAA rating for Star Wars: Episode IX?",
        "Who directed Iron Man and what would viewers rate it?",
        "When was the movie Jurassic Park released?",
        "What is the genre of the movie Casino?",
        "What post-apocalyptic movies were released between 2018 and 2020?",
        "What year was the movie Moana released?",
        "What movie features a western showdown and is considered a must-see?",
        "What are some movies with a well-matched cast and crew similar to Bo Burnham's style?",
        "Could you tell me the year of release for The Terminator directed by James Cameron?",
        "Who produced the movie Jurassic World, and what is the storyline?",
        "Do you have any information about a movie with a production diary released between 2018 and 2023?",
        "What are the best movies released between 1964 and 1968?",
        "who directed the movie The Babadook",
        "Show me the trailer for Romeo + Juliet directed by Baz Luhrmann",
        "Is Amy Adams starring in any romantic comedies that came out between 1950 and 1960?",
        "What year was the movie Titanic released and which famous song is associated with it?",
        "Who directed the movie Yellow Submarine and what year was it released?",
        "What remarkable movies did M. Night Shyamalan direct in the 90s",
        "Can you recommend an astounding movie from the 1960s to 1962",
        "Who directed the movie Gladiator and what genre is it",
        "Is The Godfather considered a must-see movie by most viewers?",
        "Can you recommend a movie with remarkable production design and believable performances by Amy Adams that falls under the crime genre",
        "I'm looking for an in-depth documentary about movies made between 1963 and 1968, can you help?",
        "Who directed the movie I Will Follow Him and when was it released",
        "Show me a trailer for a romantic movie featuring Rachel McAdams",
        "Who won the Australian Academy of Cinema and Television Arts award for best actress between 1996 and 2000?",
        "Who directed the movie The Blues Brothers and what was the rating for costume design?",
        "Are there any must-see historical movies directed by David O. Russell?",
        "I heard the soundtrack for a new movie received a 3.5-star rating, which movie is it?",
        "Who directed the movie Titanic and what genre does it belong to?",
        "who directed the supernatural film The Lighthouse, released in 2019",
        "show me a classic movie from 1968 that won an Emmy Award",
        "What movie released between 1992 and 1998 has a similar genre to The Dark Knight?",
        "When was the movie Back to the Future released?",
        "Who directed the movie that has the song 'I Will Always Love You' in it?",
        "Tell me about any layered narrative movies released between 2020 and 2022",
        "Which movie features a character named Leonard 'Bones' McCoy?",
        "What 2011 movie directed by Patty Jenkins received standout performances by Jessica Chastain?",
        "Could you recommend a film with a Taylor Swift song in the trailer?",
        "Show me a trailer for Captain Marvel.",
        "Do you have any historical films from the 1980s that are not available for streaming?",
        "Can you recommend any M. Night Shyamalan movies available for streaming?",
        "Can I see the Trailer for The Wizard of Oz",
        "What year did the movie Ghostbusters, starring Emma Watson, receive its MPAA rating?",
        "What is the average score of the movie directed by Kenneth Branagh?",
        "Show me a trailer of the movie where Rust Cohle plays a lead role",
        "Is there a Robert Rodriguez movie that I can access through streaming services",
        "Can I stream on the go the film with the song 'A Whole New World' from Aladdin",
        "What movie features the song 'I Will Always Love You' and has an official trailer?",
        "Who directed the action movie with the title 'Die Hard' and a viewers' rating of 5 stars?",
        "Can I stream The Lion King with closed captioning?",
        "what are some good mystery movies with a twist ending",
        "who is the director of the goodfellas movie",
        "show me a good horror movie from the 1980s",
        "What is the plot of the movie The Blind Side, in which Sandra Bullock stars?",
        "Can I see a trailer for the new artificial intelligence uprising film?",
        "What is the MPAA rating for the movie Amadeus",
        "Could you tell me the genre of Interstellar and who directed The Wizard of Oz?",
        "Can you tell me the genre of the movie Predator directed by John McTiernan in 1987?",
        "Do you have any clips of the film Desperado, directed by Robert Rodriguez in 1995?",
        "What is the viewers' rating for the movie Frozen starring Rachel McAdams?",
        "Show me a trailer for a movie that premiered at the Sundance Film Festival",
        "Can I watch a movie available on a streaming platform that Christian Bale starred in as an undercover agent?",
        "Can you tell me the plot of King Kong?",
        "What is the MPAA rating for the movie M directed by Fritz Lang?",
        "what is a good comedy movie available on streaming apps with a PG rating",
        "who directed the classic film The Godfather and what year was it released",
        "What is the viewers' rating for the movie with the song 'Eye of the Tiger' performed by Survivor?",
        "Can you recommend a film with the song 'I Will Survive' and excellent makeup and hairstyling assessment?",
        "I'd like to hear an excerpt from a Ryan Reynolds movie from 2009.",
        "Can you recommend a James Bond film set in New York City?",
        "Can you recommend a movie from 2019 with impressive set design?",
        "Could you suggest a movie known for its exceptional costume and makeup design?",
        "Show me a movie from the 1980s with a soundtrack by Michael Jackson",
        "What is the MPAA rating for The Big Lebowski and where is the location of the film set?",
        "When is the trailer release for the new martial arts film starring Jet Li",
        "Who directed the movie approved by critics with the song 'Glory' by H.E.R. and Taylor Swift?",
        "Do you have any promo material for the disappointing M rated movie released in 2021?",
        "Can you recommend a movie with a song by Ariana Grande?",
        "can you recommend a movie featuring Elton John's music",
        "is there a movie where Ron Weasley plays a role as Alex in a G-rated film",
        "Who directed the Sundance Film Festival winner that came out in 2019 and has a female protagonist?",
        "Can you recommend a movie with a haunting score?",
        "I'm interested in finding a movie with a gripping soundtrack from the mid 2010s, perhaps one featuring Alicia Keys.",
        "I'm looking for a good inspiring movie that has recently been released in the box office",
        "What movies are not recommended by viewers that received Academy Awards",
        "Can you recommend a movie with a Witness Protection theme, composed by John Williams, and starring Chris Pratt?",
        "Can you recommend a cyberpunk dystopia film with a 4.5-star rating and available on streaming websites?",
        "I'm looking for a Sherlock Holmes movie starring Gerard Butler and directed by an award-winning director.",
        "Has Samuel L. Jackson ever won an award at the Sundance Film Festival?",
        "Can you recommend an innovative GP movie from the 1990s?",
        "what movie won the best picture oscar in 2019",
        "can you show me some footage from the latest James Bond movie",
        "I'm looking for a British Independent Film Award nominee starring Ryan Gosling, do you have any recommendations?",
        "Can you provide a visual effects critique for the latest Clint Eastwood movie?",
        "Can I watch on Netflix a comedy movie from the 1980s with Princess Leia as a character",
        "Who was the set designer for the film Casablanca?",
        "Name a movie from 1982 with great screen presence and the name of the producer",
        "who directed the movie with impressive visual effects",
        "can I get an inside look at the newest Luke Skywalker film",
        "what type of movie genre is the southpaw that is rated MA15+",
        "Can I have a first look at the trailer for the movie A that came out in 1980?",
        "Who is the director of the movie with the most plot twists",
        "Is Margot Robbie in any historical films that are a must see with a GP rating?",
        "Who directed the Harry Potter film featuring James P. Sullivan as a character?",
        "Can you recommend a women's sports movie from 1993?",
        "who directed the 2015 film about the American Civil War with a strong female lead",
        "do you have any recommendations for a good action movie",
        "Have movies with George Lucas as the director ever been rated 0 out of 10",
        "Is The Exorcist known for mixed reviews related to its fame?",
        "Can you recommend a movie from 2010-2015 with Beyoncé as one of the main characters?",
        "I'm looking for footage from the movie Casablanca, directed by Michael Curtiz. Can you help with that?",
        "find a thriller with iconic characters like Hannibal Lecter",
        "What is the main plot of the action film directed by Christopher Nolan?",
        "recommend a masterful sci-fi movie released in 2025",
        "Can you recommend a movie from the independent film era that is as thrilling as Hotel California",
        "What is the plot of the highest-rated action movie of the year?",
        "I'm looking for a movie with supernatural forces and a strong viewers' rating",
        "Can you recommend a GP-rated fantasy movie featuring the character Jason Voorhees?",
        "What year was Titanic released?",
        "Could you show me the trailer for the new Han Solo movie?",
        "show me a movie similar to Across the Universe with a feel-good soundtrack",
        "can you recommend a superhero movie directed by Tim Burton",
        "Could you recommend a movie directed by Wes Anderson and rated as the best picture?",
        "What year did the movie 'The Matrix' come out and who directed it?",
        "Can you recommend a cyberpunk movie that has exceeded expectations?",
        "where can I find a movie preview for a crime thriller",
        "What movie genre did the film Back to the Future belong to and who was the director?",
        "Show me the in-depth making-of featurette for the movie Happy",
        "What movie from the 80s is known for its remarkable use of special effects?",
        "What is a good movie producer for action films?",
        "What year was the movie American Sniper released, and who is the director?",
        "show me a thought-provoking movie with a Parental Guidance Suggested rating",
        "is there a production diary available for the movie Black Widow",
        "I'm curious to know if there were any notable stunt double scenes in the behind-the-scenes of a popular action movie.",
        "I am looking for a superhero origin film with LGBTQ+ representation",
        "Can you recommend a zombie movie directed by Sam Mendes?",
        "Please show me the trailer for M - the iconic German thriller film.",
        "Are there any fresh action films directed by Christopher Nolan?",
        "Can you recommend a movie with atmospheric scores that adds excitement to the scenes?",
        "Show me a movie from the 2000s that Dominic Toretto from the Fast & Furious series would enjoy.",
        "Can you recommend a historical film that received high viewers' ratings?",
        "What's the most action-packed film of all time according to viewers?",
        "What year did the movie Jasmine come out and who is the director?",
        "Show me a PG movie that features the song I Just Called to Say I Love You",
        "What is the viewers' rating for the latest Jordan Peele horror movie?",
        "What is the best musical of all time",
        "what is the viewers' rating for X movie",
        "What type of movie genre is Black Panther considered to be",
        "Can you recommend a Stellar movie from 2019?",
        "Can you show me a trailer for a movie where Jango Fett is a character?",
        "What movie features a song about a rescue mission?",
        "I'm in the mood for a classic war film. Do you have any recommendations?",
        "show me the trailer for the new Kristen Stewart film",
        "Which movie genre is best suited for a character like Dev Patel in a historical film?",
        "Can you recommend a courtroom film with a gripping plot and directed by Steven Spielberg?",
        "What was the highest-grossing movie in 2016?",
        "Show me the official trailer for a corporate espionage movie.",
        "Can you recommend any movies with a technological revolution theme?",
        "Is Snow White and the Seven Dwarfs considered an Unforgettable movie",
        "I'm interested in a movie related to punk rock rebellion, preferably directed by E.",
        "show me a trailer for the latest sci-fi movie starring Tom Cruise",
        "Can you recommend a fresh World War II resistance movie that's worth watching?",
        "Can I get a glimpse of the new horror movies involving human cloning",
        "I want to watch a film with an amazing song, maybe one with a song by Spike Lee?",
        "What year was A Few Good Men released and who directed it?",
        "What movie is known for its thrilling revenge plot just like in the Fast & Furious series with Dominic Toretto?",
        "show me a movie with an intriguing forbidden romance",
        "Can you suggest a good family drama movie with a rating of X or higher?",
        "Which movies feature characters from Norse mythology?",
        "Can you recommend a political movie directed by Quentin Tarantino",
        "Find me a movie from the 90s with a character named 'Indiana Jones'.",
        "What is the best movie that came out in the year 1997?",
        "Can you show me a clip from a movie featuring Arya Stark?",
        "Can you recommend a movie with approved musically enhanced scenes?",
        "Can I get exclusive access to the trailer of the latest Eye-opening documentary?",
        "recommend a moving drama rated X from 2005",
        "Who directed the action movie with a plot involving time travel and a dystopian future?",
        "Show me a trailer for a movie by George Lucas that features lightsabers.",
        "what is a good documentary to watch on the best streaming platform for this movie",
        "Could you recommend a movie with a beautiful orchestral arrangement?",
        "What environmental activism film did Guillermo del Toro direct?",
        "Is Forrest Gump considered a classic in the drama genre?",
        "Can you recommend a superhero movie directed by the Coen Brothers?",
        "What are some historical movies with action-packed scenes that have no adult content?",
        "Is there a movie directed by Steven Soderbergh that features the song Stayin' Alive?",
        "What is the viewers' rating for A Beautiful Mind",
        "Can you recommend a mystery movie released in the past year?",
        "Is Lieutenant Dan in any award-winning movies?",
        "Who is the director of the most impressive romantic comedy of the year?",
        "Does the movie Zombie have a high viewers' rating?",
        "What is the viewers' rating for the cyberpunk movie featuring a character named Neo?",
        "Can you recommend a good biography movie about a musician like Moon River for me to watch?",
        "Who are the Misfit cast members in the movie Singin' in the Rain?",
        "What EDM song is featured in the movie M?",
        "What is the plot of the popular choice movie road trip?",
        "Can you recommend a movie from the 90s with a strong female lead and a great Plot?",
        "Can you play the trailer for the new Wonder Woman movie?",
        "Who directed the game-changing film in 2006 with memorable performances?",
        "show me a musical with an exciting plot",
        "Is Johnny Depp in any action films rated GP, like Knives Out?",
        "I'm looking for a thriller involving organized crime and betrayal and double-cross.",
        "Who is the actor that plays the main character in the movie M?",
        "Could you recommend a Judd Apatow movie that is both funny and compelling?",
        "What Tony Award-winning movie did Vito Corleone appear in",
        "Which movie features a film montage similar to Mary Poppins",
        "Show me a movie with cinematography highlights and a song by U",
        "Are there any movie trailers for films about a zombie apocalypse directed by Joss Whedon?",
        "Is there a movie with time travel in it that was released in 1967?",
        "When is the trailer release of the movie Touching Love Story?",
        "Can you recommend a movie with some uplifting songs in its original score?",
        "Can you recommend a heartwarming movie released in 2010?",
        "Who directed the film 'Life after Death' and can you show me a trailer?",
        "What are the top-rated mystery movies released in the 1990s?",
        "What is the viewers' rating for The Bodyguard movie?",
        "Can you recommend a movie similar to The Truman Show with exceptional costumes?",
        "show me a trailer of the latest action movie directed by Kathryn Bigelow",
        "Show me a Sam Mendes movie with a suspenseful plot.",
        "What movie showings are playing Somewhere Over the Rainbow?",
        "Can you recommend any TV-MA rated movies with a social message?",
        "What year did the movie with the title 'Blazing Saddles' come out, and what genre does it belong to?",
        "Show me a movie with an opera scene and a 5-star rating",
        "Is there a new action movie coming out starring Tony Stark's character?",
        "Show me the official trailer for Paul Thomas Anderson's latest movie.",
        "Can you recommend a zombie movie with impressive visual effects?",
        "Is the plot of GoodFellas too complicated?",
        "Is Robert Downey Jr. starring in any upcoming action movies?",
        "Show me a trailer for the latest movie with Tom Cruise as the lead actor.",
        "who directed the epic film Gladiator",
        "What year was the movie GP released?",
        "Can you recommend me a Palme d'Or winner that was released in the 90s?",
        "Show me a movie that is unrated and has an exciting plot",
        "can I stream from tablet the superhero origin story movie about a character named Diana Prince",
        "Can you recommend a complicated sci-fi movie from 1978 directed by George Lucas?",
        "Can you provide me with a touching movie featuring Jake Gyllenhaal?",
        "Who directed the film 'Butch Cassidy and the Sundance Kid' released in 1969?",
        "Can you play the trailer for the movie rated B- that came out in 1999?",
        "What is the name of the biographical film about Adele's life?",
        "Can you recommend a movie with a great soundtrack similar to the one in A Star is Born",
        "Could you list some titles of movies with a strong character development and a thrilling plot from the 2000s?",
        "Can you recommend a solid GP-rated movie from the 1980s",
        "Can you recommend a romantic comedy with impressive production design?",
        "what is considered the most divisive supernatural movie of the past decade",
        "Can you recommend a romance film directed by Kathryn Bigelow?",
        "can you recommend a movie with subtle humor that is rated R",
        "I need information about an original and captivating movie directed by Christopher Nolan",
        "Is there a movie called Battle for Justice that was rated Not Rated?",
        "Show me a trailer of a movie starring Sandra Oh and Alfred Hitchcock.",
        "Show me a trailer for a movie featuring Hermione Granger",
        "Can you recommend a movie with a highlight performance by Nicole Kidman?",
        "What are some must-see movies that came out 12 years ago?",
        "Are there any cinema listings for Grease, the movie with the character Mad Hatter?",
        "Is Ava DuVernay's latest film rated PG-13?",
        "What is the viewers' rating for Lee Daniels' The Butler?",
        "Show me a movie trailer for the latest James Bond film.",
        "I heard Rob Reiner directed a film based on Frankenstein. Can you provide some details about it?",
        "Is the new Spider-Man movie getting good reviews",
        "Can you recommend a movie directed by Sofia Coppola that was a pleasant surprise?",
        "Who directed the highest-rated vampire movie of the 21st century?",
        "Give me the official trailer for the new buddy cop movie starring Ryan Reynolds and Samuel L. Jackson",
        "Can you recommend a thrilling survival adventure movie?",
        "Can I watch an extended preview of the upcoming movie directed by Christopher Nolan?",
        "Could you show me a clip from The Sound of Music with the song Unchained Melody?",
        "Is The Princess Bride streamable on Netflix?",
        "I'm interested in watching a movie with a featurette about Queen. Do you have any suggestions?",
        "Can you recommend any movies from 1973 directed by Steven Soderbergh that feature instrumental music?",
        "What year did the movie Les Misérables come out?",
        "Can you recommend a movie with a terrible rating?",
        "What sci-fi thriller film has the highest viewers' rating?",
        "Which film from the 1990s is considered the most haunting psychological thriller?",
        "show me a review of the action movie with the title Die Hard",
        "can you recommend a feel-good musical movie from the 2020s",
        "What is the viewers' rating for the movie starring R and Luke Skywalker?",
        "Is there a Tyler Perry movie released in 2015 with a song similar to Kiss from a Rose",
        "Show me the trailer for a movie with the character named Indiana Jones",
        "What is your opinion on The Hateful Eight? How would you rate it in terms of plot and acting?",
        "Can you recommend a compelling movie from 1975?",
        "show me a G-rated film for kids with an instrumental music soundtrack",
        "Are there any action movies with a strong female lead character, similar to the role played by Jennifer Lawrence in Red Sparrow?",
        "What is the viewers' rating for the most recent Spider-Man movie?",
        "Who directed the film with the title 'Unique' and a PG-13 rating?",
        "Can you recommend a good teen movie with Justin Bieber?",
        "can you recommend any groundbreaking movies directed by Akira Kurosawa",
        "Can you recommend a short musical film from the 1980s?",
        "Show me a movie set in a medieval kingdom from the year 2000",
        "Show me a trailer for a movie directed by a female filmmaker that came out in the 90s",
        "can you show me a trailer for the latest solid action movie",
        "What's a PG rated movie with a captivating plot",
        "What late 1990s action movies star Luke Skywalker?",
        "Who directed the space opera film released in 1980 with the title The Empire Strikes Back?",
        "I'm looking for a highly recommended crime thriller from the 90s",
        "Can you recommend a highly-rated movie from the 90s with the actor Tom Hanks?",
        "What is the viewers' rating for the movie Bohemian Rhapsody?",
        "I believe Exquisite is the best song in the movie I watched last night, can you identify the title?",
        "I'm looking for a movie that features the song Eye of the Tiger by A.R. Rahman.",
        "What is the love triangle movie starring Jennifer Lawrence that was a box office flop",
        "What is the plot of the movie Black Swan?",
        "Can you recommend an unrated action movie directed by John Woo?",
        "can you recommend a movie with cinematic music from the 1820s",
        "What psychological thriller films has Baz Luhrmann directed?",
        "Can you recommend a compelling film in the genre 'Glimpse' with a poor rating?",
        "I heard there's a PG-rated movie considered the best movie of the year. Can you give me more details?",
        "Show me a promotional clip for the movie featuring the song 'Can't Stop the Feeling'",
        "what is the plot of the epic movie Lawrence of Arabia",
        "What movie from 1965 features a song that became popular in the 1980s?",
        "What is the plot of A Nightmare on Elm Street?",
        "Are there any recent movies with a strong female lead character like Wonder Woman?",
        "can you recommend a sci-fi movie similar to Aliens",
        "recommend a mesmerizing and intense science fiction movie with supernatural forces",
        "What is a must-see movie from 1983 about World War II",
        "Can you recommend a comedic film from the 1990s with a viewers' rating of at least 4 stars",
        "Show me a trailer featuring Katniss Everdeen in a dystopian society rebel role",
        "Show me a trailer of the 2020 movie with a phenomenal soundtrack.",
        "What movie has the most cinematic visual effects of all time?",
        "What is the viewers' rating for the Sam Mendes movie about war?",
        "Can I watch a movie snippet of The Sound of Silence?",
        "Could you find a trailer for the 2007 film Remy and also provide the viewers' rating?",
        "Can I see a clip of the movie 'Across the Universe'?",
        "What is a movie highlight featuring Darth Vader and released in 1977?",
        "I'm interested in watching a space opera movie with a character named Captain Kirk. Can you suggest one?",
        "Can you recommend a movie with a phenomenal ensemble cast, like Ocean's Eleven?",
        "Can you recommend a movie with Saoirse Ronan in it that has exceptional production design?",
        "Show me a thrilling and action-packed New Wave movie from the 1980s.",
        "What movie from the 1990s features a song that became a cultural phenomenon?",
        "Can you recommend a biographical film about a famous inventor?",
        "Can you recommend a movie that has received The recipient of numerous nominations for best picture?",
        "Is Marlon Brando in any movie directed by Mark Joffe, and rated R?",
        "What is the viewers' rating for the new musical film inspired by the life of Freddie Mercury?",
        "which musical movie, released in 1952, has the highest viewers' rating",
        "What's the viewers' rating for the movie Black Widow?",
        "What type of movie genre is 2001 classified as?",
        "Could you recommend a movie starring Heath Ledger that is suitable for children?",
        "Can you recommend a movie with cinematic musical arrangements?",
        "What movie did Cary Joji Fukunaga direct that provides a glimpse into the world of espionage?",
        "Could you show me a Western movie with standout soundtrack highlights?",
        "What is the plot of the movie Prison Break?",
        "When did Mufasa first appear in a movie",
        "What are the best fantasy movies similar to The Lord of the Rings?",
        "Should I avoid at all costs the film with the amazing set design?",
        "what is the highest Viewers' Rating comedy film from the 1990s",
        "I'm interested in watching a movie with Morgan Freeman and a mind-bending plot like Inception. Can you suggest a film?",
        "Show me a movie with musically enhanced scenes like in Deadpool.",
        "what is the viewers' rating for the 1995 crime movie starring Denzel Washington",
        "can you show me exclusive footage of the terrifying movie directed by David Lynch in 1977",
        "Can you recommend an Urban Fantasy movie that is considered unpredictable",
        "Can you recommend a movie with great cast cohesion, like The Avengers?",
        "Can I watch an extended trailer for a Western comedy film?",
        "What year did the movie Jai Ho come out and who directed it",
        "Are there any movies from 2005 featuring Severus Snape",
        "Who directed the James Bond film 'Skyfall' and what year was it released?",
        "What is the viewers' rating for the movie Superman",
        "Is there a movie with an A+ rating that is not rated for violent content?",
        "When was the movie Mulan released and who is the lead actress?",
        "Can you recommend a comedy film from 2005 with world domination as the plot?",
        "are there any recent movies with mixed reviews worth watching",
        "Show me a trailer of the latest movie directed by David O. Russell",
        "Show me a movie with the trailer that features the song 'Bohemian Rhapsody'",
        "Are there any movies that combine the genres of metal and harmonious music, and are emotionally resonant?",
        "Who directed the latest James Bond film that came out in 2019?",
        "What movie starring Charlize Theron has a four-star rating and is perfectly crafted by Tim Burton?",
        "Can you recommend a G-rated movie for a family movie night?",
        "Could I get an exclusive look at the new Back to the Future movie?",
        "Show me a trailer for a movie directed by Kate Winslet.",
        "show me a thriller film directed by david fincher with brad pitt as the main character",
        "Can you recommend an exhilarating and unique movie from the 1990s?",
        "Can I watch a preview of the Lion King movie with the song Circle of Life?",
        "Can you recommend a movie with an exciting treasure hunt plot starring Nicole Kidman?",
        "Can you highlight any movies about cyber warfare?",
        "Can I find any impactful movies by Robert De Niro?",
        "What is the viewers' rating for Sister Act",
        "I'm interested in a movie trailer breakdown for the latest Star Wars film featuring Finn.",
        "Which director is known for creating movies about supernatural forces?",
        "Can you show me the trailer release for the new Leonardo DiCaprio movie?",
        "Can you recommend a G-rated movie from the 90s with an exciting plot?",
        "What documentary film is rated NR",
        "what is the plot of Battle for justice",
        "When was the movie 1866 released and who directed it?",
        "What is the view rating for the movie 'Noir: A Love Story'?",
        "tell me about a raw and mind-bending science fiction film",
        "Can you provide a trailer breakdown for the film Harry Potter and the Sorcerer's Stone?",
        "Is Rachel McAdams starring in any new romantic films this year?",
        "I'm looking for a documentary film about the life of a famous undercover cop.",
        "Can you recommend a psychological thriller from 1976 that is considered unique?",
        "Show me the trailer for the new Spider-Man movie directed by Sam Raimi.",
        "What movie has engaging performances and a cast unity like 'The Breakfast Club'?",
        "What is the highest viewers' rated movie directed by JJ Abrams and starring Will Smith",
        "Can you recommend a top-notch movie directed by Rob Marshall?",
        "Can you recommend a Woody Allen movie that is both short and spellbinding?",
        "What is the plot of the movie where Sandra Bullock plays a high school student like Cher Horowitz in the film Fame",
        "What type of movie genre is The Matrix known for?",
        "Can you recommend a movie with an impressive ensemble cast",
        "find a horror movie from the 1980s with a high IMDb rating",
        "Can you play a preview for the movie Flawless directed by Joel Schumacher",
        "When is the trailer release date for Wes Anderson's next movie",
        "What crime movies were directed by Christopher Nolan?",
        "Can you tell me the year when the movie 'Inception' was released and its director?",
        "I'm looking for a movie featuring a heavy metal band in its plot",
        "Can you recommend a recent movie with a soundtrack as iconic as Black Panther's?",
        "Which Harry Potter movie has the highest viewers' rating?",
        "Can you recommend an electronic genre film from the 2000s?",
        "Show me a trailer for the new James Bond film with the song Skyfall.",
        "What is a phenomenal movie that showcases stellar performances by the actors?",
        "what is the best action movie from the 1980s",
        "What is the genre of the movie that features the song 'A Whole New World'?",
        "Can you recommend a movie with an outstanding ensemble cast?",
        "Show me a trailer of the movie The Dark Knight",
        "what type of movie genre is the indiana jones series",
        "what genre does the Harry Potter series belong to",
        "What movies in history have a PG-14 rating and fall into the thriller genre?",
        "Are there any movies with a similar plot to The Terminator released in the same year?",
        "can you recommend a movie with great instrumental soundtrack highlights",
        "is Maleficent considered an intense and gripping film",
        "who directed the classic film from 2002 in the thriller genre",
        "What year did the movie The Matrix come out and what is its genre?",
        "What movie features the song 'Don't You (Forget About Me)' and is set in a cyberpunk dystopia?",
        "Who directed the action film with Kylo Ren as the lead character",
        "Are there any action movies with a soundtrack featuring the song Eye of the Tiger?",
        "Show me a thriller movie from the 2010s with a high viewers' rating",
        "Can you recommend any Sci-Fi movies directed by John Doe that have a strong Plot and are highly rated?",
        "What movie features a memorable soundtrack by Pharrell Williams?",
        "Can you provide me with the plot of the movie Once Upon a Time in Hollywood directed by Quentin Tarantino?",
        "Who is the director of the film Annie",
        "Could you play the trailer for Saturday Night Fever?",
        "What is the viewers' rating for the movie Jailhouse Rock?",
        "Show me a movie directed by Spike Lee that has a memorable plot",
        "What is the viewers' rating for the movie Titanic?",
        "Is there a director known for making thought-provoking films similar to those of Christopher Nolan?",
        "Who directed the coming-of-age film with a love triangle that has an average rating of at least 7",
        "What is the viewers' rating for the film starring Hermione Granger?",
        "Can you recommend any movies with believable performances from 1976?",
        "What is the director of the opera film with an original score that is rated R",
        "Who directed the science fiction movie with James T. Kirk as one of the characters?",
        "Can you recommend a movie with a teaser that came out in 2008?"
    ]
}