{
    "missing-entity-type": [
        "International aid organizations provide assistance to Caracas flood victims.",
        "Environmental organization proposes new conservation measures in The Andes Mountains.",
        "Local organization hosts annual charity event.",
        "Person appointed as the new manager of Chelsea Football Club .",
        "Local organization holds fundraiser to support victims of natural disaster.",
        "Local organization holds charity fundraiser for homeless in London .",
        "Local organization hosts charity fundraiser for homeless veterans.",
        "New technology company to open headquarters in downtown area.",
        "Environmental organization calls for protection of The Coral Triangle."
    ],
    "entity-not-found-overlap": [
        "The Claude Monet Foundation announces a new scholarship for young artists.",
        "Sydney Opera House to undergo major renovations.",
        "Iris Apfel Foundation donation to support art education in underserved communities.",
        "The Atlanta Braves clinch the division title.",
        "Biggest music festival in Austin City Limits Live at The Moody Theater history set to begin next week.",
        "Coventry City Council announces plans for new public transportation system.",
        "The famous Venice Biennale art exhibition attracts thousands of visitors from around the world.",
        "Great Barrier Reef Foundation receives $500,000 in new funding for conservation efforts.",
        "Sydney Opera House announces new concert series.",
        "The Chicago Bulls have signed a new head coach."
    ],
    "entity-not-found": [
        "General James Mattis resigns as Secretary of Defense.",
        "Israeli Prime Minister Benjamin Netanyahu visits Jerusalem for security summit.",
        "U.S. Immigration and Customs Enforcement arrests 100 undocumented immigrants in nationwide operation.",
        "Lakers defeat Warriors in overtime thriller.",
        "Jerusalem mayor declares new city-wide environmental initiative.",
        "Brazilian government announces new environmental protection measures.",
        "New York City to invest $10 million in public transportation upgrades.",
        "Whole Foods Market, Inc. announces plan to open 10 new stores across the country.",
        "Renowned chef Jamie Oliver partners with Whole Foods Market, Inc. to promote healthy eating and cooking.",
        "Protesters gather outside Whole Foods Market, Inc. headquarters to demand better treatment of employees.",
        "The American Meteorological Society issues a warning for severe storms in the Midwest.",
        "Financial scandal rocks major German bank.",
        "European Union fines Uber Technologies Inc. for breaching competition law.",
        "Ride-sharing giant Uber Technologies Inc. reports revenue exceeding $10 billion in the last quarter.",
        "A massive crowd gathers in Times Square to ring in the New Year.",
        "Amtrak introduces new high-speed rail service between Niagara Falls and major cities in Canada and USA.",
        "Russian authorities investigate alleged corruption in Moscow.",
        "RAF Lakenheath conducts joint military exercise with Afghan forces in Kabul.",
        "Shanghai reports surge in new COVID-19 cases.",
        "Actor Dwayne 'The Rock' Johnson to star in new action-packed film.",
        "IMF raises global growth forecast for 2021.",
        "Elon Musk announces new electric vehicle model for Tesla, Inc. .",
        "Stock prices surge as Tesla, Inc. unveils plans for new manufacturing plant.",
        "California governor visits Tesla, Inc. headquarters to discuss renewable energy initiatives."
    ],
    "not-allowed-entity-type": [
        "Apple announces plans to release new iPhone with 5G capabilities later this year.",
        "Top designers from around the world are set to showcase their latest collections at Cape Town Fashion Week.",
        "Renowned fashion blogger will be attending Cape Town Fashion Week for the first time.",
        "Local boutiques are gearing up for the influx of visitors during Cape Town Fashion Week.",
        "Iris Apfel set to be honored at the upcoming Met Gala.",
        "The It Gets Better Project releases new video featuring LGBTQ+ youth",
        "Celebrities speak out in support of It Gets Better Project",
        "Apple Inc. unveils the latest iPhone model with advanced features.",
        "Apple Inc. announces the launch of the new iPhone 13.",
        "Apple announces new iPhone 13 launch date.",
        "Apple Inc. announces the launch of the new iPhone 13.",
        "President Biden delivers his first State of the Union address.",
        "Tokyo Olympics closing ceremony celebrates the perseverance of athletes worldwide.",
        "Apple Inc. unveils latest iPhone with enhanced camera features.",
        "Apple unveils new line of iPhone models at annual product event."
    ],
    "low-logprob": [
        "The film festival in Venice attracts top talent and cinephiles from around the world.",
        "NASA successfully launches new satellite into orbit.",
        "German Chancellor Angela Merkel meets with French President Emmanuel Macron in Paris.",
        "Uber driver charged with assault in New York City.",
        "Walt Disney Parks and Resorts announces new expansion plans in Orlando.",
        "Famous British actor to donate personal art collection to the British Museum .",
        "Dolly Parton donates $1 million to fund COVID-19 vaccine research.",
        "Elton John to perform at the Staples Center in Los Angeles next week.",
        "The United Nations and Pope Francis call for peace in war-torn region.",
        "Pope Francis delivers historic address to the United States Congress.",
        "Istanbul, Turkey is set to host the next United Nations Climate Change Conference.",
        "Elon Musk's SpaceX successfully launches latest batch of Starlink satellites.",
        "Tesla announces plans to build new factory in Texas.",
        "Elon Musk's SpaceX launches new batch of Starlink satellites.",
        "APPLE ANNOUNCES NEW IPHONE RELEASE DATE.",
        "Tesla announces plans to build new manufacturing plant in Texas by 2022.",
        "Environmental organization launches campaign to preserve the Grand Canyon's natural beauty.",
        "Tesla to unveil new electric vehicle with longer battery life at upcoming auto show.",
        "Former President Trump starts his own social media platform called 'Truth Social'.",
        "Senator Rand Paul calls for bipartisan effort to pass new infrastructure bill.",
        "Protesters demand justice for George Floyd in downtown Minneapolis.",
        "United Nations calls for urgent humanitarian aid to the Rohingya refugees in Bangladesh.",
        "BARCELONA - NEW MAYOR ELECTED AFTER CLOSE ELECTION.",
        "Netflix announces new series featuring Indya Moore in lead role.",
        "Jeff Corwin's latest book on endangered species hits bestseller list.",
        "Apple announces plans to release new iPhone model next month.",
        "Sydney Opera House to host international music festival next month.",
        "President of Mexico visits China for trade talks.",
        "New York Times names new editor-in-chief.",
        "The UN refugee agency calls for urgent support for displaced Rohingya in Bangladesh.",
        "President Biden delivers speech on infrastructure plan in Pittsburgh.",
        "New York City Marathon organizers announce new safety measures for upcoming race.",
        "CEO of Tesla, Elon Musk, reveals plans for a new electric vehicle model.",
        "President Biden announces new infrastructure plan in speech to Congress.",
        "The United Nations releases new report on global climate change.",
        "Leonardo da Vinci's masterpiece 'Mona Lisa' attracts millions of visitors to the Louvre Museum in Paris each year.",
        "Amazon.com, Inc. reports record-breaking sales during the holiday season.",
        "CEO of Dubai-based company arrested for fraud.",
        "Famous chef opens new restaurant in Melbourne.",
        "Gigi Hadid walks the runway for top designer in Paris Fashion Week.",
        "Kobe Bryant leads the Lakers to victory in the NBA Finals.",
        "Brazilian President to visit United States next week for trade talks.",
        "Beyoncé's new album debuts at number one on the Billboard charts.",
        "Google announces partnership with UNICEF to provide internet access in developing countries.",
        "Wangari Mathai Foundation partners with UNICEF to promote sustainable development in Africa.",
        "Tokyo Olympics to ban all spectators due to rising COVID-19 cases.",
        "Vladimir Putin meets with world leaders at the G20 summit.",
        "Local businesses benefit from the influx of visitors during the Edinburgh Fringe Festival.",
        "CEO of tech giant announces plans for new headquarters in downtown Jerusalem .",
        "The mayor of Los Angeles has announced a new initiative to combat homelessness in the city.",
        "Renowned chef opens new restaurant in downtown Europa.",
        "New York City announces partnership with local organizations to provide free summer concerts in Central Park.",
        "New York City Mayor announces public transportation improvements",
        "Celebrities flock to Paris Fashion Week for the latest trends.",
        "Tesla unveils new electric car model at annual conference.",
        "Tokyo Olympics postponed due to COVID-19 pandemic.",
        "Highly anticipated book release from Oprah's publishing company.",
        "Heavy rain causes flooding in Los Angeles area.",
        "Investigation reveals ties between mayor's office and local construction company.",
        "President Biden signs infrastructure bill into law.",
        "Apple CEO Tim Cook unveils new iPhone model.",
        "George Floyd Memorial Foundation awarded grant for police reform efforts.",
        "The Louvre museum in Paris houses a priceless collection of Rembrandt's works.",
        "Uber CEO resigns amidst controversy.",
        "Simone Biles wins gold in gymnastics at Tokyo Olympics.",
        "Dwayne \"The Rock\" Johnson announces new partnership with fitness brand.",
        "Exhibit featuring artifacts from Edmund Hillary's historic Everest expedition opens at National Geographic museum.",
        "Top chef from Rio de Janeiro opens new restaurant in New York City's trendy SoHo district.",
        "Mufti Menk's charity organization donates to orphanage in Wittenberg.",
        "Microsoft CEO Satya Nadella visits London to discuss tech innovations.",
        "APPLE REPORTS RECORD SALES FOR LATEST iPHONE MODEL.",
        "Europa's new president vows to tackle climate change.",
        "Angela Merkel reelected as German Chancellor for fourth term.",
        "United Airlines announces the addition of new flights to Hawaii .",
        "Chicago Bulls defeat the Los Angeles Lakers in a thrilling overtime game.",
        "Celebrities spotted wearing Dolce & Gabbana designs at the Oscars.",
        "Teenage climate activist speaks at United Nations summit in New York.",
        "Brie Larson wins Best Actress at the Atlanta Film Festival.",
        "Subaru Corporation announces plans for new electric vehicle model.",
        "President Bolsonaro visits Brasília, Brazil for an emergency cabinet meeting.",
        "Marissa Mayer appointed as the new CEO of a major tech company.",
        "Environmental group protest proposed industrial development near Sundarbans National Park.",
        "Sydney to host the 2023 FIFA Women's World Cup.",
        "Global organization announces plans for climate change summit in Reykjavik.",
        "Renowned chef Mario Batali opens new restaurant in Istanbul.",
        "Hundreds in New York march in support of Wangari Mathai's conservation efforts.",
        "The CEO of Tesla, Elon Musk, announced the company's plans to build a new Gigafactory in Texas.",
        "Russian cosmonauts and Chinese astronauts conduct joint space mission.",
        "The Nature Conservancy launches new initiative to protect endangered species in South America.",
        "New York City Mayor announces plans for citywide clean energy initiative.",
        "The United Nations issues a new report on climate change.",
        "The Australian Zoo, founded by Bindi Irwin's family, celebrates its 50th anniversary.",
        "Police arrest man for violating restraining order filed by The American Civil Liberties Union.",
        "President Biden signs executive order on climate change.",
        "Angela Merkel calls for unity among European leaders in addressing the refugee crisis.",
        "European Union imposes sanctions on Russian officials over Navalny poisoning.",
        "Japan's Prime Minister announces economic stimulus package.",
        "Malala Yousafzai awarded Nobel Peace Prize for her advocacy for girls' education.",
        "APPLE LAUNCHES NEW IPHONE 13 WITH ENHANCED CAMERA.",
        "Pentagon announces new military strategy in Indo-Pacific region.",
        "The Tokyo Auto Salon showcases the latest innovations in automotive technology.",
        "Federal Bureau of Investigation announces new cybercrime task force in partnership with major tech companies.",
        "Google co-founder Larry Page steps down as CEO of Alphabet",
        "The new Ratan Tata Foundation to provide aid to communities in need.",
        "Rio de Janeiro to host 2024 Summer Olympics.",
        "Investigation reveals ties between Russian oligarch and Serena Williams' tennis academy.",
        "Dubai International Airport ranked as the world's busiest airport for international travel in 2020.",
        "Nelson Mandela Foundation to open new center in England.",
        "Attendees from all over the world flock to Tokyo to attend the famous Auto Salon.",
        "Apple Inc. releases new iPhone with advanced camera technology.",
        "Coventry City Council adopts new environmental sustainability initiative.",
        "Tokyo Olympics organizers announce new guidelines for spectators.",
        "The city of Tokyo prepares for the upcoming Summer Olympics with extensive renovations to its sports facilities.",
        "Elon Musk's SpaceX to collaborate with Mars Mission Control for upcoming mission.",
        "Barack Obama meets with leaders of G7 countries to discuss global economic recovery.",
        "The Los Angeles Lakers have signed a multi-year contract extension with their head coach.",
        "Berlin police officer Samantha Brown honored for bravery.",
        "India releases new economic growth forecast for Mumbai region.",
        "The mayor of Manchester delivers a speech at the town hall.",
        "Los Angeles Mayor announces new funding for homeless shelters.",
        "The Sierra Club launches new campaign to protect endangered species in the Amazon.",
        "Megan Rapinoe wins Golden Boot award in Women's World Cup.",
        "Tanzanian government to launch conservation effort for Mount Kilimanjaro.",
        "The White House confirms President Biden's plan to increase infrastructure spending.",
        "Europa's trade agreement with Asia brings economic opportunities.",
        "The United Nations calls for ceasefire in conflict-torn region.",
        "Prominent singer from Rio de Janeiro, Brazil, to perform a charity concert for children in need.",
        "Former US President Obama awarded The Nobel Foundation Peace Prize.",
        "NASA's Lunar Gateway project moves forward with new partnership.",
        "Elon Musk's SpaceX launches another batch of Starlink satellites into orbit.",
        "Rio de Janeiro to host the 2023 World Youth Day.",
        "New study finds correlation between coffee consumption and decreased risk of heart disease.",
        "Philanthropist donates $1 million to local children's hospital.",
        "CDC warns of potential new COVID-19 variant.",
        "Tech giant Apple announces the launch of new iPhone models.",
        "Local organization hosts annual charity event in Melbourne.",
        "Geo Neptune, a Native American artist, creates stunning sculptures from soapstone.",
        "National Network for Immigrant and Refugee Rights protests outside City Hall in Paris.",
        "Barack Obama delivered a speech on foreign policy at the United Nations General Assembly.",
        "Flooding in New Orleans prompts emergency evacuations as Hurricane Marco approaches the Gulf Coast.",
        "Amazon announces plans to open new headquarters in Arlington, Virginia, near Washington, D.C.",
        "Australian artist creates a stunning replica of the Sydney Opera House using recycled materials.",
        "Director of WHO commends Mumbai's efforts in combating COVID-19.",
        "Amazon rainforest fire in Brazil continues to devastate wildlife and indigenous communities.",
        "Cape Town University announces new scholarship program for foreign students.",
        "Tokyo Olympics to be held without spectators due to COVID-19 concerns.",
        "Local high school to host It Gets Better Project assembly",
        "The astronauts at Johnson Space Center are undergoing rigorous training for the upcoming Mars mission.",
        "Tokyo Olympics postponed until 2021 due to COVID-19 pandemic.",
        "RALPH LAUREN ANNOUNCES PLAN TO LAUNCH SUSTAINABLE FASHION LINE.",
        "International Space Station crew members conduct spacewalk under the guidance of Jim Bridenstine.",
        "Vancouver, Canada, Prime Minister Trudeau announces new climate change initiative.",
        "Tokyo Olympics organizers announce new COVID-19 safety measures for athletes.",
        "Prince Harry and Meghan Markle make surprise visit to Tokyo.",
        "Tech giant Apple announces new iPhone release.",
        "President Erdogan announces new economic reforms to boost growth in Istanbul.",
        "Microsoft announced that Satya Nadella will be stepping down as CEO.",
        "Former professional athlete volunteers to coach for Youth Sports Organization.",
        "The New York Times reports that the CEO of Apple Inc. will be stepping down.",
        "Tech giant Apple launches new iPhone with improved camera and battery life.",
        "Prime Minister Trudeau meets with German Chancellor Merkel to discuss trade.",
        "Local organization hosts fundraiser event to support cancer research.",
        "A new exhibition featuring Salvador Dalí's surrealist masterpieces opens at The Prado Museum in Madrid.",
        "The American Civil Liberties Union files lawsuit against local school district.",
        "Apple Inc. announces the release of its latest iPhone model.",
        "London Mayor announces plan to reduce air pollution in the city center.",
        "French President Macron to visit Paris, France next week.",
        "The Tate Modern in London will be hosting a special exhibition featuring contemporary African artists.",
        "Fashion designers from around the world showcase their collections at Paris Fashion Week.",
        "CEO of Armani steps down amid restructuring of company.",
        "Sierra Club launches campaign to protect endangered species in the Amazon rainforest.",
        "The CEO of Apple Inc. announces a new product launch event.",
        "Emily Rodriguez appointed as new chief executive officer of Chicago-based tech company.",
        "Donatella Versace to open new flagship store in The Dubai Mall.",
        "Sarah Johnson, a renowned scientist, wins the Nobel Prize in Physics for her groundbreaking research on quantum mechanics.",
        "The Sistine Chapel ceiling painted by Michelangelo Buonarroti has been restored to its former glory.",
        "The Walt Disney Company announces a new theme park opening in China.",
        "Olivia Morales has been appointed as the new CEO of a leading tech company.",
        "Brazilian president vows to protect the Amazon Rainforest from deforestation.",
        "New Zealand Prime Minister Jacinda Ardern meets with European Union leaders in Brussels.",
        "The Great Barrier Reef Marine Park Authority has implemented new measures to protect the fragile ecosystem.",
        "Canada reports record-breaking temperatures in Toronto.",
        "Student Emma Williams wins prestigious scholarship.",
        "Microsoft's Terry Myerson Announces New Product Launch.",
        "New York Times best-selling author to give book signing at Wallace County Public Library.",
        "The New York Times correspondent covers the latest developments in the Middle East.",
        "China's President Xi Jinping meets with South Korean leader for trade talks.",
        "UK government announces plans to increase funding for mental health services.",
        "The Athens Symphony Orchestra, founded in 1949, celebrates its 70th anniversary with a special performance.",
        "British Prime Minister announces new economic stimulus package.",
        "Israel's Ministry of Health announces new vaccine mandate for all healthcare workers in Jerusalem.",
        "The Georgia O'Keeffe Museum in Santa Fe showcases the artist's iconic works.",
        "APPLE ANNOUNCES LAUNCH OF NEW IPHONE MODEL.",
        "Donatella Versace launches new fashion line in The Soho District.",
        "London, UK braces for heavy snowfall as winter storm approaches.",
        "South African president visits Cape Town for environmental summit.",
        "The British Museum unveils new exhibit on ancient Mesopotamia.",
        "Germany's Chancellor Merkel addresses economic policy in Berlin.",
        "Berlin, Germany reports a surge in tourism despite COVID-19 restrictions.",
        "Sony Corporation unveils plans for new flagship store in New York City.",
        "Raf Simons named creative director of fashion house.",
        "Environmental organization launches campaign to protect endangered species in the Amazon rainforest.",
        "Russian cosmonauts conduct spacewalk outside International Space Station.",
        "Apple unveils new iPhone with advanced facial recognition technology and improved camera features.",
        "Visitors enjoy the scenic views and architecture of The Getty Center in Los Angeles.",
        "Celebrity chef Rachael Ray to open new restaurant in New York City.",
        "Michelangelo Buonarroti's masterpiece, the Pieta, attracts millions of visitors to Vatican City each year.",
        "Anthony Nguyen Foundation donates $1 million to local hospital.",
        "The New York Yankees sign a new pitcher for the upcoming season.",
        "Chinese President Xi Jinping meets with Russian President Vladimir Putin in Moscow.",
        "Famous actress rumored to be dating billionaire entrepreneur.",
        "Tech giant Apple unveils new iPhone 13.",
        "The American Civil Liberties Union advocates for the rights of individuals in the criminal justice system.",
        "New York City's famous Stonewall Inn celebrates 50th anniversary.",
        "Prince Harry and Meghan Markle to step back as senior members of the royal family.",
        "Former President Obama delivers speech at United Nations General Assembly.",
        "Famous actor Tom Hanks to star in new World War II film.",
        "Several large corporations, including Microsoft and Google, are investing in the new tech hub in Istanbul .",
        "Elon Musk announces plans for new space exploration project.",
        "President Biden announces plan to invest $1 trillion in infrastructure, aiming to create jobs and improve the nation's roads and bridges.",
        "Europa League final match to be held in Gdansk, Poland.",
        "Isabella Costa re-elected as president of the United Nations General Assembly.",
        "The White House plans to unveil new infrastructure proposal next week.",
        "Elon Musk's SpaceX launches 60 new Starlink satellites into orbit.",
        "Michelle Obama Foundation partners with local organizations to support community health programs.",
        "Elon Musk's SpaceX successfully launches 60 more Starlink satellites into orbit.",
        "The mayor of Istanbul unveils plans for a new public transportation system.",
        "German Chancellor Angela Merkel meets with French President Macron to discuss EU trade agreements.",
        "WHO issues new guidelines for COVID-19 prevention.",
        "The National Association for the Advancement of Colored People holds virtual event to celebrate Black History Month.",
        "Human Rights Watch criticizes Chinese government's treatment of Uighur Muslims.",
        "Former police officer convicted in the killing of George Floyd sentenced to 22.5 years in prison.",
        "The Duke and Duchess of Sussex, Prince Harry and Meghan Markle, attend the premiere of their new documentary film in London.",
        "Christian Dior announces Donatella Versace as the new creative director for their upcoming couture collection.",
        "Brazil implements new environmental regulations to protect the Amazon rainforest.",
        "Gordon Ramsay to open new restaurant in Mumbai.",
        "CEO of the Coca-Cola Company visits new bottling plant in India.",
        "Sarah Gonzalez appointed as the new CEO of the tech company.",
        "Local farmers at Smithfield Farmers' Market report record sales this season.",
        "Wildlife Trust of India receives international recognition for its efforts in protecting endangered species.",
        "ICE raids target employers hiring unauthorized workers.",
        "CEO of American Red Cross steps down amid controversy.",
        "The mayor of Rio de Janeiro, Brazil, announced a new initiative to tackle crime in the city.",
        "Tech giant Apple launches new iPhone with enhanced camera features.",
        "California wildfires rage on, forcing thousands to evacuate.",
        "Seoul and Beijing sign trade agreement to boost economic cooperation.",
        "Seoul mayor found dead in apparent suicide.",
        "São Paulo, Brazil to host international economic summit next month.",
        "Aaron Rodgers leads the Packers to victory at Lambeau Field.",
        "German Chancellor Angela Merkel meets with French President Emmanuel Macron to discuss EU economic reforms.",
        "Dr. Anthony Fauci warns of potential 'resurgence' of COVID-19 in the fall.",
        "The Met Office issues severe weather warning for the south of England.",
        "The iconic painting 'The Persistence of Memory' by Salvador Dalí will be on display at The Prado Museum for a limited time.",
        "NASA announces partnership with Indian Space Research Organisation for Lunar Gateway project.",
        "Tensions rise between United Nations and North Korea.",
        "Best-selling author Stephen King to appear at book signing in New York City."
    ],
    "sentences": [
        "International aid organizations provide assistance to Caracas flood victims.",
        "Environmental organization proposes new conservation measures in The Andes Mountains.",
        "Local organization hosts annual charity event.",
        "Person appointed as the new manager of Chelsea Football Club .",
        "Local organization holds fundraiser to support victims of natural disaster.",
        "Local organization holds charity fundraiser for homeless in London .",
        "Local organization hosts charity fundraiser for homeless veterans.",
        "New technology company to open headquarters in downtown area.",
        "Environmental organization calls for protection of The Coral Triangle.",
        "The Claude Monet Foundation announces a new scholarship for young artists.",
        "Sydney Opera House to undergo major renovations.",
        "Iris Apfel Foundation donation to support art education in underserved communities.",
        "The Atlanta Braves clinch the division title.",
        "Biggest music festival in Austin City Limits Live at The Moody Theater history set to begin next week.",
        "Coventry City Council announces plans for new public transportation system.",
        "The famous Venice Biennale art exhibition attracts thousands of visitors from around the world.",
        "Great Barrier Reef Foundation receives $500,000 in new funding for conservation efforts.",
        "Sydney Opera House announces new concert series.",
        "The Chicago Bulls have signed a new head coach.",
        "General James Mattis resigns as Secretary of Defense.",
        "Israeli Prime Minister Benjamin Netanyahu visits Jerusalem for security summit.",
        "U.S. Immigration and Customs Enforcement arrests 100 undocumented immigrants in nationwide operation.",
        "Lakers defeat Warriors in overtime thriller.",
        "Jerusalem mayor declares new city-wide environmental initiative.",
        "Brazilian government announces new environmental protection measures.",
        "New York City to invest $10 million in public transportation upgrades.",
        "Whole Foods Market, Inc. announces plan to open 10 new stores across the country.",
        "Renowned chef Jamie Oliver partners with Whole Foods Market, Inc. to promote healthy eating and cooking.",
        "Protesters gather outside Whole Foods Market, Inc. headquarters to demand better treatment of employees.",
        "The American Meteorological Society issues a warning for severe storms in the Midwest.",
        "Financial scandal rocks major German bank.",
        "European Union fines Uber Technologies Inc. for breaching competition law.",
        "Ride-sharing giant Uber Technologies Inc. reports revenue exceeding $10 billion in the last quarter.",
        "A massive crowd gathers in Times Square to ring in the New Year.",
        "Amtrak introduces new high-speed rail service between Niagara Falls and major cities in Canada and USA.",
        "Russian authorities investigate alleged corruption in Moscow.",
        "RAF Lakenheath conducts joint military exercise with Afghan forces in Kabul.",
        "Shanghai reports surge in new COVID-19 cases.",
        "Actor Dwayne 'The Rock' Johnson to star in new action-packed film.",
        "IMF raises global growth forecast for 2021.",
        "Elon Musk announces new electric vehicle model for Tesla, Inc. .",
        "Stock prices surge as Tesla, Inc. unveils plans for new manufacturing plant.",
        "California governor visits Tesla, Inc. headquarters to discuss renewable energy initiatives.",
        "Apple announces plans to release new iPhone with 5G capabilities later this year.",
        "Top designers from around the world are set to showcase their latest collections at Cape Town Fashion Week.",
        "Renowned fashion blogger will be attending Cape Town Fashion Week for the first time.",
        "Local boutiques are gearing up for the influx of visitors during Cape Town Fashion Week.",
        "Iris Apfel set to be honored at the upcoming Met Gala.",
        "The It Gets Better Project releases new video featuring LGBTQ+ youth",
        "Celebrities speak out in support of It Gets Better Project",
        "Apple Inc. unveils the latest iPhone model with advanced features.",
        "Apple Inc. announces the launch of the new iPhone 13.",
        "Apple announces new iPhone 13 launch date.",
        "President Biden delivers his first State of the Union address.",
        "Tokyo Olympics closing ceremony celebrates the perseverance of athletes worldwide.",
        "Apple Inc. unveils latest iPhone with enhanced camera features.",
        "Apple unveils new line of iPhone models at annual product event.",
        "The film festival in Venice attracts top talent and cinephiles from around the world.",
        "NASA successfully launches new satellite into orbit.",
        "German Chancellor Angela Merkel meets with French President Emmanuel Macron in Paris.",
        "Uber driver charged with assault in New York City.",
        "Walt Disney Parks and Resorts announces new expansion plans in Orlando.",
        "Famous British actor to donate personal art collection to the British Museum .",
        "Dolly Parton donates $1 million to fund COVID-19 vaccine research.",
        "Elton John to perform at the Staples Center in Los Angeles next week.",
        "The United Nations and Pope Francis call for peace in war-torn region.",
        "Pope Francis delivers historic address to the United States Congress.",
        "Istanbul, Turkey is set to host the next United Nations Climate Change Conference.",
        "Elon Musk's SpaceX successfully launches latest batch of Starlink satellites.",
        "Tesla announces plans to build new factory in Texas.",
        "Elon Musk's SpaceX launches new batch of Starlink satellites.",
        "APPLE ANNOUNCES NEW IPHONE RELEASE DATE.",
        "Tesla announces plans to build new manufacturing plant in Texas by 2022.",
        "Environmental organization launches campaign to preserve the Grand Canyon's natural beauty.",
        "Tesla to unveil new electric vehicle with longer battery life at upcoming auto show.",
        "Former President Trump starts his own social media platform called 'Truth Social'.",
        "Senator Rand Paul calls for bipartisan effort to pass new infrastructure bill.",
        "Protesters demand justice for George Floyd in downtown Minneapolis.",
        "United Nations calls for urgent humanitarian aid to the Rohingya refugees in Bangladesh.",
        "BARCELONA - NEW MAYOR ELECTED AFTER CLOSE ELECTION.",
        "Netflix announces new series featuring Indya Moore in lead role.",
        "Jeff Corwin's latest book on endangered species hits bestseller list.",
        "Apple announces plans to release new iPhone model next month.",
        "Sydney Opera House to host international music festival next month.",
        "President of Mexico visits China for trade talks.",
        "New York Times names new editor-in-chief.",
        "The UN refugee agency calls for urgent support for displaced Rohingya in Bangladesh.",
        "President Biden delivers speech on infrastructure plan in Pittsburgh.",
        "New York City Marathon organizers announce new safety measures for upcoming race.",
        "CEO of Tesla, Elon Musk, reveals plans for a new electric vehicle model.",
        "President Biden announces new infrastructure plan in speech to Congress.",
        "The United Nations releases new report on global climate change.",
        "Leonardo da Vinci's masterpiece 'Mona Lisa' attracts millions of visitors to the Louvre Museum in Paris each year.",
        "Amazon.com, Inc. reports record-breaking sales during the holiday season.",
        "CEO of Dubai-based company arrested for fraud.",
        "Famous chef opens new restaurant in Melbourne.",
        "Gigi Hadid walks the runway for top designer in Paris Fashion Week.",
        "Kobe Bryant leads the Lakers to victory in the NBA Finals.",
        "Brazilian President to visit United States next week for trade talks.",
        "Beyoncé's new album debuts at number one on the Billboard charts.",
        "Google announces partnership with UNICEF to provide internet access in developing countries.",
        "Wangari Mathai Foundation partners with UNICEF to promote sustainable development in Africa.",
        "Tokyo Olympics to ban all spectators due to rising COVID-19 cases.",
        "Vladimir Putin meets with world leaders at the G20 summit.",
        "Local businesses benefit from the influx of visitors during the Edinburgh Fringe Festival.",
        "CEO of tech giant announces plans for new headquarters in downtown Jerusalem .",
        "The mayor of Los Angeles has announced a new initiative to combat homelessness in the city.",
        "Renowned chef opens new restaurant in downtown Europa.",
        "New York City announces partnership with local organizations to provide free summer concerts in Central Park.",
        "New York City Mayor announces public transportation improvements",
        "Celebrities flock to Paris Fashion Week for the latest trends.",
        "Tesla unveils new electric car model at annual conference.",
        "Tokyo Olympics postponed due to COVID-19 pandemic.",
        "Highly anticipated book release from Oprah's publishing company.",
        "Heavy rain causes flooding in Los Angeles area.",
        "Investigation reveals ties between mayor's office and local construction company.",
        "President Biden signs infrastructure bill into law.",
        "Apple CEO Tim Cook unveils new iPhone model.",
        "George Floyd Memorial Foundation awarded grant for police reform efforts.",
        "The Louvre museum in Paris houses a priceless collection of Rembrandt's works.",
        "Uber CEO resigns amidst controversy.",
        "Simone Biles wins gold in gymnastics at Tokyo Olympics.",
        "Dwayne \"The Rock\" Johnson announces new partnership with fitness brand.",
        "Exhibit featuring artifacts from Edmund Hillary's historic Everest expedition opens at National Geographic museum.",
        "Top chef from Rio de Janeiro opens new restaurant in New York City's trendy SoHo district.",
        "Mufti Menk's charity organization donates to orphanage in Wittenberg.",
        "Microsoft CEO Satya Nadella visits London to discuss tech innovations.",
        "APPLE REPORTS RECORD SALES FOR LATEST iPHONE MODEL.",
        "Europa's new president vows to tackle climate change.",
        "Angela Merkel reelected as German Chancellor for fourth term.",
        "United Airlines announces the addition of new flights to Hawaii .",
        "Chicago Bulls defeat the Los Angeles Lakers in a thrilling overtime game.",
        "Celebrities spotted wearing Dolce & Gabbana designs at the Oscars.",
        "Teenage climate activist speaks at United Nations summit in New York.",
        "Brie Larson wins Best Actress at the Atlanta Film Festival.",
        "Subaru Corporation announces plans for new electric vehicle model.",
        "President Bolsonaro visits Brasília, Brazil for an emergency cabinet meeting.",
        "Marissa Mayer appointed as the new CEO of a major tech company.",
        "Environmental group protest proposed industrial development near Sundarbans National Park.",
        "Sydney to host the 2023 FIFA Women's World Cup.",
        "Global organization announces plans for climate change summit in Reykjavik.",
        "Renowned chef Mario Batali opens new restaurant in Istanbul.",
        "Hundreds in New York march in support of Wangari Mathai's conservation efforts.",
        "The CEO of Tesla, Elon Musk, announced the company's plans to build a new Gigafactory in Texas.",
        "Russian cosmonauts and Chinese astronauts conduct joint space mission.",
        "The Nature Conservancy launches new initiative to protect endangered species in South America.",
        "New York City Mayor announces plans for citywide clean energy initiative.",
        "The United Nations issues a new report on climate change.",
        "The Australian Zoo, founded by Bindi Irwin's family, celebrates its 50th anniversary.",
        "Police arrest man for violating restraining order filed by The American Civil Liberties Union.",
        "President Biden signs executive order on climate change.",
        "Angela Merkel calls for unity among European leaders in addressing the refugee crisis.",
        "European Union imposes sanctions on Russian officials over Navalny poisoning.",
        "Japan's Prime Minister announces economic stimulus package.",
        "Malala Yousafzai awarded Nobel Peace Prize for her advocacy for girls' education.",
        "APPLE LAUNCHES NEW IPHONE 13 WITH ENHANCED CAMERA.",
        "Pentagon announces new military strategy in Indo-Pacific region.",
        "The Tokyo Auto Salon showcases the latest innovations in automotive technology.",
        "Federal Bureau of Investigation announces new cybercrime task force in partnership with major tech companies.",
        "Google co-founder Larry Page steps down as CEO of Alphabet",
        "The new Ratan Tata Foundation to provide aid to communities in need.",
        "Rio de Janeiro to host 2024 Summer Olympics.",
        "Investigation reveals ties between Russian oligarch and Serena Williams' tennis academy.",
        "Dubai International Airport ranked as the world's busiest airport for international travel in 2020.",
        "Nelson Mandela Foundation to open new center in England.",
        "Attendees from all over the world flock to Tokyo to attend the famous Auto Salon.",
        "Apple Inc. releases new iPhone with advanced camera technology.",
        "Coventry City Council adopts new environmental sustainability initiative.",
        "Tokyo Olympics organizers announce new guidelines for spectators.",
        "The city of Tokyo prepares for the upcoming Summer Olympics with extensive renovations to its sports facilities.",
        "Elon Musk's SpaceX to collaborate with Mars Mission Control for upcoming mission.",
        "Barack Obama meets with leaders of G7 countries to discuss global economic recovery.",
        "The Los Angeles Lakers have signed a multi-year contract extension with their head coach.",
        "Berlin police officer Samantha Brown honored for bravery.",
        "India releases new economic growth forecast for Mumbai region.",
        "The mayor of Manchester delivers a speech at the town hall.",
        "Los Angeles Mayor announces new funding for homeless shelters.",
        "The Sierra Club launches new campaign to protect endangered species in the Amazon.",
        "Megan Rapinoe wins Golden Boot award in Women's World Cup.",
        "Tanzanian government to launch conservation effort for Mount Kilimanjaro.",
        "The White House confirms President Biden's plan to increase infrastructure spending.",
        "Europa's trade agreement with Asia brings economic opportunities.",
        "The United Nations calls for ceasefire in conflict-torn region.",
        "Prominent singer from Rio de Janeiro, Brazil, to perform a charity concert for children in need.",
        "Former US President Obama awarded The Nobel Foundation Peace Prize.",
        "NASA's Lunar Gateway project moves forward with new partnership.",
        "Elon Musk's SpaceX launches another batch of Starlink satellites into orbit.",
        "Rio de Janeiro to host the 2023 World Youth Day.",
        "New study finds correlation between coffee consumption and decreased risk of heart disease.",
        "Philanthropist donates $1 million to local children's hospital.",
        "CDC warns of potential new COVID-19 variant.",
        "Tech giant Apple announces the launch of new iPhone models.",
        "Local organization hosts annual charity event in Melbourne.",
        "Geo Neptune, a Native American artist, creates stunning sculptures from soapstone.",
        "National Network for Immigrant and Refugee Rights protests outside City Hall in Paris.",
        "Barack Obama delivered a speech on foreign policy at the United Nations General Assembly.",
        "Flooding in New Orleans prompts emergency evacuations as Hurricane Marco approaches the Gulf Coast.",
        "Amazon announces plans to open new headquarters in Arlington, Virginia, near Washington, D.C.",
        "Australian artist creates a stunning replica of the Sydney Opera House using recycled materials.",
        "Director of WHO commends Mumbai's efforts in combating COVID-19.",
        "Amazon rainforest fire in Brazil continues to devastate wildlife and indigenous communities.",
        "Cape Town University announces new scholarship program for foreign students.",
        "Tokyo Olympics to be held without spectators due to COVID-19 concerns.",
        "Local high school to host It Gets Better Project assembly",
        "The astronauts at Johnson Space Center are undergoing rigorous training for the upcoming Mars mission.",
        "Tokyo Olympics postponed until 2021 due to COVID-19 pandemic.",
        "RALPH LAUREN ANNOUNCES PLAN TO LAUNCH SUSTAINABLE FASHION LINE.",
        "International Space Station crew members conduct spacewalk under the guidance of Jim Bridenstine.",
        "Vancouver, Canada, Prime Minister Trudeau announces new climate change initiative.",
        "Tokyo Olympics organizers announce new COVID-19 safety measures for athletes.",
        "Prince Harry and Meghan Markle make surprise visit to Tokyo.",
        "Tech giant Apple announces new iPhone release.",
        "President Erdogan announces new economic reforms to boost growth in Istanbul.",
        "Microsoft announced that Satya Nadella will be stepping down as CEO.",
        "Former professional athlete volunteers to coach for Youth Sports Organization.",
        "The New York Times reports that the CEO of Apple Inc. will be stepping down.",
        "Tech giant Apple launches new iPhone with improved camera and battery life.",
        "Prime Minister Trudeau meets with German Chancellor Merkel to discuss trade.",
        "Local organization hosts fundraiser event to support cancer research.",
        "A new exhibition featuring Salvador Dalí's surrealist masterpieces opens at The Prado Museum in Madrid.",
        "The American Civil Liberties Union files lawsuit against local school district.",
        "Apple Inc. announces the release of its latest iPhone model.",
        "London Mayor announces plan to reduce air pollution in the city center.",
        "French President Macron to visit Paris, France next week.",
        "The Tate Modern in London will be hosting a special exhibition featuring contemporary African artists.",
        "Fashion designers from around the world showcase their collections at Paris Fashion Week.",
        "CEO of Armani steps down amid restructuring of company.",
        "Sierra Club launches campaign to protect endangered species in the Amazon rainforest.",
        "The CEO of Apple Inc. announces a new product launch event.",
        "Emily Rodriguez appointed as new chief executive officer of Chicago-based tech company.",
        "Donatella Versace to open new flagship store in The Dubai Mall.",
        "Sarah Johnson, a renowned scientist, wins the Nobel Prize in Physics for her groundbreaking research on quantum mechanics.",
        "The Sistine Chapel ceiling painted by Michelangelo Buonarroti has been restored to its former glory.",
        "The Walt Disney Company announces a new theme park opening in China.",
        "Olivia Morales has been appointed as the new CEO of a leading tech company.",
        "Brazilian president vows to protect the Amazon Rainforest from deforestation.",
        "New Zealand Prime Minister Jacinda Ardern meets with European Union leaders in Brussels.",
        "The Great Barrier Reef Marine Park Authority has implemented new measures to protect the fragile ecosystem.",
        "Canada reports record-breaking temperatures in Toronto.",
        "Student Emma Williams wins prestigious scholarship.",
        "Microsoft's Terry Myerson Announces New Product Launch.",
        "New York Times best-selling author to give book signing at Wallace County Public Library.",
        "The New York Times correspondent covers the latest developments in the Middle East.",
        "China's President Xi Jinping meets with South Korean leader for trade talks.",
        "UK government announces plans to increase funding for mental health services.",
        "The Athens Symphony Orchestra, founded in 1949, celebrates its 70th anniversary with a special performance.",
        "British Prime Minister announces new economic stimulus package.",
        "Israel's Ministry of Health announces new vaccine mandate for all healthcare workers in Jerusalem.",
        "The Georgia O'Keeffe Museum in Santa Fe showcases the artist's iconic works.",
        "APPLE ANNOUNCES LAUNCH OF NEW IPHONE MODEL.",
        "Donatella Versace launches new fashion line in The Soho District.",
        "London, UK braces for heavy snowfall as winter storm approaches.",
        "South African president visits Cape Town for environmental summit.",
        "The British Museum unveils new exhibit on ancient Mesopotamia.",
        "Germany's Chancellor Merkel addresses economic policy in Berlin.",
        "Berlin, Germany reports a surge in tourism despite COVID-19 restrictions.",
        "Sony Corporation unveils plans for new flagship store in New York City.",
        "Raf Simons named creative director of fashion house.",
        "Environmental organization launches campaign to protect endangered species in the Amazon rainforest.",
        "Russian cosmonauts conduct spacewalk outside International Space Station.",
        "Apple unveils new iPhone with advanced facial recognition technology and improved camera features.",
        "Visitors enjoy the scenic views and architecture of The Getty Center in Los Angeles.",
        "Celebrity chef Rachael Ray to open new restaurant in New York City.",
        "Michelangelo Buonarroti's masterpiece, the Pieta, attracts millions of visitors to Vatican City each year.",
        "Anthony Nguyen Foundation donates $1 million to local hospital.",
        "The New York Yankees sign a new pitcher for the upcoming season.",
        "Chinese President Xi Jinping meets with Russian President Vladimir Putin in Moscow.",
        "Famous actress rumored to be dating billionaire entrepreneur.",
        "Tech giant Apple unveils new iPhone 13.",
        "The American Civil Liberties Union advocates for the rights of individuals in the criminal justice system.",
        "New York City's famous Stonewall Inn celebrates 50th anniversary.",
        "Prince Harry and Meghan Markle to step back as senior members of the royal family.",
        "Former President Obama delivers speech at United Nations General Assembly.",
        "Famous actor Tom Hanks to star in new World War II film.",
        "Several large corporations, including Microsoft and Google, are investing in the new tech hub in Istanbul .",
        "Elon Musk announces plans for new space exploration project.",
        "President Biden announces plan to invest $1 trillion in infrastructure, aiming to create jobs and improve the nation's roads and bridges.",
        "Europa League final match to be held in Gdansk, Poland.",
        "Isabella Costa re-elected as president of the United Nations General Assembly.",
        "The White House plans to unveil new infrastructure proposal next week.",
        "Elon Musk's SpaceX launches 60 new Starlink satellites into orbit.",
        "Michelle Obama Foundation partners with local organizations to support community health programs.",
        "Elon Musk's SpaceX successfully launches 60 more Starlink satellites into orbit.",
        "The mayor of Istanbul unveils plans for a new public transportation system.",
        "German Chancellor Angela Merkel meets with French President Macron to discuss EU trade agreements.",
        "WHO issues new guidelines for COVID-19 prevention.",
        "The National Association for the Advancement of Colored People holds virtual event to celebrate Black History Month.",
        "Human Rights Watch criticizes Chinese government's treatment of Uighur Muslims.",
        "Former police officer convicted in the killing of George Floyd sentenced to 22.5 years in prison.",
        "The Duke and Duchess of Sussex, Prince Harry and Meghan Markle, attend the premiere of their new documentary film in London.",
        "Christian Dior announces Donatella Versace as the new creative director for their upcoming couture collection.",
        "Brazil implements new environmental regulations to protect the Amazon rainforest.",
        "Gordon Ramsay to open new restaurant in Mumbai.",
        "CEO of the Coca-Cola Company visits new bottling plant in India.",
        "Sarah Gonzalez appointed as the new CEO of the tech company.",
        "Local farmers at Smithfield Farmers' Market report record sales this season.",
        "Wildlife Trust of India receives international recognition for its efforts in protecting endangered species.",
        "ICE raids target employers hiring unauthorized workers.",
        "CEO of American Red Cross steps down amid controversy.",
        "The mayor of Rio de Janeiro, Brazil, announced a new initiative to tackle crime in the city.",
        "Tech giant Apple launches new iPhone with enhanced camera features.",
        "California wildfires rage on, forcing thousands to evacuate.",
        "Seoul and Beijing sign trade agreement to boost economic cooperation.",
        "Seoul mayor found dead in apparent suicide.",
        "São Paulo, Brazil to host international economic summit next month.",
        "Aaron Rodgers leads the Packers to victory at Lambeau Field.",
        "German Chancellor Angela Merkel meets with French President Emmanuel Macron to discuss EU economic reforms.",
        "Dr. Anthony Fauci warns of potential 'resurgence' of COVID-19 in the fall.",
        "The Met Office issues severe weather warning for the south of England.",
        "The iconic painting 'The Persistence of Memory' by Salvador Dalí will be on display at The Prado Museum for a limited time.",
        "NASA announces partnership with Indian Space Research Organisation for Lunar Gateway project.",
        "Tensions rise between United Nations and North Korea.",
        "Best-selling author Stephen King to appear at book signing in New York City."
    ]
}