{
    "not-allowed-entity-type": [
        "I want to find a late-night dining option that offers paleo-friendly dishes",
        "which restaurants with upscale pricing are open late and offer paleo options",
        "Can you recommend a brunch spot with delicious vegetarian options?",
        "What are the top-rated vegetarian brunch places in the city?",
        "I need to find a restaurant that serves vegetarian brunch dishes before 11 am",
        "What are the hours for the Italian restaurant in downtown for lunch?",
        "I'm looking for a seafood place with outdoor seating for lunch. Any suggestions?",
        "I'm craving some vegetarian fast food, where can I grab a quick bite?",
        "what's a good place for vegetarian fast food near me with a high rating?",
        "show me the highest rated pescatarian food truck in the area",
        "Could you recommend a rustic restaurant with a good rating for dinner?",
        "Where can I find a rustic Italian restaurant with a varied menu for dinner?",
        "I'm looking for a cozy, rustic steakhouse that's open late for dinner. Any suggestions?",
        "Can you recommend a rustic restaurant with a good breakfast menu?",
        "Where can I find a cozy spot for breakfast with a countryside feel?",
        "Can you recommend a restaurant with a good outdoor seating area for dinner?",
        "I'm craving sushi, where can I find a place with all-you-can-eat sushi for dinner?",
        "What's a popular restaurant with a casual atmosphere and affordable prices for dinner?",
        "Can you recommend any restaurants nearby with a good outdoor seating area for lunch?",
        "I'm looking for a place with affordable Italian cuisine for lunch. Any suggestions?",
        "What are the top-rated restaurants in the downtown area that serve vegan dishes for lunch?",
        "I'm looking for a fast-casual restaurant with a buffet that offers low-carb options",
        "where can I find a buffet with low-carb options in a fast-casual restaurant",
        "which fast-casual restaurant offers a buffet with low-carb choices",
        "can you recommend a café with low-carb options for breakfast",
        "what are the operating hours for a nearby café with low-carb menu",
        "what's the best-rated café in the area with low-carb dishes",
        "find a buffet restaurant with low-carb options",
        "show me the nearest place with a buffet that offers low-carb dishes",
        "recommend a buffet spot where I can stick to a low-carb diet",
        "Can you recommend a restaurant with outdoor seating and a good lunch menu?",
        "I'm craving Mexican food for lunch, can you suggest a nearby place with affordable prices?",
        "Can you recommend a nearby restaurant with a good view for dinner?",
        "Where can I find a seafood place with outdoor seating and a reasonable price for dinner?",
        "Can you recommend a restaurant with outdoor seating for lunch and live music?",
        "I'm looking for a place with a diverse menu for a lunch meeting, preferably with a piano bar.",
        "Where can I find a dine-in spot with a patio for a lunch date, maybe with a jazz band?",
        "I'm looking for a place with a beautiful view and seafood dinner options.",
        "I'm looking for a buffet with a nice view for a 50-year-old male doctor",
        "Which waterfront buffet restaurant would you suggest for a doctor in his 50s",
        "show me a breakfast spot with a view of the ocean",
        "what's a good place for breakfast that opens at 7 am",
        "recommend a restaurant serving delicious pancakes for breakfast",
        "Can you recommend a food truck specializing in tacos near the waterfront park?",
        "Can you recommend a restaurant with a great outdoor seating area for lunch?",
        "I'm craving Italian food for lunch, where can I find a good pasta dish?",
        "I need to find a budget-friendly restaurant with a good lunch menu, any suggestions?",
        "Can you recommend a cozy and intimate restaurant with a good lunch menu?",
        "Where is the nearest restaurant with a cozy atmosphere that serves delicious lunch dishes?",
        "I'm looking for a lunch spot with a cozy ambiance and tasty menu, what can you suggest?",
        "Where is the best place for a romantic dinner with a view?",
        "can you recommend a café with a good breakfast menu",
        "I want to grab a quick bite on my way home. Any fast food joints with good deals for dinner around here?",
        "I need to pick up some fast food for lunch. Where's the closest place with a drive-thru option?",
        "I'm looking for a restaurant that serves a good low-carb breakfast",
        "find me a nearby place with a healthy breakfast menu",
        "I need to grab a quick bite for breakfast, any suggestions?",
        "What's the best place for a pescatarian dinner with outdoor seating?",
        "I want to grab something quick for lunch, can you recommend a fast food joint with a drive-thru nearby?",
        "I'm a high school girl looking for a buffet place with a fun atmosphere and affordable prices, where do you suggest I go?",
        "Which buffet restaurant has the best desserts for teenagers like me?",
        "where can I find a budget-friendly Indian buffet for dinner",
        "Can you recommend a restaurant with a good low-carb buffet for lunch?",
        "I'm looking for a nearby place that offers a low-carb buffet for dinner. Any suggestions?",
        "I need to find a restaurant with a high rating that serves a low-carb buffet for a reasonable price. Can you help?",
        "Can you recommend a budget-friendly place with outdoor seating and vegan options for lunch?",
        "I'm looking for a lunch spot with a good salad bar, open until 3 pm.",
        "Where can I grab a quick bite for lunch that serves good Korean food, but not too expensive?",
        "I'm looking for a cozy restaurant with a charming atmosphere that serves a hearty breakfast",
        "Where can I find a quaint diner with a rustic feel that opens early for breakfast",
        "Can you recommend a café with paleo options in the area?",
        "What are the operating hours for the nearest café with paleo-friendly dishes?",
        "I'm looking for a restaurant that serves pescatarian breakfast options",
        "Can you recommend a place with a seafood breakfast menu for early risers?",
        "I need a breakfast spot with a fish dish that opens before 8 am",
        "Can you recommend a restaurant with a nice outdoor patio for lunch?",
        "Do you know of any restaurants with a 5-star rating near the city center for lunch today?"
    ],
    "entity-not-found": [
        "What are the top-rated dairy-free food trucks in the area?",
        "what's a good option for late-night eats with outdoor seating",
        "where can I grab some late-night bites for cheap",
        "I'm looking for a place with a good vegan brunch option that won't break the bank.",
        "Where can I find a vegan-friendly spot for brunch that's easy on the wallet?",
        "I want to grab a quick bite, where can I get a cheap combo meal?",
        "what time does the nearest buffet restaurant close tonight",
        "Where is the nearest Burger King with a drive-thru?",
        "What are the operating hours for Wendy's on Main Street?",
        "I'm craving some tacos, where can I find a Taco Bell with a dollar menu?",
        "I'm looking for a gourmet seafood restaurant with a view of the water. Any suggestions?",
        "Can you recommend a restaurant for late-night upscale dining?",
        "Can you recommend a lounge or bar that serves breakfast in this area?",
        "Can you recommend any restaurants with a late-night dining menu that won't break the bank?",
        "I need to grab a bite to eat after midnight without spending too much, any suggestions?",
        "What food trucks in the area have a high rating for their menu items?",
        "What food trucks are open late at night and serve vegetarian dishes?",
        "I'm a doctor in my 30s and I'm craving late-night food. What are some good options in the area?",
        "Which budget-friendly cafes offer brunch options on weekends in downtown area",
        "Can you recommend a café with good coffee and vegetarian options that opens early in the morning",
        "I'm looking for a Japanese restaurant with a 5-star rating that opens after 6pm",
        "I'm in the mood for Italian cuisine and I want to order some pizza for dinner",
        "What's the closest restaurant that serves Chinese food and delivers for dinner tonight?",
        "I'm craving some late-night Chinese food, where can I find a place with good reviews?",
        "What's a nearby restaurant that serves late-night pizza?",
        "Can you recommend a place for late-night dessert that's affordable?",
        "Where can I find upscale dining with late-night options, preferably with low-carb choices on the menu?",
        "I'm craving some late-night eats, where can I find a place with a good menu that's open past midnight?",
        "Can you recommend any restaurants with a good late-night menu for dine-in?",
        "I'm looking for a fancy restaurant with a great breakfast menu",
        "where can I have a luxurious breakfast around here",
        "What food trucks around here serve vegetarian cuisine for lunch?",
        "What food trucks in the downtown area offer vegetarian options?",
        "Do you know of any food trucks with a high customer rating that are open late tonight?",
        "What are some good Italian restaurants nearby for dinner?",
        "Can you recommend a nice restaurant with outdoor seating for dinner tonight?",
        "I'm craving sushi for dinner, where can I find a place with good quality and reasonable prices?",
        "What food trucks are open for lunch in the park today?",
        "I'm craving some late-night Italian food, can you suggest a place with good ratings?",
        "Where can I find a restaurant nearby that serves late-night vegan dishes?",
        "What is the best Italian restaurant in the downtown area that opens at 11 AM?",
        "I'm in the mood for Italian cuisine at a Michelin-starred restaurant, what do you suggest?",
        "I'm looking for a café with a mid-range price and a tasting menu for a special occasion.",
        "I need a recommendation for a café that offers tasting menus in the mid-range price category.",
        "I'm in the mood for a cheap fast-casual meal, what's the best option around here?",
        "I want to grab a bite to eat at a fast-casual spot with a vegetarian menu, where should I go?",
        "What's a nice café with comfortable seating and senior discounts nearby?",
        "I'm looking for a place to grab a quick bite, do you know any food trucks around here that offer tasting menus",
        "What cafes around here have a good brunch menu?",
        "I want to grab a quick lunch at a mid-range cafe, can you recommend one?",
        "I'm looking for a fancy restaurant with a buffet option",
        "What food trucks are open now and serve affordable Mexican cuisine?",
        "I'm in the mood for sushi. Is there a Japanese restaurant with vegan options and a trendy vibe?",
        "Find me a cozy French bistro with a prix fixe menu within walking distance, please.",
        "Can you recommend a restaurant with a good ambiance and live music for dinner tonight?",
        "I'm looking for a place with outdoor seating and a diverse menu for dinner this Friday.",
        "Where can I find a restaurant with a private dining area and a good wine selection for a dinner date next week?",
        "What food trucks are open late at night for some dessert?",
        "Can you recommend any upscale buffets in the area?",
        "Do you know of any cafés by the waterfront with a good happy hour menu?",
        "What's a highly rated café that delivers in the area?",
        "What food trucks in the area offer vegetarian options for less than $10?",
        "Is there a buffet restaurant open for dinner until late tonight?",
        "I'm in the mood for Italian cuisine tonight, do you know any good Italian restaurants with a cozy ambiance?",
        "Can you recommend a nearby steakhouse with a private dining room and a prix fixe menu for a family celebration?",
        "I'm craving some late-night Chinese food, can you recommend any places with student discounts?",
        "Where is the nearest Burger King with a drive-thru?",
        "What are the hours of operation for Taco Bell?",
        "I'm looking for a fancy spot for breakfast, preferably with a good view",
        "Can you recommend a high-end morning eatery with a diverse breakfast menu?",
        "What's the closest spot for quick eats that won't break the bank?"
    ],
    "entity-not-found-overlap": [
        "where can I grab a quick breakfast burrito nearby",
        "What are the breakfast hours for a nut-free diner with a diverse menu?",
        "I'm in the mood for some sushi. Can you recommend a good sushi place for lunch?",
        "I need to find a restaurant that serves vegetarian dishes and is open for lunch before 1pm",
        "I'm craving sushi, where can I find a good sushi restaurant for dinner",
        "I'm looking for a fancy place for a business lunch, preferably serving French cuisine"
    ],
    "missing-entity-type": [
        "What are the hours for the food truck that serves Mexican cuisine?"
    ],
    "low-logprob": [
        "Can you recommend a cozy café with affordable prices for a senior like me?",
        "Which Italian restaurant has a good rating and is within walking distance for lunch?",
        "Can you recommend a nearby Italian restaurant for lunch?",
        "Where can I grab some quick lunch with a drive-thru nearby?",
        "What are the best waterfront restaurants for lunch with a view?",
        "find me a café with outdoor seating and good coffee",
        "can you recommend a brunch spot with outdoor seating",
        "I want to find a trendy café with Instagram-worthy desserts and a moderate price range for a coffee date with my friends",
        "What are the hours of the nearest Indian buffet restaurant?",
        "Can you recommend a restaurant with a good vegetarian lunch menu?",
        "I'm craving a drive-thru buffet, where can I find one",
        "Can you recommend a breakfast place with a high rating nearby?",
        "I'm craving some good sushi for lunch, can you recommend any nearby places?",
        "Where can I find a café with free wifi and a relaxed atmosphere for a light lunch",
        "I'm looking for a budget-friendly sushi place with a high rating for a quick lunch.",
        "What is the nearest restaurant that serves fast food and allows customers to dine-in?",
        "I'm craving a hearty breakfast, where can I find a good diner nearby?",
        "can you recommend a café with a good breakfast menu",
        "which restaurant serves kosher breakfast and opens early",
        "Can you recommend a high-rated Italian restaurant with outdoor seating for dinner tonight?",
        "can you suggest a bar with a cozy atmosphere and a good wine list for dinner?",
        "I'm looking for a high-end restaurant that serves breakfast. Can you recommend any?",
        "I'm craving some eggs benedict, where can I find a restaurant serving breakfast in this area?",
        "I'm looking for a food truck with good ratings. Any suggestions?",
        "I'm looking for a charming and rustic restaurant that serves Italian cuisine for dinner.",
        "I'm looking for a high-end dining spot with a trendy bar area, any suggestions?",
        "Where can I find a top-rated upscale eatery for dinner tonight?",
        "I'm in the mood for some unique dishes, where can I find a food truck with tasting menus",
        "Can you recommend a food truck with outdoor seating for dinner tonight?",
        "What's the best café in the downtown area with a rating of 4 stars or above?",
        "what's the best café for brunch on the weekend",
        "which buffet place has the best ratings in the area",
        "Can you recommend a food truck serving Mexican cuisine near the beach?",
        "Where can I find a cheap buffet lunch during my break?",
        "What are the top-rated lunch spots with a waterfront view and a seafood menu?",
        "I need a place for a Sunday brunch date, preferably with live music and a cozy atmosphere",
        "I'm looking for a place that serves Italian cuisine and offers dinner delivery within the city",
        "Where can I find a café with a wide selection of pastries and a good reputation for brunch?",
        "Can you recommend a place for a romantic dinner with a tasting menu and a price range of $50-100 per person?",
        "recommend a cozy café with free wifi and a vegan menu",
        "I'm looking for a seafood restaurant with outdoor seating and a high rating. Any suggestions?",
        "can you recommend a fine dining restaurant with a brunch menu for a 40s female lawyer",
        "I'm craving some fast food, where can I find a vegetarian-friendly restaurant nearby?",
        "I'm craving some late-night dim sum, where can I find a good place?",
        "Which restaurant offers late-night dining with a high rating in the downtown area?",
        "Can you recommend a buffet restaurant with seafood options?",
        "Can you recommend a fine dining restaurant with a diverse menu and excellent ratings for takeout?",
        "Can you recommend any restaurants nearby with a high rating for seafood dishes?",
        "I'm in the mood for some gourmet food truck. Any recommendations?",
        "what is the nearest place with a high rating that serves vegetarian-friendly lunch options",
        "I'm in the mood for some street food, where can I find a good food truck nearby?",
        "Can you recommend a fine dining restaurant with a vegetarian menu for tonight?",
        "Can you recommend any intimate restaurants with a high rating for dinner?",
        "I'm looking for a low-carb lunch spot with outdoor seating",
        "What are the operating hours of the nearest burger joint?",
        "Where can I find a café with live music on weekends?",
        "Can you recommend a fine dining restaurant with special discounts for a romantic dinner?",
        "What are some sushi spots with late night hours?",
        "find a bar with a diverse lunch selection",
        "Can you recommend a highly-rated fast food restaurant with upscale pricing",
        "I'm craving some street food, where can I find a food truck with a diverse menu?",
        "What are the hours of operation for the nearest fast food restaurant with a peaceful environment?",
        "Can you recommend a buffet restaurant in the downtown area?",
        "Can you recommend a fast food place that offers vegetarian options?",
        "where can I find a brunch place with healthy, low-carb choices",
        "what cafés in the area have a rating above 4 stars",
        "Where can I find a high-end restaurant with a lunch menu in the downtown area?",
        "I'm looking for a cozy café with outdoor seating and a good brunch menu",
        "I'm looking for a food truck by the water, any suggestions?",
        "I'm looking for a place that serves brunch with unique chef's specials",
        "What's a laid-back place where I can grab a bite after hours without breaking the bank",
        "Can you recommend a budget-friendly fast food place with a good vegetarian menu?",
        "show me the nearest food truck serving tacos",
        "Can you recommend any food trucks with a diverse menu in the downtown area?",
        "I'm craving tacos, where can I find a food truck serving Mexican cuisine?",
        "I need a cozy place for a breakfast meeting with a good coffee selection and a quiet ambience.",
        "Where can I find a classy restaurant with a chic lounge for dinner tonight?",
        "are there any food trucks nearby that serve vegan dishes?",
        "recommend me a food truck with affordable prices",
        "I'm in the mood for some eggs benedict, can you recommend a restaurant with a good brunch menu",
        "Is there a well-rated buffet restaurant with a wide variety of dishes in the downtown area?",
        "Which buffet restaurants have a rating of 4 stars or above in San Francisco?",
        "what are the opening hours for the nearest café with vegan options",
        "are there any buffet restaurants with vegan options near me",
        "which food truck offers vegetarian options within 5 miles of downtown",
        "what's a good café with live music tonight",
        "What are the top-rated buffet restaurants in the area that cater to nut-free diets and provide delivery service?",
        "Is there a fast food joint with a romantic vibe and good ratings?",
        "Can you recommend a high-end café with a good selection of pastries and desserts",
        "what's a highly rated café that serves breakfast all day",
        "Can you recommend a high-end Italian restaurant with a view for dinner tonight?",
        "What are the operating hours for the Italian restaurant near the park that offers lunch specials?",
        "do you know any restaurants nearby that serve a good lunch menu",
        "I'm craving some pancakes and coffee, where can I go for breakfast within walking distance?",
        "What's the top-rated fast food joint that serves breakfast all day?",
        "Where can I find a cool spot with a variety of low-carb dishes for lunch?",
        "I'm looking for a place with a decent breakfast menu, not too expensive",
        "What food truck in this area offers a great outdoor dining experience",
        "What are the hours of operation for the nearest sushi place for lunch?",
        "Can you recommend a fine dining restaurant with waterfront views for dinner tonight?",
        "I'm craving some specialty coffee, where can I find a café with unique coffee drinks?",
        "can you recommend a nearby café with outdoor seating",
        "Which fast food place serves halal dishes?",
        "I'm looking for a breakfast spot with a cozy atmosphere and reasonable prices",
        "where can i get a good breakfast before 8 a m that delivers",
        "I'm looking for a vegan-friendly spot for lunch that has a good rating",
        "I'm craving some late-night comfort food, where can I find a place with a budget-friendly menu nearby?",
        "I'm in the mood for some gourmet food truck eats, where can I find an upscale option nearby?",
        "can you recommend a place for late-night dining with a diverse menu",
        "What are the hours for the nearest burger joint that delivers?",
        "Can you recommend a good Italian restaurant with outdoor seating for lunch tomorrow?",
        "show me a trendy brunch place with a good vibe",
        "can you recommend a café with outdoor seating and a good breakfast menu",
        "Can you recommend a fast food restaurant with a high rating and a location close to downtown?",
        "I'm looking for a fancy place with late-night dining, do you have any suggestions?",
        "Can you recommend a top-rated fine dining restaurant in the downtown area?",
        "I'm craving Asian cuisine, can you suggest a buffet that offers that?",
        "Can you recommend a fast food restaurant with vegetarian options nearby?",
        "I'm craving some coffee and pastries, where can I find a cozy café with outdoor seating?",
        "Can you recommend a luxurious food truck with a diverse menu for dinner tonight?",
        "where can I find a buffet with dairy-free options",
        "show me the top-rated food trucks in the area",
        "I'm craving some delicious street food, can you recommend a food truck with mid-range prices?",
        "what's the best rated brunch spot near me",
        "Can you recommend a restaurant with a prix fixe menu and a 4-star rating for dinner tonight?",
        "What are the hours of operation for the Japanese restaurant on 5th avenue?",
        "What are the operating hours for the nearest barbecue joint for dinner tonight?",
        "I'm looking for a place to grab some late-night takeout, preferably with a diverse menu.",
        "recommend a place for a fast breakfast bite on a budget",
        "What are some affordable Mexican restaurants near downtown for a quick lunch break?",
        "What are the hours of the nearest burger joint with nut-free choices",
        "Which café around here has a nice outdoor seating area?",
        "Can you recommend a high-end restaurant with a diverse menu for lunch?",
        "I'm looking for a place with a cozy atmosphere and a variety of breakfast options.",
        "I'm craving some pizza, where can I find a cheap and fast food pizza place?",
        "Can you recommend a formal restaurant in the area for a lunch meeting?",
        "I'm craving fast food, where can I find a high-end burger joint?",
        "what food trucks in the area are known for their barbecue",
        "Is there a 24-hour restaurant nearby that offers a breakfast buffet?",
        "I need a place for a nice dinner with a good rating and affordable prices, and it should offer delivery",
        "where can I find a steakhouse that's open past 10 pm",
        "Where can I find a mid-range priced restaurant that serves brunch in this area?",
        "Can you recommend a fine dining restaurant with a happy hour menu and takeout options?",
        "I'm a 30s male doctor looking for a restaurant with late-night dining. Any suggestions?",
        "Can you recommend a trendy spot for lunch with vegetarian options?",
        "Can you recommend any breakfast places with gluten-free options?",
        "Do you know any restaurants that offer a lunch special for under 15 dollars?",
        "What are the hours for a nearby sushi place open for lunch on weekdays?",
        "Can you recommend a fine dining restaurant in the downtown area with a romantic ambiance?",
        "which food truck serves vegan dishes and is open past 9 pm",
        "what's a good place by the water for lunch with outdoor seating?",
        "show me the nearest cafe that serves croissants before 10 am",
        "where can I get a sushi lunch for a reasonable price",
        "I'm looking for a cool spot to eat after midnight. Any recommendations?",
        "What's a good restaurant for a quick, affordable lunch",
        "I'm looking for a casual dining restaurant with outdoor seating and a moderate price range for dinner.",
        "What are the opening hours of the nearest halal café with a drive-thru?",
        "I'm looking for a breakfast spot with a cozy atmosphere and a reasonable price range.",
        "Do you know any restaurants with a brunch buffet and live music on Sundays?",
        "I'm looking for a brunch spot with outdoor seating",
        "Can you recommend a dine-in restaurant with a diverse brunch menu?",
        "I'm meeting a friend for lunch, can you recommend a café near the hospital with a healthy menu?",
        "What fast food places with a drive-thru are open late tonight?",
        "I'm craving some fast food by the waterfront, where's the nearest burger joint?",
        "What food trucks along the waterfront have a good rating for their seafood dishes?",
        "What is the best fine dining restaurant in the area?",
        "I need a quick bite from a food truck that won't break the bank, any suggestions?",
        "Can you recommend a top-rated Italian restaurant with outdoor seating for dinner tonight?",
        "Can you recommend a fine dining restaurant with a French cuisine?",
        "What are the hours of operation for dairy-free buffet restaurants in the area?",
        "What are the top-rated sushi places in downtown for a midday meal?",
        "What are the hours of operation for the nearest seafood restaurant open for dinner?",
        "I'm craving some sushi. Can you recommend a good sushi restaurant nearby?",
        "Do you know any late-night dining spots with affordable prices?",
        "Can you recommend a quirky spot for late-night dining?",
        "I'm craving some pancakes, where can I find a good breakfast spot with outdoor seating?",
        "Can you recommend a Chinese restaurant with a high rating and affordable lunch specials?",
        "where can I find a late-night dining option with a high rating",
        "What are some 24-hour diners with good reviews in the area?",
        "what are the opening hours of the café that serves vegan dishes",
        "where can I find a budget-friendly Italian restaurant for dinner tonight",
        "Which food truck has the best Mexican cuisine in the downtown area?",
        "What's a nice restaurant in the area with a brunch menu that offers vegetarian options?",
        "Can you recommend a café with delivery options for breakfast?",
        "What food trucks with a romantic ambience are open late tonight?",
        "where can I have a luxurious dinner experience",
        "Can you recommend a food truck in the downtown area with a high rating?",
        "What are the top-rated Italian restaurants for lunch in the downtown area?",
        "Which Italian restaurants near me offer takeout for dinner",
        "I'm looking for a Mexican restaurant with a patio open until 3 pm for lunch.",
        "Can you recommend a fine dining restaurant with a French cuisine for lunch?",
        "I'm in the mood for a fancy buffet, do you know any high-rated places?",
        "Where can I go for a buffet dinner with early bird specials",
        "I'm looking for a restaurant with outdoor seating and a good seafood menu for dinner",
        "I'm meeting a vegetarian friend for lunch, where can we find a place with a diverse menu?",
        "Which upscale fast food joints have the best late-night menu around here?",
        "I'm craving a waterfront brunch, where can I find one?",
        "What are the top-rated breakfast places with a high price range in this area?",
        "Do you know of any place with a nice patio where I can have a leisurely breakfast?",
        "Can you recommend a buffet restaurant nearby for dine-in?",
        "What's the best-rated buffet restaurant with a dessert bar?",
        "I'm craving some breakfast burritos, where can I find a good spot for that?",
        "where can I find a good sushi restaurant for lunch",
        "I'm looking for an upscale food truck with a diverse menu, where can I find one?",
        "Can you recommend a diner with pancakes and waffles nearby?",
        "I want to grab a quick bite from a food truck, where can I find one with affordable options?",
        "Can you recommend a charming and rustic restaurant for late-night dining?",
        "Which expensive fast food restaurants are open past 10 pm?",
        "Can you recommend a place for a fancy breakfast in the area?",
        "I'm looking for a place where I can have pancakes and coffee for breakfast before school.",
        "I'm looking for a dairy-free buffet restaurant with a good rating",
        "Which restaurant serves authentic Mexican cuisine for lunch in downtown?",
        "I'm looking for a casual late-night dining spot with a good selection of comfort food",
        "Where's the best place to grab a quick bite to eat for lunch near the mall?",
        "I'm craving some street food, where can I find a trendy food truck nearby",
        "Can you recommend a high-end place with a buffet for dinner",
        "I'm looking for a brunch place with a view of the ocean.",
        "I'm craving some high-end burgers, where's the nearest gourmet fast food place?",
        "What are the top-rated buffet restaurants in the downtown area?",
        "I'm craving some delicious pancakes, where can I find a good brunch spot",
        "where can I have a luxurious meal without breaking the bank",
        "What's a popular restaurant for brunch with bottomless mimosas in the area?",
        "Can you recommend a place with a high rating that offers a buffet dinner?",
        "I'm looking for a high-end restaurant with a seafood menu for a lunch meeting.",
        "Any recommendations for a fast food joint with drive-thru that offers hearty portions?",
        "Can you recommend a buffet restaurant with a waterfront ambience",
        "Which upscale restaurant around here serves a delicious brunch with private dining options?",
        "recommend a formal café with outdoor seating",
        "I'm looking for a breakfast spot with good reviews nearby",
        "Where can I find a rustic and charming food truck that serves authentic tacos",
        "I'm looking for an upscale restaurant with French cuisine",
        "I'm looking for a place with a good selection of vegetarian seafood dishes for dinner",
        "What is the most luxurious food truck in the area?",
        "I'm looking for an affordable restaurant with a romantic atmosphere, any suggestions?",
        "I'm looking for a cozy café with vegetarian options and good ambiance",
        "recommend a cheap burger joint with a high rating",
        "What are the top-rated Italian restaurants in the downtown area for a nice dinner?",
        "I'm meeting a friend for brunch, is there a nice place with outdoor seating",
        "can you suggest a place for late-night dining with a high rating",
        "where can I find a fine dining restaurant with a waterfront view",
        "What are the operating hours of the nearest food truck that serves vegan options?",
        "I want to grab a quick bite from a hip food truck, where's the nearest one?",
        "which café around here has outdoor seating and is open late",
        "I'm craving some eggs benedict, where can I get a good brunch around here",
        "What are the top-rated buffet restaurants in the city known for their seafood dishes?",
        "I want to try something new for lunch, can you suggest a trendy spot with affordable prices?",
        "I need a breakfast spot with a good reputation, can you recommend a place with high ratings?",
        "what's the best fast food joint with drive-thru in town?",
        "Can you recommend a restaurant with outdoor seating and a view of the ocean for dinner?",
        "I'm craving some delicious brunch, can you recommend a nearby spot with outdoor seating?",
        "I'm looking for a budget-friendly breakfast spot with a good variety of pancakes and omelettes",
        "I'm looking for a fine dining restaurant with a romantic ambiance and a prix fixe menu",
        "show me the nearest fast food restaurants with drive-thru service",
        "I'm looking for a fancy steakhouse that's open late for dinner.",
        "Can you recommend a restaurant with salads and a lunch special?",
        "what time do the food trucks start serving breakfast",
        "Can you recommend a cozy and intimate restaurant with a buffet option?",
        "I'm looking for a place with upscale cuisine and a relaxed atmosphere",
        "Can you recommend a restaurant nearby with a good selection of vegetarian dishes for lunch takeout?",
        "Where can I have a buffet dinner with a great view?",
        "Can you recommend a buffet restaurant with good ratings and a variety of cuisines in the downtown area",
        "What are the top-rated buffet restaurants near the beach?",
        "I'm looking for a fast food restaurant with a drive-thru open after 10 pm.",
        "Can you recommend a fancy restaurant with Italian food for dinner tonight?",
        "What are some fine dining restaurants with a casual ambience in the area?",
        "I'm looking for a nice Italian restaurant with outdoor seating and good ambience for a dinner date",
        "What's the best place for brunch in the city with a reasonable price range?",
        "what's the best affordable food truck for burgers in the area",
        "Can you recommend a cozy place with a good wine selection for dinner?",
        "Can you recommend a breakfast spot with a mid-range price range?",
        "Is there a food truck nearby with vegetarian options and good ratings?",
        "where is the nearest upscale café with a brunch menu",
        "I'm in the mood for some affordable sushi. Any suggestions for dinner around this area?",
        "I'm craving a vegetarian-friendly café for breakfast near the hotel",
        "Where can I find a food truck with happy hour specials for takeout",
        "what are the operating hours of the taco food truck in the downtown area",
        "What buffet restaurant has the best seafood in town?",
        "What food truck around here offers vegetarian options?",
        "Which restaurant around here provides dine-in options for late-night dining?",
        "Please find me a serene restaurant for a peaceful lunch break, preferably with a menu featuring seafood dishes.",
        "I'm looking for a place with a trendy ambiance and a good cocktail menu for late-night dining.",
        "Can you recommend a breakfast spot with a good rating?",
        "Can you recommend a dairy-free café with mid-range prices for lunch",
        "I'm looking for a place with good pizza after 11 pm",
        "Where can I find a coffee shop with a breakfast menu that opens at 7 a.m. close to my hotel?",
        "recommend a lounge or bar with a good lunch menu",
        "I need a quick bite, where is the nearest burger joint with good ratings?",
        "what's the best buffet restaurant in the downtown area",
        "what's a popular place for a morning meal with vegan options",
        "I'm looking for a gourmet food truck with a diverse menu, can you help me find one",
        "I'm looking for a fancy steakhouse with a high rating for our anniversary dinner.",
        "What are the operating hours for the BBQ food truck on 5th Avenue?",
        "Can you recommend a highly-rated Italian restaurant with outdoor seating for dinner tonight?",
        "I'm looking for a café with brunch menu for this weekend",
        "Where is the closest place for a brunch with outdoor seating",
        "What are the opening hours for Taco Bell near me?",
        "Is there a buffet restaurant nearby that offers a drive-thru option for dinner?",
        "which restaurant in this area offers breakfast for less than $15?",
        "I'm looking for a cheap but authentic Mexican restaurant for lunch, any suggestions?",
        "I'm looking for a restaurant that serves breakfast and offers chef's specials",
        "Can you recommend any restaurants with late-night dining options nearby?",
        "Do you know any trendy breakfast spots in the area?",
        "Can you recommend a high-end fast food joint with good ratings?",
        "what's the best fast food burger joint in town?",
        "Can you recommend any upscale restaurants with late-night dining options for those on a low-carb diet?",
        "Can you recommend a good Italian restaurant for lunch around here?",
        "I'm looking for a cheap place to grab some fast food in the evening. Any suggestions?",
        "I'm looking for a formal restaurant with a breakfast menu for a 25-year-old female nurse.",
        "Can you recommend a restaurant with a nice ambiance and outdoor seating for dinner?",
        "Can you recommend a lunch spot with a variety of vegetarian options?",
        "I want to treat my friend to a fancy breakfast for her birthday, can you recommend a restaurant with a high rating and a nice ambiance?",
        "what are the top-rated seafood places nearby",
        "Can you recommend a place for late-night dining with delivery options and good happy hour deals",
        "Can you recommend a trendy café with vegan options for a late brunch",
        "Is there a restaurant nearby that serves a tranquil brunch?",
        "can you recommend a restaurant with outdoor seating for dinner",
        "What restaurants serve breakfast before 9 a.m?",
        "what food trucks in the vicinity offer seafood dishes for lunch",
        "I need a quick bite after work, where's the nearest spot for fast food with a drive-thru?",
        "What are some places with a good rating for late-night dining?",
        "Is there a high-end restaurant with a dress code for dinner tonight?",
        "I'm looking for a café with a cozy atmosphere and a 4-star rating for a casual dinner",
        "Can you recommend a budget-friendly restaurant for a breakfast buffet?",
        "Can you recommend a café that serves brunch and is open late on weekends?",
        "Can you recommend a budget-friendly place for dinner with Italian cuisine?",
        "I'm looking for a fast-casual restaurant with a buffet for tonight"
    ],
    "sentences": [
        "I want to find a late-night dining option that offers paleo-friendly dishes",
        "which restaurants with upscale pricing are open late and offer paleo options",
        "Can you recommend a brunch spot with delicious vegetarian options?",
        "What are the top-rated vegetarian brunch places in the city?",
        "I need to find a restaurant that serves vegetarian brunch dishes before 11 am",
        "What are the hours for the Italian restaurant in downtown for lunch?",
        "I'm looking for a seafood place with outdoor seating for lunch. Any suggestions?",
        "I'm craving some vegetarian fast food, where can I grab a quick bite?",
        "what's a good place for vegetarian fast food near me with a high rating?",
        "show me the highest rated pescatarian food truck in the area",
        "Could you recommend a rustic restaurant with a good rating for dinner?",
        "Where can I find a rustic Italian restaurant with a varied menu for dinner?",
        "I'm looking for a cozy, rustic steakhouse that's open late for dinner. Any suggestions?",
        "Can you recommend a rustic restaurant with a good breakfast menu?",
        "Where can I find a cozy spot for breakfast with a countryside feel?",
        "Can you recommend a restaurant with a good outdoor seating area for dinner?",
        "I'm craving sushi, where can I find a place with all-you-can-eat sushi for dinner?",
        "What's a popular restaurant with a casual atmosphere and affordable prices for dinner?",
        "Can you recommend any restaurants nearby with a good outdoor seating area for lunch?",
        "I'm looking for a place with affordable Italian cuisine for lunch. Any suggestions?",
        "What are the top-rated restaurants in the downtown area that serve vegan dishes for lunch?",
        "I'm looking for a fast-casual restaurant with a buffet that offers low-carb options",
        "where can I find a buffet with low-carb options in a fast-casual restaurant",
        "which fast-casual restaurant offers a buffet with low-carb choices",
        "can you recommend a café with low-carb options for breakfast",
        "what are the operating hours for a nearby café with low-carb menu",
        "what's the best-rated café in the area with low-carb dishes",
        "find a buffet restaurant with low-carb options",
        "show me the nearest place with a buffet that offers low-carb dishes",
        "recommend a buffet spot where I can stick to a low-carb diet",
        "Can you recommend a restaurant with outdoor seating and a good lunch menu?",
        "I'm craving Mexican food for lunch, can you suggest a nearby place with affordable prices?",
        "Can you recommend a nearby restaurant with a good view for dinner?",
        "Where can I find a seafood place with outdoor seating and a reasonable price for dinner?",
        "Can you recommend a restaurant with outdoor seating for lunch and live music?",
        "I'm looking for a place with a diverse menu for a lunch meeting, preferably with a piano bar.",
        "Where can I find a dine-in spot with a patio for a lunch date, maybe with a jazz band?",
        "I'm looking for a place with a beautiful view and seafood dinner options.",
        "I'm looking for a buffet with a nice view for a 50-year-old male doctor",
        "Which waterfront buffet restaurant would you suggest for a doctor in his 50s",
        "show me a breakfast spot with a view of the ocean",
        "what's a good place for breakfast that opens at 7 am",
        "recommend a restaurant serving delicious pancakes for breakfast",
        "Can you recommend a food truck specializing in tacos near the waterfront park?",
        "Can you recommend a restaurant with a great outdoor seating area for lunch?",
        "I'm craving Italian food for lunch, where can I find a good pasta dish?",
        "I need to find a budget-friendly restaurant with a good lunch menu, any suggestions?",
        "Can you recommend a cozy and intimate restaurant with a good lunch menu?",
        "Where is the nearest restaurant with a cozy atmosphere that serves delicious lunch dishes?",
        "I'm looking for a lunch spot with a cozy ambiance and tasty menu, what can you suggest?",
        "Where is the best place for a romantic dinner with a view?",
        "can you recommend a café with a good breakfast menu",
        "I want to grab a quick bite on my way home. Any fast food joints with good deals for dinner around here?",
        "I need to pick up some fast food for lunch. Where's the closest place with a drive-thru option?",
        "I'm looking for a restaurant that serves a good low-carb breakfast",
        "find me a nearby place with a healthy breakfast menu",
        "I need to grab a quick bite for breakfast, any suggestions?",
        "What's the best place for a pescatarian dinner with outdoor seating?",
        "I want to grab something quick for lunch, can you recommend a fast food joint with a drive-thru nearby?",
        "I'm a high school girl looking for a buffet place with a fun atmosphere and affordable prices, where do you suggest I go?",
        "Which buffet restaurant has the best desserts for teenagers like me?",
        "where can I find a budget-friendly Indian buffet for dinner",
        "Can you recommend a restaurant with a good low-carb buffet for lunch?",
        "I'm looking for a nearby place that offers a low-carb buffet for dinner. Any suggestions?",
        "I need to find a restaurant with a high rating that serves a low-carb buffet for a reasonable price. Can you help?",
        "Can you recommend a budget-friendly place with outdoor seating and vegan options for lunch?",
        "I'm looking for a lunch spot with a good salad bar, open until 3 pm.",
        "Where can I grab a quick bite for lunch that serves good Korean food, but not too expensive?",
        "I'm looking for a cozy restaurant with a charming atmosphere that serves a hearty breakfast",
        "Where can I find a quaint diner with a rustic feel that opens early for breakfast",
        "Can you recommend a café with paleo options in the area?",
        "What are the operating hours for the nearest café with paleo-friendly dishes?",
        "I'm looking for a restaurant that serves pescatarian breakfast options",
        "Can you recommend a place with a seafood breakfast menu for early risers?",
        "I need a breakfast spot with a fish dish that opens before 8 am",
        "Can you recommend a restaurant with a nice outdoor patio for lunch?",
        "Do you know of any restaurants with a 5-star rating near the city center for lunch today?",
        "What are the top-rated dairy-free food trucks in the area?",
        "what's a good option for late-night eats with outdoor seating",
        "where can I grab some late-night bites for cheap",
        "I'm looking for a place with a good vegan brunch option that won't break the bank.",
        "Where can I find a vegan-friendly spot for brunch that's easy on the wallet?",
        "I want to grab a quick bite, where can I get a cheap combo meal?",
        "what time does the nearest buffet restaurant close tonight",
        "Where is the nearest Burger King with a drive-thru?",
        "What are the operating hours for Wendy's on Main Street?",
        "I'm craving some tacos, where can I find a Taco Bell with a dollar menu?",
        "I'm looking for a gourmet seafood restaurant with a view of the water. Any suggestions?",
        "Can you recommend a restaurant for late-night upscale dining?",
        "Can you recommend a lounge or bar that serves breakfast in this area?",
        "Can you recommend any restaurants with a late-night dining menu that won't break the bank?",
        "I need to grab a bite to eat after midnight without spending too much, any suggestions?",
        "What food trucks in the area have a high rating for their menu items?",
        "What food trucks are open late at night and serve vegetarian dishes?",
        "I'm a doctor in my 30s and I'm craving late-night food. What are some good options in the area?",
        "Which budget-friendly cafes offer brunch options on weekends in downtown area",
        "Can you recommend a café with good coffee and vegetarian options that opens early in the morning",
        "I'm looking for a Japanese restaurant with a 5-star rating that opens after 6pm",
        "I'm in the mood for Italian cuisine and I want to order some pizza for dinner",
        "What's the closest restaurant that serves Chinese food and delivers for dinner tonight?",
        "I'm craving some late-night Chinese food, where can I find a place with good reviews?",
        "What's a nearby restaurant that serves late-night pizza?",
        "Can you recommend a place for late-night dessert that's affordable?",
        "Where can I find upscale dining with late-night options, preferably with low-carb choices on the menu?",
        "I'm craving some late-night eats, where can I find a place with a good menu that's open past midnight?",
        "Can you recommend any restaurants with a good late-night menu for dine-in?",
        "I'm looking for a fancy restaurant with a great breakfast menu",
        "where can I have a luxurious breakfast around here",
        "What food trucks around here serve vegetarian cuisine for lunch?",
        "What food trucks in the downtown area offer vegetarian options?",
        "Do you know of any food trucks with a high customer rating that are open late tonight?",
        "What are some good Italian restaurants nearby for dinner?",
        "Can you recommend a nice restaurant with outdoor seating for dinner tonight?",
        "I'm craving sushi for dinner, where can I find a place with good quality and reasonable prices?",
        "What food trucks are open for lunch in the park today?",
        "I'm craving some late-night Italian food, can you suggest a place with good ratings?",
        "Where can I find a restaurant nearby that serves late-night vegan dishes?",
        "What is the best Italian restaurant in the downtown area that opens at 11 AM?",
        "I'm in the mood for Italian cuisine at a Michelin-starred restaurant, what do you suggest?",
        "I'm looking for a café with a mid-range price and a tasting menu for a special occasion.",
        "I need a recommendation for a café that offers tasting menus in the mid-range price category.",
        "I'm in the mood for a cheap fast-casual meal, what's the best option around here?",
        "I want to grab a bite to eat at a fast-casual spot with a vegetarian menu, where should I go?",
        "What's a nice café with comfortable seating and senior discounts nearby?",
        "I'm looking for a place to grab a quick bite, do you know any food trucks around here that offer tasting menus",
        "What cafes around here have a good brunch menu?",
        "I want to grab a quick lunch at a mid-range cafe, can you recommend one?",
        "I'm looking for a fancy restaurant with a buffet option",
        "What food trucks are open now and serve affordable Mexican cuisine?",
        "I'm in the mood for sushi. Is there a Japanese restaurant with vegan options and a trendy vibe?",
        "Find me a cozy French bistro with a prix fixe menu within walking distance, please.",
        "Can you recommend a restaurant with a good ambiance and live music for dinner tonight?",
        "I'm looking for a place with outdoor seating and a diverse menu for dinner this Friday.",
        "Where can I find a restaurant with a private dining area and a good wine selection for a dinner date next week?",
        "What food trucks are open late at night for some dessert?",
        "Can you recommend any upscale buffets in the area?",
        "Do you know of any cafés by the waterfront with a good happy hour menu?",
        "What's a highly rated café that delivers in the area?",
        "What food trucks in the area offer vegetarian options for less than $10?",
        "Is there a buffet restaurant open for dinner until late tonight?",
        "I'm in the mood for Italian cuisine tonight, do you know any good Italian restaurants with a cozy ambiance?",
        "Can you recommend a nearby steakhouse with a private dining room and a prix fixe menu for a family celebration?",
        "I'm craving some late-night Chinese food, can you recommend any places with student discounts?",
        "What are the hours of operation for Taco Bell?",
        "I'm looking for a fancy spot for breakfast, preferably with a good view",
        "Can you recommend a high-end morning eatery with a diverse breakfast menu?",
        "What's the closest spot for quick eats that won't break the bank?",
        "where can I grab a quick breakfast burrito nearby",
        "What are the breakfast hours for a nut-free diner with a diverse menu?",
        "I'm in the mood for some sushi. Can you recommend a good sushi place for lunch?",
        "I need to find a restaurant that serves vegetarian dishes and is open for lunch before 1pm",
        "I'm craving sushi, where can I find a good sushi restaurant for dinner",
        "I'm looking for a fancy place for a business lunch, preferably serving French cuisine",
        "What are the hours for the food truck that serves Mexican cuisine?",
        "Can you recommend a cozy café with affordable prices for a senior like me?",
        "Which Italian restaurant has a good rating and is within walking distance for lunch?",
        "Can you recommend a nearby Italian restaurant for lunch?",
        "Where can I grab some quick lunch with a drive-thru nearby?",
        "What are the best waterfront restaurants for lunch with a view?",
        "find me a café with outdoor seating and good coffee",
        "can you recommend a brunch spot with outdoor seating",
        "I want to find a trendy café with Instagram-worthy desserts and a moderate price range for a coffee date with my friends",
        "What are the hours of the nearest Indian buffet restaurant?",
        "Can you recommend a restaurant with a good vegetarian lunch menu?",
        "I'm craving a drive-thru buffet, where can I find one",
        "Can you recommend a breakfast place with a high rating nearby?",
        "I'm craving some good sushi for lunch, can you recommend any nearby places?",
        "Where can I find a café with free wifi and a relaxed atmosphere for a light lunch",
        "I'm looking for a budget-friendly sushi place with a high rating for a quick lunch.",
        "What is the nearest restaurant that serves fast food and allows customers to dine-in?",
        "I'm craving a hearty breakfast, where can I find a good diner nearby?",
        "which restaurant serves kosher breakfast and opens early",
        "Can you recommend a high-rated Italian restaurant with outdoor seating for dinner tonight?",
        "can you suggest a bar with a cozy atmosphere and a good wine list for dinner?",
        "I'm looking for a high-end restaurant that serves breakfast. Can you recommend any?",
        "I'm craving some eggs benedict, where can I find a restaurant serving breakfast in this area?",
        "I'm looking for a food truck with good ratings. Any suggestions?",
        "I'm looking for a charming and rustic restaurant that serves Italian cuisine for dinner.",
        "I'm looking for a high-end dining spot with a trendy bar area, any suggestions?",
        "Where can I find a top-rated upscale eatery for dinner tonight?",
        "I'm in the mood for some unique dishes, where can I find a food truck with tasting menus",
        "Can you recommend a food truck with outdoor seating for dinner tonight?",
        "What's the best café in the downtown area with a rating of 4 stars or above?",
        "what's the best café for brunch on the weekend",
        "which buffet place has the best ratings in the area",
        "Can you recommend a food truck serving Mexican cuisine near the beach?",
        "Where can I find a cheap buffet lunch during my break?",
        "What are the top-rated lunch spots with a waterfront view and a seafood menu?",
        "I need a place for a Sunday brunch date, preferably with live music and a cozy atmosphere",
        "I'm looking for a place that serves Italian cuisine and offers dinner delivery within the city",
        "Where can I find a café with a wide selection of pastries and a good reputation for brunch?",
        "Can you recommend a place for a romantic dinner with a tasting menu and a price range of $50-100 per person?",
        "recommend a cozy café with free wifi and a vegan menu",
        "I'm looking for a seafood restaurant with outdoor seating and a high rating. Any suggestions?",
        "can you recommend a fine dining restaurant with a brunch menu for a 40s female lawyer",
        "I'm craving some fast food, where can I find a vegetarian-friendly restaurant nearby?",
        "I'm craving some late-night dim sum, where can I find a good place?",
        "Which restaurant offers late-night dining with a high rating in the downtown area?",
        "Can you recommend a buffet restaurant with seafood options?",
        "Can you recommend a fine dining restaurant with a diverse menu and excellent ratings for takeout?",
        "Can you recommend any restaurants nearby with a high rating for seafood dishes?",
        "I'm in the mood for some gourmet food truck. Any recommendations?",
        "what is the nearest place with a high rating that serves vegetarian-friendly lunch options",
        "I'm in the mood for some street food, where can I find a good food truck nearby?",
        "Can you recommend a fine dining restaurant with a vegetarian menu for tonight?",
        "Can you recommend any intimate restaurants with a high rating for dinner?",
        "I'm looking for a low-carb lunch spot with outdoor seating",
        "What are the operating hours of the nearest burger joint?",
        "Where can I find a café with live music on weekends?",
        "Can you recommend a fine dining restaurant with special discounts for a romantic dinner?",
        "What are some sushi spots with late night hours?",
        "find a bar with a diverse lunch selection",
        "Can you recommend a highly-rated fast food restaurant with upscale pricing",
        "I'm craving some street food, where can I find a food truck with a diverse menu?",
        "What are the hours of operation for the nearest fast food restaurant with a peaceful environment?",
        "Can you recommend a buffet restaurant in the downtown area?",
        "Can you recommend a fast food place that offers vegetarian options?",
        "where can I find a brunch place with healthy, low-carb choices",
        "what cafés in the area have a rating above 4 stars",
        "Where can I find a high-end restaurant with a lunch menu in the downtown area?",
        "I'm looking for a cozy café with outdoor seating and a good brunch menu",
        "I'm looking for a food truck by the water, any suggestions?",
        "I'm looking for a place that serves brunch with unique chef's specials",
        "What's a laid-back place where I can grab a bite after hours without breaking the bank",
        "Can you recommend a budget-friendly fast food place with a good vegetarian menu?",
        "show me the nearest food truck serving tacos",
        "Can you recommend any food trucks with a diverse menu in the downtown area?",
        "I'm craving tacos, where can I find a food truck serving Mexican cuisine?",
        "I need a cozy place for a breakfast meeting with a good coffee selection and a quiet ambience.",
        "Where can I find a classy restaurant with a chic lounge for dinner tonight?",
        "are there any food trucks nearby that serve vegan dishes?",
        "recommend me a food truck with affordable prices",
        "I'm in the mood for some eggs benedict, can you recommend a restaurant with a good brunch menu",
        "Is there a well-rated buffet restaurant with a wide variety of dishes in the downtown area?",
        "Which buffet restaurants have a rating of 4 stars or above in San Francisco?",
        "what are the opening hours for the nearest café with vegan options",
        "are there any buffet restaurants with vegan options near me",
        "which food truck offers vegetarian options within 5 miles of downtown",
        "what's a good café with live music tonight",
        "What are the top-rated buffet restaurants in the area that cater to nut-free diets and provide delivery service?",
        "Is there a fast food joint with a romantic vibe and good ratings?",
        "Can you recommend a high-end café with a good selection of pastries and desserts",
        "what's a highly rated café that serves breakfast all day",
        "Can you recommend a high-end Italian restaurant with a view for dinner tonight?",
        "What are the operating hours for the Italian restaurant near the park that offers lunch specials?",
        "do you know any restaurants nearby that serve a good lunch menu",
        "I'm craving some pancakes and coffee, where can I go for breakfast within walking distance?",
        "What's the top-rated fast food joint that serves breakfast all day?",
        "Where can I find a cool spot with a variety of low-carb dishes for lunch?",
        "I'm looking for a place with a decent breakfast menu, not too expensive",
        "What food truck in this area offers a great outdoor dining experience",
        "What are the hours of operation for the nearest sushi place for lunch?",
        "Can you recommend a fine dining restaurant with waterfront views for dinner tonight?",
        "I'm craving some specialty coffee, where can I find a café with unique coffee drinks?",
        "can you recommend a nearby café with outdoor seating",
        "Which fast food place serves halal dishes?",
        "I'm looking for a breakfast spot with a cozy atmosphere and reasonable prices",
        "where can i get a good breakfast before 8 a m that delivers",
        "I'm looking for a vegan-friendly spot for lunch that has a good rating",
        "I'm craving some late-night comfort food, where can I find a place with a budget-friendly menu nearby?",
        "I'm in the mood for some gourmet food truck eats, where can I find an upscale option nearby?",
        "can you recommend a place for late-night dining with a diverse menu",
        "What are the hours for the nearest burger joint that delivers?",
        "Can you recommend a good Italian restaurant with outdoor seating for lunch tomorrow?",
        "show me a trendy brunch place with a good vibe",
        "can you recommend a café with outdoor seating and a good breakfast menu",
        "Can you recommend a fast food restaurant with a high rating and a location close to downtown?",
        "I'm looking for a fancy place with late-night dining, do you have any suggestions?",
        "Can you recommend a top-rated fine dining restaurant in the downtown area?",
        "I'm craving Asian cuisine, can you suggest a buffet that offers that?",
        "Can you recommend a fast food restaurant with vegetarian options nearby?",
        "I'm craving some coffee and pastries, where can I find a cozy café with outdoor seating?",
        "Can you recommend a luxurious food truck with a diverse menu for dinner tonight?",
        "where can I find a buffet with dairy-free options",
        "show me the top-rated food trucks in the area",
        "I'm craving some delicious street food, can you recommend a food truck with mid-range prices?",
        "what's the best rated brunch spot near me",
        "Can you recommend a restaurant with a prix fixe menu and a 4-star rating for dinner tonight?",
        "What are the hours of operation for the Japanese restaurant on 5th avenue?",
        "What are the operating hours for the nearest barbecue joint for dinner tonight?",
        "I'm looking for a place to grab some late-night takeout, preferably with a diverse menu.",
        "recommend a place for a fast breakfast bite on a budget",
        "What are some affordable Mexican restaurants near downtown for a quick lunch break?",
        "What are the hours of the nearest burger joint with nut-free choices",
        "Which café around here has a nice outdoor seating area?",
        "Can you recommend a high-end restaurant with a diverse menu for lunch?",
        "I'm looking for a place with a cozy atmosphere and a variety of breakfast options.",
        "I'm craving some pizza, where can I find a cheap and fast food pizza place?",
        "Can you recommend a formal restaurant in the area for a lunch meeting?",
        "I'm craving fast food, where can I find a high-end burger joint?",
        "what food trucks in the area are known for their barbecue",
        "Is there a 24-hour restaurant nearby that offers a breakfast buffet?",
        "I need a place for a nice dinner with a good rating and affordable prices, and it should offer delivery",
        "where can I find a steakhouse that's open past 10 pm",
        "Where can I find a mid-range priced restaurant that serves brunch in this area?",
        "Can you recommend a fine dining restaurant with a happy hour menu and takeout options?",
        "I'm a 30s male doctor looking for a restaurant with late-night dining. Any suggestions?",
        "Can you recommend a trendy spot for lunch with vegetarian options?",
        "Can you recommend any breakfast places with gluten-free options?",
        "Do you know any restaurants that offer a lunch special for under 15 dollars?",
        "What are the hours for a nearby sushi place open for lunch on weekdays?",
        "Can you recommend a fine dining restaurant in the downtown area with a romantic ambiance?",
        "which food truck serves vegan dishes and is open past 9 pm",
        "what's a good place by the water for lunch with outdoor seating?",
        "show me the nearest cafe that serves croissants before 10 am",
        "where can I get a sushi lunch for a reasonable price",
        "I'm looking for a cool spot to eat after midnight. Any recommendations?",
        "What's a good restaurant for a quick, affordable lunch",
        "I'm looking for a casual dining restaurant with outdoor seating and a moderate price range for dinner.",
        "What are the opening hours of the nearest halal café with a drive-thru?",
        "I'm looking for a breakfast spot with a cozy atmosphere and a reasonable price range.",
        "Do you know any restaurants with a brunch buffet and live music on Sundays?",
        "I'm looking for a brunch spot with outdoor seating",
        "Can you recommend a dine-in restaurant with a diverse brunch menu?",
        "I'm meeting a friend for lunch, can you recommend a café near the hospital with a healthy menu?",
        "What fast food places with a drive-thru are open late tonight?",
        "I'm craving some fast food by the waterfront, where's the nearest burger joint?",
        "What food trucks along the waterfront have a good rating for their seafood dishes?",
        "What is the best fine dining restaurant in the area?",
        "I need a quick bite from a food truck that won't break the bank, any suggestions?",
        "Can you recommend a top-rated Italian restaurant with outdoor seating for dinner tonight?",
        "Can you recommend a fine dining restaurant with a French cuisine?",
        "What are the hours of operation for dairy-free buffet restaurants in the area?",
        "What are the top-rated sushi places in downtown for a midday meal?",
        "What are the hours of operation for the nearest seafood restaurant open for dinner?",
        "I'm craving some sushi. Can you recommend a good sushi restaurant nearby?",
        "Do you know any late-night dining spots with affordable prices?",
        "Can you recommend a quirky spot for late-night dining?",
        "I'm craving some pancakes, where can I find a good breakfast spot with outdoor seating?",
        "Can you recommend a Chinese restaurant with a high rating and affordable lunch specials?",
        "where can I find a late-night dining option with a high rating",
        "What are some 24-hour diners with good reviews in the area?",
        "what are the opening hours of the café that serves vegan dishes",
        "where can I find a budget-friendly Italian restaurant for dinner tonight",
        "Which food truck has the best Mexican cuisine in the downtown area?",
        "What's a nice restaurant in the area with a brunch menu that offers vegetarian options?",
        "Can you recommend a café with delivery options for breakfast?",
        "What food trucks with a romantic ambience are open late tonight?",
        "where can I have a luxurious dinner experience",
        "Can you recommend a food truck in the downtown area with a high rating?",
        "What are the top-rated Italian restaurants for lunch in the downtown area?",
        "Which Italian restaurants near me offer takeout for dinner",
        "I'm looking for a Mexican restaurant with a patio open until 3 pm for lunch.",
        "Can you recommend a fine dining restaurant with a French cuisine for lunch?",
        "I'm in the mood for a fancy buffet, do you know any high-rated places?",
        "Where can I go for a buffet dinner with early bird specials",
        "I'm looking for a restaurant with outdoor seating and a good seafood menu for dinner",
        "I'm meeting a vegetarian friend for lunch, where can we find a place with a diverse menu?",
        "Which upscale fast food joints have the best late-night menu around here?",
        "I'm craving a waterfront brunch, where can I find one?",
        "What are the top-rated breakfast places with a high price range in this area?",
        "Do you know of any place with a nice patio where I can have a leisurely breakfast?",
        "Can you recommend a buffet restaurant nearby for dine-in?",
        "What's the best-rated buffet restaurant with a dessert bar?",
        "I'm craving some breakfast burritos, where can I find a good spot for that?",
        "where can I find a good sushi restaurant for lunch",
        "I'm looking for an upscale food truck with a diverse menu, where can I find one?",
        "Can you recommend a diner with pancakes and waffles nearby?",
        "I want to grab a quick bite from a food truck, where can I find one with affordable options?",
        "Can you recommend a charming and rustic restaurant for late-night dining?",
        "Which expensive fast food restaurants are open past 10 pm?",
        "Can you recommend a place for a fancy breakfast in the area?",
        "I'm looking for a place where I can have pancakes and coffee for breakfast before school.",
        "I'm looking for a dairy-free buffet restaurant with a good rating",
        "Which restaurant serves authentic Mexican cuisine for lunch in downtown?",
        "I'm looking for a casual late-night dining spot with a good selection of comfort food",
        "Where's the best place to grab a quick bite to eat for lunch near the mall?",
        "I'm craving some street food, where can I find a trendy food truck nearby",
        "Can you recommend a high-end place with a buffet for dinner",
        "I'm looking for a brunch place with a view of the ocean.",
        "I'm craving some high-end burgers, where's the nearest gourmet fast food place?",
        "What are the top-rated buffet restaurants in the downtown area?",
        "I'm craving some delicious pancakes, where can I find a good brunch spot",
        "where can I have a luxurious meal without breaking the bank",
        "What's a popular restaurant for brunch with bottomless mimosas in the area?",
        "Can you recommend a place with a high rating that offers a buffet dinner?",
        "I'm looking for a high-end restaurant with a seafood menu for a lunch meeting.",
        "Any recommendations for a fast food joint with drive-thru that offers hearty portions?",
        "Can you recommend a buffet restaurant with a waterfront ambience",
        "Which upscale restaurant around here serves a delicious brunch with private dining options?",
        "recommend a formal café with outdoor seating",
        "I'm looking for a breakfast spot with good reviews nearby",
        "Where can I find a rustic and charming food truck that serves authentic tacos",
        "I'm looking for an upscale restaurant with French cuisine",
        "I'm looking for a place with a good selection of vegetarian seafood dishes for dinner",
        "What is the most luxurious food truck in the area?",
        "I'm looking for an affordable restaurant with a romantic atmosphere, any suggestions?",
        "I'm looking for a cozy café with vegetarian options and good ambiance",
        "recommend a cheap burger joint with a high rating",
        "What are the top-rated Italian restaurants in the downtown area for a nice dinner?",
        "I'm meeting a friend for brunch, is there a nice place with outdoor seating",
        "can you suggest a place for late-night dining with a high rating",
        "where can I find a fine dining restaurant with a waterfront view",
        "What are the operating hours of the nearest food truck that serves vegan options?",
        "I want to grab a quick bite from a hip food truck, where's the nearest one?",
        "which café around here has outdoor seating and is open late",
        "I'm craving some eggs benedict, where can I get a good brunch around here",
        "What are the top-rated buffet restaurants in the city known for their seafood dishes?",
        "I want to try something new for lunch, can you suggest a trendy spot with affordable prices?",
        "I need a breakfast spot with a good reputation, can you recommend a place with high ratings?",
        "what's the best fast food joint with drive-thru in town?",
        "Can you recommend a restaurant with outdoor seating and a view of the ocean for dinner?",
        "I'm craving some delicious brunch, can you recommend a nearby spot with outdoor seating?",
        "I'm looking for a budget-friendly breakfast spot with a good variety of pancakes and omelettes",
        "I'm looking for a fine dining restaurant with a romantic ambiance and a prix fixe menu",
        "show me the nearest fast food restaurants with drive-thru service",
        "I'm looking for a fancy steakhouse that's open late for dinner.",
        "Can you recommend a restaurant with salads and a lunch special?",
        "what time do the food trucks start serving breakfast",
        "Can you recommend a cozy and intimate restaurant with a buffet option?",
        "I'm looking for a place with upscale cuisine and a relaxed atmosphere",
        "Can you recommend a restaurant nearby with a good selection of vegetarian dishes for lunch takeout?",
        "Where can I have a buffet dinner with a great view?",
        "Can you recommend a buffet restaurant with good ratings and a variety of cuisines in the downtown area",
        "What are the top-rated buffet restaurants near the beach?",
        "I'm looking for a fast food restaurant with a drive-thru open after 10 pm.",
        "Can you recommend a fancy restaurant with Italian food for dinner tonight?",
        "What are some fine dining restaurants with a casual ambience in the area?",
        "I'm looking for a nice Italian restaurant with outdoor seating and good ambience for a dinner date",
        "What's the best place for brunch in the city with a reasonable price range?",
        "what's the best affordable food truck for burgers in the area",
        "Can you recommend a cozy place with a good wine selection for dinner?",
        "Can you recommend a breakfast spot with a mid-range price range?",
        "Is there a food truck nearby with vegetarian options and good ratings?",
        "where is the nearest upscale café with a brunch menu",
        "I'm in the mood for some affordable sushi. Any suggestions for dinner around this area?",
        "I'm craving a vegetarian-friendly café for breakfast near the hotel",
        "Where can I find a food truck with happy hour specials for takeout",
        "what are the operating hours of the taco food truck in the downtown area",
        "What buffet restaurant has the best seafood in town?",
        "What food truck around here offers vegetarian options?",
        "Which restaurant around here provides dine-in options for late-night dining?",
        "Please find me a serene restaurant for a peaceful lunch break, preferably with a menu featuring seafood dishes.",
        "I'm looking for a place with a trendy ambiance and a good cocktail menu for late-night dining.",
        "Can you recommend a breakfast spot with a good rating?",
        "Can you recommend a dairy-free café with mid-range prices for lunch",
        "I'm looking for a place with good pizza after 11 pm",
        "Where can I find a coffee shop with a breakfast menu that opens at 7 a.m. close to my hotel?",
        "recommend a lounge or bar with a good lunch menu",
        "I need a quick bite, where is the nearest burger joint with good ratings?",
        "what's the best buffet restaurant in the downtown area",
        "what's a popular place for a morning meal with vegan options",
        "I'm looking for a gourmet food truck with a diverse menu, can you help me find one",
        "I'm looking for a fancy steakhouse with a high rating for our anniversary dinner.",
        "What are the operating hours for the BBQ food truck on 5th Avenue?",
        "Can you recommend a highly-rated Italian restaurant with outdoor seating for dinner tonight?",
        "I'm looking for a café with brunch menu for this weekend",
        "Where is the closest place for a brunch with outdoor seating",
        "What are the opening hours for Taco Bell near me?",
        "Is there a buffet restaurant nearby that offers a drive-thru option for dinner?",
        "which restaurant in this area offers breakfast for less than $15?",
        "I'm looking for a cheap but authentic Mexican restaurant for lunch, any suggestions?",
        "I'm looking for a restaurant that serves breakfast and offers chef's specials",
        "Can you recommend any restaurants with late-night dining options nearby?",
        "Do you know any trendy breakfast spots in the area?",
        "Can you recommend a high-end fast food joint with good ratings?",
        "what's the best fast food burger joint in town?",
        "Can you recommend any upscale restaurants with late-night dining options for those on a low-carb diet?",
        "Can you recommend a good Italian restaurant for lunch around here?",
        "I'm looking for a cheap place to grab some fast food in the evening. Any suggestions?",
        "I'm looking for a formal restaurant with a breakfast menu for a 25-year-old female nurse.",
        "Can you recommend a restaurant with a nice ambiance and outdoor seating for dinner?",
        "Can you recommend a lunch spot with a variety of vegetarian options?",
        "I want to treat my friend to a fancy breakfast for her birthday, can you recommend a restaurant with a high rating and a nice ambiance?",
        "what are the top-rated seafood places nearby",
        "Can you recommend a place for late-night dining with delivery options and good happy hour deals",
        "Can you recommend a trendy café with vegan options for a late brunch",
        "Is there a restaurant nearby that serves a tranquil brunch?",
        "can you recommend a restaurant with outdoor seating for dinner",
        "What restaurants serve breakfast before 9 a.m?",
        "what food trucks in the vicinity offer seafood dishes for lunch",
        "I need a quick bite after work, where's the nearest spot for fast food with a drive-thru?",
        "What are some places with a good rating for late-night dining?",
        "Is there a high-end restaurant with a dress code for dinner tonight?",
        "I'm looking for a café with a cozy atmosphere and a 4-star rating for a casual dinner",
        "Can you recommend a budget-friendly restaurant for a breakfast buffet?",
        "Can you recommend a café that serves brunch and is open late on weekends?",
        "Can you recommend a budget-friendly place for dinner with Italian cuisine?",
        "I'm looking for a fast-casual restaurant with a buffet for tonight"
    ]
}