{
    "entity-not-found-overlap": [
        "Do you know of any Mediterranean restaurants with outdoor seating and a high rating?",
        "Can you recommend a restaurant with affordable prices that serves authentic Mediterranean dishes?",
        "I'm craving seafood, where can I find a good seafood restaurant nearby",
        "I'm in the mood for some sushi. Are there any good sushi places nearby?",
        "I'm craving some seafood, where can I find a good seafood restaurant?",
        "I'm in the mood for sushi, where can I find a good sushi restaurant in this area",
        "I'm craving sushi, are there any good all-you-can-eat sushi places nearby?",
        "I'm craving some sushi, can you recommend a good sushi restaurant with outdoor seating?",
        "I'm craving some sushi, where can I find a good sushi restaurant nearby?",
        "I'm craving sushi, where can I find a good sushi restaurant?",
        "I'm craving sushi, where can I find the best sushi place nearby?",
        "can you recommend a restaurant with a tasting menu in the area close to Eleven Madison Park",
        "is there a highly rated restaurant near Eleven Madison Park with a prix fixe menu",
        "I'm in the mood for some sushi, where is the best sushi place in town?",
        "I'm in the mood for some sushi, where can I find a good sushi place?",
        "I'm in the mood for sushi, where can I find a good sushi restaurant nearby?",
        "I'm in the mood for some beef stir-fry, where can I get a tasty beef stir-fry dish for a reasonable price",
        "I'm craving some sushi, where is the best sushi restaurant nearby?"
    ],
    "not-allowed-entity-type": [
        "Where can I find the best pizza in town?",
        "Which restaurants offer breakfast before 10 a m?",
        "Can you recommend a restaurant that serves authentic Italian cuisine and is open until 10 p m?",
        "I'm craving some spicy Indian food for dinner tonight, where can I find a good place?",
        "What restaurants are open on Thanksgiving for brunch",
        "Can you recommend a budget-friendly place for dinner during the holiday season?",
        "Can you recommend a restaurant with Wifi in the downtown area?",
        "Where can I find a cheap brunch place in town for Saturday morning?",
        "Can you recommend a steakhouse with outdoor seating and live music for Saturday night?",
        "What are the hours of operation for the closest diner with a breakfast menu?",
        "Where can I find a waffle station for brunch?",
        "Can you recommend a restaurant with outdoor seating and a view of the river for dinner?",
        "Can you recommend a restaurant with outdoor seating and takes reservations?",
        "I'm looking for a sushi restaurant within walking distance",
        "Can you recommend a place with garden seating and a diverse cuisine selection?"
    ],
    "entity-not-found": [
        "I want to have some authentic Australian food, where can I find a place that serves kangaroo meat?",
        "Can you recommend a place with a good brunch menu?",
        "What are the hours for Greek Taverna on Main Street?",
        "Can you recommend a highly recommended brunch restaurant in the area that serves delicious cinnamon rolls?",
        "I'm craving some Italian food, can you recommend a good pizzeria around here",
        "I'm looking for a cozy restaurant with a relaxed atmosphere and French cuisine",
        "Is there a breakfast spot that opens before 7 am with affordable prices",
        "I'm craving for some burgers from The Twilight Grill, can you order delivery for me?",
        "I need to grab a quick bite, where's the closest café that serves avocado toast?",
        "Do you know if Wendy's offers any discounted combos?",
        "What are the operating hours for Japanese Garden Sushi?",
        "I'm looking for a pricey steakhouse with outdoor seating and a view",
        "can you recommend an exemplary seafood restaurant in the area"
    ],
    "missing-entity-type": [
        "Can you recommend a restaurant with outdoor seating area and a good wine selection?",
        "What are the hours for the nearest seafood restaurant?",
        "What's the best Italian restaurant in town?",
        "Which restaurant has the most variety on their menu?",
        "What are the hours for the nearest Italian restaurant?",
        "Do you know the hours for The Mimosa Mansion?",
        "What restaurants around here serve breakfast before 10 AM?",
        "Can you recommend a lunch spot with outdoor seating?",
        "Where can I find a place for brunch with bottomless mimosas?",
        "I want to try a highly rated restaurant, can you suggest a highly rated one in Quintonil?",
        "What are the hours of the nearest Thai restaurant?",
        "Can you recommend a highly-rated sushi restaurant in Manhattan for dinner tonight?",
        "What's the price range of the Italian restaurant on 5th Avenue?",
        "Find me a cafe with outdoor seating in Brooklyn that serves brunch on weekends",
        "What are the hours for the Italian restaurant downtown?",
        "What are the hours for Top-notch Buffet?"
    ],
    "low-logprob": [
        "show me the best Italian restaurants nearby",
        "What time does Sunrise Grill open on weekdays?",
        "recommend a sushi place with outdoor seating and a good view",
        "Do you know any Mexican restaurants that are open late?",
        "What's a great place in Portland to grab some dinner for under 20 dollars?",
        "what's a highly rated Chinese restaurant nearby",
        "Can you recommend any Lebanese restaurants in the downtown area that have a good outdoor seating area?",
        "I'm looking for a place to have an expensive dinner tonight.",
        "I'm in the mood for some steak, can you suggest a place with a good wine selection?",
        "Which restaurant has the best sushi in the area with a high rating?",
        "I need a recommendation for a romantic dinner in Paris, can you help?",
        "I'm craving some Japanese food for dinner on Saturday, can you recommend a good spot?",
        "What are the hours of operation for Pizzeria Uno?",
        "What's a good spot for brunch that's open before 11am?",
        "I'm craving some sushi, where is the closest place with a good happy hour menu?",
        "Do you know any restaurants in the area that serve Grilled sea bass?",
        "Where can I find a restaurant with a good Friday night special?",
        "Is there a place nearby with a good selection of vegetarian dishes?",
        "I need to grab a quick bite on a budget, can you suggest a place with affordable dishes under 20 dollars?",
        "what time does The Breakfast Club open for brunch",
        "I'm craving some delicious brunch from The Brunch Box, do they have any vegan options?",
        "I'm looking for a restaurant with a cozy atmosphere and superior quality cocktails.",
        "Where can I find a dog-friendly restaurant open on Monday for dinner",
        "What are the hours of the restaurant with the best seafood menu in the area?",
        "I want to find a restaurant with outdoor seating and a view of the ocean.",
        "Can you recommend a good Italian restaurant nearby for dinner tonight?",
        "Can you recommend any Chinese restaurants with a good lunch menu around here?",
        "What is the best place for sushi in the area and how late are they open",
        "I'm in the mood for some tacos, can you recommend a Taco Bell nearby?",
        "I'm craving some authentic Italian pizza, do you know any places with high ratings?",
        "I want to try some authentic curry, can you suggest a place with great curry dishes",
        "Can you recommend any Time Out's Best Restaurants nearby that offer vegetarian dishes?",
        "I need to find a cheap burger joint with vegan options",
        "What are the hours of the Italian restaurant on Main Street?",
        "where can I find a highly-rated Italian restaurant for dinner tonight",
        "What are the business hours for a Spanish restaurant in the downtown area?",
        "What are the opening hours of Downtown Diner on Saturdays?",
        "Do you know a sushi place with a high rating and reasonable prices?",
        "Can you recommend a good Chinese restaurant nearby?",
        "I'm craving some Italian food, where can I find a good Italian restaurant with outdoor seating?",
        "I want a tasty burger, take me to the nearest place with Whopper on the menu",
        "Can you recommend a restaurant in the area that takes reservations for dinner tonight?",
        "I want to try a dish from Thai restaurant, what do you suggest?",
        "Where can I find the best waffles in town?",
        "Can you recommend a restaurant with a patio for outdoor dining on Wednesday evening",
        "I need to satisfy my doner kebab craving, where's the closest place that serves it?",
        "Where can I find a burger joint open late tonight?",
        "What's a good restaurant with outdoor seating that serves avocado toast?",
        "I want to take my wife out for a celebrated dinner, where do you suggest?",
        "I'm looking for a place with Wi-Fi availability and a good selection of vegan dishes",
        "What is the price range for italian restaurants in this area?",
        "What's the best seafood place in town that's open for lunch?",
        "Where can I find some discounted barbecue options in the area?",
        "What's the best place in town for a fancy dinner?",
        "I'm craving some dim sum, where can I find a place with a good selection for dinner tonight?",
        "I'm looking for a family-friendly place with a playground and a diverse menu. Any suggestions?",
        "Can you recommend a good Japanese restaurant in the downtown area?",
        "Can you recommend a place nearby with a mediocre rating for a quick bite?",
        "I want to try something new, can you recommend a place with vegan options?",
        "Can you recommend any 5-star late-night dining options with positive feedback?",
        "I'm looking for a cost-effective restaurant with a must-try dish around here",
        "Is there a wallet-friendly restaurant nearby with a good vegetarian menu?",
        "I want to take my date to a place with outstanding reviews, do you know any highly rated restaurants in the area?",
        "I'm craving some gluten-free options, can you recommend a restaurant at the crossroads?",
        "I need a reservation for 2 at a top-rated Italian restaurant for tonight",
        "Where can I find a seafood restaurant close by?",
        "Can you recommend any Chipotle Mexican Grill locations nearby with outdoor seating and vegan options?",
        "show me a nearby restaurant serving Korean dishes within 20 dollars",
        "I'm craving a juicy hamburger, can you recommend a place with a great one?",
        "Can you recommend a restaurant adjacent to the Greek quarter?",
        "I'm craving some roast beef, where can I find the nearest Arby's?",
        "I want to have a fancy dinner tonight, can you recommend a high-end restaurant with a good wine selection?",
        "I'm looking for a restaurant with a cozy atmosphere and a fireplace",
        "Can you recommend a restaurant with good WiFi connection and a variety of vegan dishes?",
        "I'm craving some authentic Italian food, any suggestions for a good Italian restaurant?",
        "I'm in the mood for some Chinese cuisine, is there a place with a good happy hour menu nearby?",
        "I need a late-night dining spot with a reasonable price, can you recommend one?",
        "show me the nearest expensive restaurants with outdoor seating",
        "I'm craving a burger, where can I find a good one near Five Guys ?",
        "I'm craving some fried chicken, do you know any restaurants in the area that serve it?",
        "What's a good seafood place with outdoor seating and a view of the ocean?",
        "I want to try some authentic Italian pasta, do you know a place with good reviews and reasonable prices Closing soon ?",
        "Can you recommend any brunch spots with positive feedback in the area?",
        "Is there a restaurant with a self-serve Beverage station in this area?",
        "are there any restaurants open past midnight in this area?",
        "can you recommend a restaurant with outdoor seating and good seafood dishes",
        "What's the best seafood restaurant near me that's open late?",
        "Which restaurants nearby offer vegetarian dishes at a reasonable price?",
        "I'm in the mood for sushi. Is there a place nearby with good reviews?",
        "What are the operating hours for the sushi place on Main Street?",
        "Do you know any restaurants with great vegetarian options?",
        "What's the best intersection for Korean cuisine and Vietnamese food around here?",
        "Can you recommend a must-try Italian restaurant that is cost-effective",
        "Where is the nearest place where I can get bibimbap for a reasonable price?",
        "I'm craving some soup, where can I find the best bowl of soup in town?",
        "I'd like to make a reservation at The Mimosa Mansion for dinner tonight",
        "What are the hours for the nearest Italian restaurant to my location?",
        "I'm looking for a restaurant with a high rating in this area, any suggestions?",
        "I'm craving some Italian cuisine, is there a restaurant nearby with a great pasta dish?",
        "What are the operating hours for the sushi restaurant near the mall?",
        "Where can I find breakfast coupons and discounts in the area?",
        "What is the price range for Italian restaurants in the area?",
        "I'm craving some Italian cuisine, are there any places with a good rating nearby",
        "I'm craving sushi, is there a good sushi bar that opens late nearby",
        "What are the opening hours for the seafood restaurant on Main Street?",
        "Please recommend a good sushi restaurant nearby.",
        "Can you recommend any five-star late-night establishments in this area?",
        "What's the best place in the area for a quick bite to eat?",
        "What are the operating hours for the new Italian restaurant downtown?",
        "I'm looking for a place to eat with outdoor seating and a diverse menu, do you have any suggestions?",
        "What's a popular Mexican restaurant in the area?",
        "What are the operating hours of the restaurants in Flapjack Junction for tomorrow?",
        "I'm taking my friend who has celiac disease out to eat, do you know of any restaurants with a gluten-free menu in the area?",
        "Can you suggest a place with outdoor seating and a diverse menu, maybe with some vegetarian options?",
        "I'm craving some pad thai, what's the best Thai restaurant nearby?",
        "Which restaurant in this area has a patio and serves vegetarian dishes?",
        "Where can I find a restaurant with amazing French cuisine?",
        "I need to find a restaurant near me that serves quality food at a reasonable price, any recommendations other than Wendy's ?",
        "Can you recommend a restaurant with outdoor seating in the business district?",
        "Can you recommend a breakfast inexpensive restaurant serving continental cuisine in this area?",
        "Recommend a cozy restaurant with a good ambiance and affordable prices for dinner.",
        "Can you recommend a restaurant in the area with a Michelin star rating?",
        "I'm craving some breakfast tacos, where can I find a place that serves them?",
        "Can you recommend a restaurant with outdoor seating and a vegan menu?",
        "What are the operating hours for the nearest sushi bar?",
        "Can you recommend any restaurants with a Good Food Guide rating within walking distance?",
        "Can you recommend a restaurant with delicious mussels?",
        "What are the restaurant hours for Pizza Hut?",
        "Can you recommend a restaurant nearby that serves delicious fish tacos?",
        "I'm craving some authentic Mexican cuisine. Are there any restaurants nearby that fit the bill?",
        "do you know of any restaurants with vegan options offering outdoor seating?",
        "what time does The Bagel Barn close tonight",
        "I'm craving some authentic Mexican dishes, do you know any well-rated restaurants nearby?",
        "Can you recommend a restaurant with a good wine selection and Last seating time?",
        "I need to grab a quick bite, is there a highly recommended low-cost burger joint around here?",
        "What are the operating hours for the Brazilian steakhouse in the city center?",
        "What are the operating hours for The Brunch Box on Sundays?",
        "I'm in the mood for Italian cuisine, where can I find a good Italian restaurant nearby?",
        "Which restaurant serves authentic Italian pizza in this area?",
        "I'm looking for a restaurant with a waterfront view for dinner.",
        "I'm craving some sushi, what's a good place for that around here?",
        "I'm craving some authentic Italian pasta, where can I find a good Italian restaurant nearby?",
        "Where can I find a good Nighttime Noshery with vegetarian options?",
        "What are the operating hours for the barbecue joint on Main Street?",
        "what is the best sushi restaurant in the area",
        "I need a recommendation for a budget-friendly restaurant in the industrial area with a diverse cuisine selection open before 9 am.",
        "Can you recommend any restaurants in Uptown that offer cooking classes on the weekend?",
        "I'm looking for a place with a playground for the kids, any suggestions?",
        "I'm craving Italian food, where can I find a highly rated pizza restaurant near me?",
        "What are the opening hours for the Indian restaurant on Main Street?",
        "Where can I find a good grilled cheese in this area?",
        "Can you recommend a high-rated restaurant where I can find a delicious seafood platter?",
        "Where can I find a spectacular outdoor dining spot with a view of the river?",
        "Do you know if Huddle House serves breakfast all day or if they have specific hours for it?",
        "Do you know of any Italian restaurants with outdoor seating and a view within walking distance of Alfred Coffee?",
        "Can you recommend any five-star rated brunch spots in the area?",
        "Can you recommend a terrific café that allows BYOB?",
        "Find a place with live music and a 4-star rating for dinner tonight",
        "Where can I find a good Italian restaurant around here?",
        "I'm craving some good sushi, where can I find a place with high ratings?",
        "Where can I find value for money food options nearby?",
        "I'm craving some sushi, is there a place nearby with all-you-can-eat pricing?",
        "can you recommend any Nearby Italian restaurants with a patio?",
        "I'm craving some authentic Italian cuisine, any suggestions for a good Italian restaurant nearby?",
        "I'm craving some Korean barbecue, where can I find a good place for it?",
        "Find me a Spanish restaurant open on Wednesday night",
        "I'm craving a Big Mac, where is the nearest McDonald's?",
        "I'm looking for a restaurant in the vicinity of Downtown Diner with a high rating",
        "I'm craving some Indian food, where can I find a highly rated restaurant in this area?",
        "I want to try some authentic Italian food, any recommendations?",
        "What are the operating hours for the best seafood restaurant in town?",
        "I'm craving sushi, where's the best place to get it in this area?",
        "where is the closest bakery counter",
        "what type of cuisine does The Coffee House offer?",
        "I'm looking for a place with outdoor seating and a good happy hour deal. Any recommendations?",
        "I'm craving some Southern comfort food, where can I find a place with affordable prices?",
        "I'm craving some Greek food, where can I find a good Greek restaurant around here",
        "Can you recommend a popular choice for a restaurant that offers gluten-free options?",
        "I'm looking for a budget-friendly restaurant with a vegan menu, any suggestions?",
        "Can you recommend a place with a good selection of vegetarian dishes and a patio?",
        "Where can I find a place serving halal cuisine around here?",
        "which restaurant has the best view of the city and is open late",
        "Do you know any French places with a good happy hour deal?",
        "I'm craving some authentic Italian cuisine, where can I find a good Italian restaurant open late?",
        "Do you know of any restaurants in New York City with a New American cuisine menu",
        "I'm in the mood for some sushi, can you recommend a top-ranked Japanese restaurant?",
        "Do you know of any restaurants that serve veggie burgers for under $15?",
        "recommend a budget-friendly steakhouse with a good wine selection",
        "Which restaurant in Las Vegas has the best ratings for Mexican cuisine?",
        "What are some highly rated Italian restaurants in the area according to Zagat",
        "I'm looking for a restaurant that offers a family pack meal",
        "Can you recommend a restaurant with a great outdoor seating area?",
        "I'm craving Korean food, where can I find a bargain for a family-friendly section?",
        "Can you recommend a highly rated seafood restaurant in City ?",
        "I'm craving a healthy breakfast, where can I get a delicious granola bowl?",
        "What's a popular Mexican restaurant with outdoor seating for dinner?",
        "Can you recommend the best-reviewed Italian restaurant in the suburban area?",
        "I'm craving sushi, where's a good Japanese place nearby?",
        "Is there a highly rated café nearby with outdoor seating?",
        "I'm looking for some Breakfast economic choices around here",
        "Can you recommend a good restaurant with a diverse menu and a great ambiance for under 30 dollars a plate?",
        "I'm looking for a place for night time dining with good seafood, any suggestions?",
        "Do you know of any vegan-friendly restaurants with wifi in the downtown area?",
        "What is the best Italian restaurant in the suburbs with outdoor seating",
        "Can you suggest a restaurant with a diverse cuisine options that is open late?",
        "Can you recommend any restaurants in Atlanta that offer not too expensive late night dining?",
        "Hey, can you recommend a place for a special occasion dinner with a view of the water?",
        "What are the hours for the Italian restaurant in the shopping center?",
        "I'm looking for a restaurant with a chocolate fountain for a special occasion, can you recommend one?",
        "What are the operating hours of the nearest seafood restaurant?",
        "Do you know any restaurants with afternoon opening hours and lobster rolls on the menu?",
        "I'm craving a cheesesteak from Cheesesteak Central Food Truck , where is it located right now?",
        "What are the hours of operation for the nearest burger joint?",
        "I'm craving a fine dining experience, can you suggest a restaurant like Per Se?",
        "What are the hours of operation for the nearest sushi place?",
        "I'm looking for a restaurant with outdoor seating area that serves vegetarian dishes.",
        "I'm looking for an inexpensive restaurant with group discounts.",
        "What is the best Italian restaurant in this area according to reviews?",
        "I'm looking for a reasonably priced Lebanese restaurant with high ratings for dinner tonight.",
        "Where can I find good value for money restaurants in this area?",
        "show me the highest rated Lebanese restaurants in the area",
        "Can you recommend a restaurant with handicap accessibility for dinner tonight?",
        "What are the top-rated Indian restaurants in the city center?",
        "Can you recommend any budget-friendly late night dining options nearby?",
        "What restaurants with an OpenTable rating of 4 stars or above are open past midnight?",
        "Can you recommend any highly acclaimed lunch places nearby?",
        "Do you know of any Spanish restaurants with a prix fixe menu for dinner?",
        "I'm craving something sweet, can you recommend a place with the best croissants in town?",
        "I'm looking for a restaurant with a good rating and outdoor seating in the downtown area.",
        "I'm looking for a fancy place to have an expensive dinner tonight",
        "I'm craving some Italian cuisine, can you recommend a restaurant nearby?",
        "I'm looking for some expensive brunch restaurants in the area, any recommendations?",
        "Can you recommend a Lebanese restaurant that uses local ingredients for their dishes?",
        "Which restaurant around here has a good happy hour menu?",
        "I'm in the mood for some tacos, can you find the nearest Taco Bell for me?",
        "I'm looking for a place downtown with valet parking and an impressive menu.",
        "I'm craving sushi. Is there a place with a high rating in this area?",
        "I'm looking for a cozy place with affordable prices for dinner tonight",
        "Is there any restaurant nearby with live music tonight?",
        "I'm craving avocado toast, is there a Bluestone Lane in the area?",
        "I'm in the mood for some upscale dining tonight, where can I find a reservation at Blue Hill at Stone Barns?",
        "I want to take my friends out for a nice barbecue dinner, but I don't want to spend too much. Any suggestions?",
        "I'm looking for a restaurant with a Michelin star in the downtown area with bar service hours.",
        "What are the opening hours for the Japanese restaurant downtown?",
        "Is there a highly rated restaurant that offers both patio seating and good value for money?",
        "What's the best nighttime noshery in the area?",
        "Can you recommend a place that serves a good cheeseburger?",
        "What are the best vegetarian dishes at Five Guys ?",
        "Can you recommend a farm-to-table restaurant on the map?",
        "I'm looking for a restaurant with a steeper price range, any recommendations?",
        "I'm craving some barbecue, can you recommend a good restaurant nearby?",
        "Can you recommend any mid-priced late night restaurants in the area?",
        "I'm craving for some authentic Italian pasta, is there a place nearby?",
        "Can you recommend a low-cost place with extended hours that serves Toby's Estate Coffee?",
        "I'm craving some authentic Italian cuisine, where can I find a good spot for that?",
        "what are the hours of operation for Eleven Madison Park",
        "Where can I find the best pho soup in town?",
        "What are the closing hours for Block restaurant?",
        "What are the operating hours for Italian restaurant Scott's Trattoria?",
        "I need a quiet place for brunch within a reasonable price range",
        "Do you know any restaurants that offer meal deals for dinner tonight?",
        "I'm craving a dish with spicy flavors, can you recommend a restaurant that serves spicy food?",
        "What time does Domino's Pizza close tonight?",
        "Do you know any restaurants with outdoor seating and a kids menu?",
        "Can you recommend a good reviews café in the downtown area?",
        "Which burger joint has the highest rating in this area?",
        "What time does TGI Fridays close tonight?",
        "Can you recommend any restaurants nearby that have a great selection of sandwiches",
        "Can you recommend a restaurant with good value for The Halal Food Cart?",
        "Which restaurant has the most affordable prices for a plate of pho soup?",
        "Where is the nearest location of The Cheesecake Factory?",
        "I'm craving for some authentic Italian cuisine, where can I find a place with a good wine selection?",
        "where can I get the best sushi in town",
        "Do you know any brunch packages in the area?",
        "What's the best spot for brunch with bottomless mimosas in this area?",
        "What's the best restaurant in town that offers a chocolate fountain dessert?",
        "I'm craving a fancy steak dinner, can you recommend The Capital Grille?",
        "Can you make a reservation at Blue Hill at Stone Barns for 7 pm tonight?",
        "I'm craving some spicy food, where can I find a restaurant with authentic Wendy's cuisine?",
        "What are the hours of operation for a budget-friendly Indian restaurant near me?",
        "I'm in the mood for some delicious pastries, where can I find a top-notch café around here?",
        "What are the restaurant options with vegan dishes and outdoor seating?",
        "Can you recommend a Bargain sushi restaurant near me?",
        "I'm craving some authentic Mexican cuisine, where can I find a restaurant with reasonable prices and good reviews?",
        "Can you recommend a barbecue restaurant with a good rating in the downtown area?",
        "What's the best Italian restaurant in town?",
        "What's the highest-rated seafood restaurant with outdoor seating and a view of the ocean?",
        "I want to take my date somewhere excellent. Can you recommend a restaurant?",
        "Can you recommend any affordable options for Italian food with outdoor seating?",
        "I'm craving some good fried chicken, where's the nearest restaurant with a takeout window?",
        "Is there a nearby place with a good rating for seafood dishes?",
        "I'm craving some tacos, where can I find a good taqueria in this area",
        "I'm a vegetarian, do you have any recommendations for a good veggie burger in the area?",
        "I'm in the mood for some authentic sushi. Where's the best Japanese restaurant in town?",
        "What are the opening hours of the nearest Thai restaurant?",
        "Recommend a place with outdoor seating and a good view of the city skyline",
        "Where can I find a restaurant with good value for money in the area?",
        "What type of cuisine does Noma specialize in?",
        "I'm looking for a burger joint open past midnight",
        "What's the best sushi place in town with a high rating?",
        "What are the popular late-night restaurant reviews in this area?",
        "I'm looking for a family-friendly restaurant with a kids' menu for dinner on Wednesday",
        "Can you recommend a seafood restaurant with a waterfront view?",
        "What time does the Italian restaurant in downtown open for dinner?",
        "Can you recommend a restaurant with Korean barbecue for dinner tonight?",
        "Do you know if the reservation system is working at that new Italian restaurant downtown?",
        "Synthetic Query: \"I'm craving some authentic Italian food, where can I find a good place?\"",
        "What's the best Italian restaurant in the area with affordable prices?",
        "can you suggest a place to dine at L'Atelier de Joël Robuchon with a high rating",
        "I'm craving sushi, is there a good Japanese restaurant nearby?",
        "Can you recommend a nearby Italian restaurant with a rating above 4 stars?",
        "What time do you close?",
        "I need a reservation for a family dinner at an Italian restaurant with a kids menu",
        "Hey, I'm looking for a vegan restaurant in the Urban area, can you recommend one?",
        "Where is the closest Indian restaurant with vegetarian options?",
        "Can you recommend a good barbecue restaurant near Texas Roadhouse with outdoor seating?",
        "What are some sushi places with outdoor seating and vegan options?",
        "Do you know any restaurants near Eleven Madison Park that are open for dinner?",
        "I'm in the mood for some French cuisine, where can I find a good French restaurant in the area?",
        "recommend a place with outdoor seating for brunch",
        "Where can I find a restaurant with the best mussels in town?",
        "What are the operating hours of the nearest Italian restaurant?",
        "What are the hours for the Italian restaurant downtown?",
        "I need a restaurant with outdoor seating in a romantic setting",
        "Recommend a place for a fancy dinner with a seafood menu within walking distance.",
        "What's a highly rated restaurant in this area where I can enjoy a nice steak dinner?",
        "What's the best Italian restaurant in the area and what are their hours?",
        "Do you know of any Breakfast Clubhouse in the area that opens early?",
        "Find me a restaurant with a patio and outdoor seating, I prefer Italian cuisine.",
        "What are the top Italian restaurants in the area",
        "I'm looking for a vegan-friendly place. How about The Bean Counter Bistro?",
        "Can you recommend a restaurant with a Senior Citizen Discount and good seafood options?",
        "Can you recommend an outstanding food truck in the area?",
        "Which restaurant serves the best sushi in the city and is open late on weekends?",
        "I'm looking for a brunch place with good food and reasonable prices. Any recommendations?",
        "Can you recommend a bar with a great selection of appetizers?"
    ],
    "sentences": [
        "Do you know of any Mediterranean restaurants with outdoor seating and a high rating?",
        "Can you recommend a restaurant with affordable prices that serves authentic Mediterranean dishes?",
        "I'm craving seafood, where can I find a good seafood restaurant nearby",
        "I'm in the mood for some sushi. Are there any good sushi places nearby?",
        "I'm craving some seafood, where can I find a good seafood restaurant?",
        "I'm in the mood for sushi, where can I find a good sushi restaurant in this area",
        "I'm craving sushi, are there any good all-you-can-eat sushi places nearby?",
        "I'm craving some sushi, can you recommend a good sushi restaurant with outdoor seating?",
        "I'm craving some sushi, where can I find a good sushi restaurant nearby?",
        "I'm craving sushi, where can I find a good sushi restaurant?",
        "I'm craving sushi, where can I find the best sushi place nearby?",
        "can you recommend a restaurant with a tasting menu in the area close to Eleven Madison Park",
        "is there a highly rated restaurant near Eleven Madison Park with a prix fixe menu",
        "I'm in the mood for some sushi, where is the best sushi place in town?",
        "I'm in the mood for some sushi, where can I find a good sushi place?",
        "I'm in the mood for sushi, where can I find a good sushi restaurant nearby?",
        "I'm in the mood for some beef stir-fry, where can I get a tasty beef stir-fry dish for a reasonable price",
        "I'm craving some sushi, where is the best sushi restaurant nearby?",
        "Where can I find the best pizza in town?",
        "Which restaurants offer breakfast before 10 a m?",
        "Can you recommend a restaurant that serves authentic Italian cuisine and is open until 10 p m?",
        "I'm craving some spicy Indian food for dinner tonight, where can I find a good place?",
        "What restaurants are open on Thanksgiving for brunch",
        "Can you recommend a budget-friendly place for dinner during the holiday season?",
        "Can you recommend a restaurant with Wifi in the downtown area?",
        "Where can I find a cheap brunch place in town for Saturday morning?",
        "Can you recommend a steakhouse with outdoor seating and live music for Saturday night?",
        "What are the hours of operation for the closest diner with a breakfast menu?",
        "Where can I find a waffle station for brunch?",
        "Can you recommend a restaurant with outdoor seating and a view of the river for dinner?",
        "Can you recommend a restaurant with outdoor seating and takes reservations?",
        "I'm looking for a sushi restaurant within walking distance",
        "Can you recommend a place with garden seating and a diverse cuisine selection?",
        "I want to have some authentic Australian food, where can I find a place that serves kangaroo meat?",
        "Can you recommend a place with a good brunch menu?",
        "What are the hours for Greek Taverna on Main Street?",
        "Can you recommend a highly recommended brunch restaurant in the area that serves delicious cinnamon rolls?",
        "I'm craving some Italian food, can you recommend a good pizzeria around here",
        "I'm looking for a cozy restaurant with a relaxed atmosphere and French cuisine",
        "Is there a breakfast spot that opens before 7 am with affordable prices",
        "I'm craving for some burgers from The Twilight Grill, can you order delivery for me?",
        "I need to grab a quick bite, where's the closest café that serves avocado toast?",
        "Do you know if Wendy's offers any discounted combos?",
        "What are the operating hours for Japanese Garden Sushi?",
        "I'm looking for a pricey steakhouse with outdoor seating and a view",
        "can you recommend an exemplary seafood restaurant in the area",
        "Can you recommend a restaurant with outdoor seating area and a good wine selection?",
        "What are the hours for the nearest seafood restaurant?",
        "What's the best Italian restaurant in town?",
        "Which restaurant has the most variety on their menu?",
        "What are the hours for the nearest Italian restaurant?",
        "Do you know the hours for The Mimosa Mansion?",
        "What restaurants around here serve breakfast before 10 AM?",
        "Can you recommend a lunch spot with outdoor seating?",
        "Where can I find a place for brunch with bottomless mimosas?",
        "I want to try a highly rated restaurant, can you suggest a highly rated one in Quintonil?",
        "What are the hours of the nearest Thai restaurant?",
        "Can you recommend a highly-rated sushi restaurant in Manhattan for dinner tonight?",
        "What's the price range of the Italian restaurant on 5th Avenue?",
        "Find me a cafe with outdoor seating in Brooklyn that serves brunch on weekends",
        "What are the hours for the Italian restaurant downtown?",
        "What are the hours for Top-notch Buffet?",
        "show me the best Italian restaurants nearby",
        "What time does Sunrise Grill open on weekdays?",
        "recommend a sushi place with outdoor seating and a good view",
        "Do you know any Mexican restaurants that are open late?",
        "What's a great place in Portland to grab some dinner for under 20 dollars?",
        "what's a highly rated Chinese restaurant nearby",
        "Can you recommend any Lebanese restaurants in the downtown area that have a good outdoor seating area?",
        "I'm looking for a place to have an expensive dinner tonight.",
        "I'm in the mood for some steak, can you suggest a place with a good wine selection?",
        "Which restaurant has the best sushi in the area with a high rating?",
        "I need a recommendation for a romantic dinner in Paris, can you help?",
        "I'm craving some Japanese food for dinner on Saturday, can you recommend a good spot?",
        "What are the hours of operation for Pizzeria Uno?",
        "What's a good spot for brunch that's open before 11am?",
        "I'm craving some sushi, where is the closest place with a good happy hour menu?",
        "Do you know any restaurants in the area that serve Grilled sea bass?",
        "Where can I find a restaurant with a good Friday night special?",
        "Is there a place nearby with a good selection of vegetarian dishes?",
        "I need to grab a quick bite on a budget, can you suggest a place with affordable dishes under 20 dollars?",
        "what time does The Breakfast Club open for brunch",
        "I'm craving some delicious brunch from The Brunch Box, do they have any vegan options?",
        "I'm looking for a restaurant with a cozy atmosphere and superior quality cocktails.",
        "Where can I find a dog-friendly restaurant open on Monday for dinner",
        "What are the hours of the restaurant with the best seafood menu in the area?",
        "I want to find a restaurant with outdoor seating and a view of the ocean.",
        "Can you recommend a good Italian restaurant nearby for dinner tonight?",
        "Can you recommend any Chinese restaurants with a good lunch menu around here?",
        "What is the best place for sushi in the area and how late are they open",
        "I'm in the mood for some tacos, can you recommend a Taco Bell nearby?",
        "I'm craving some authentic Italian pizza, do you know any places with high ratings?",
        "I want to try some authentic curry, can you suggest a place with great curry dishes",
        "Can you recommend any Time Out's Best Restaurants nearby that offer vegetarian dishes?",
        "I need to find a cheap burger joint with vegan options",
        "What are the hours of the Italian restaurant on Main Street?",
        "where can I find a highly-rated Italian restaurant for dinner tonight",
        "What are the business hours for a Spanish restaurant in the downtown area?",
        "What are the opening hours of Downtown Diner on Saturdays?",
        "Do you know a sushi place with a high rating and reasonable prices?",
        "Can you recommend a good Chinese restaurant nearby?",
        "I'm craving some Italian food, where can I find a good Italian restaurant with outdoor seating?",
        "I want a tasty burger, take me to the nearest place with Whopper on the menu",
        "Can you recommend a restaurant in the area that takes reservations for dinner tonight?",
        "I want to try a dish from Thai restaurant, what do you suggest?",
        "Where can I find the best waffles in town?",
        "Can you recommend a restaurant with a patio for outdoor dining on Wednesday evening",
        "I need to satisfy my doner kebab craving, where's the closest place that serves it?",
        "Where can I find a burger joint open late tonight?",
        "What's a good restaurant with outdoor seating that serves avocado toast?",
        "I want to take my wife out for a celebrated dinner, where do you suggest?",
        "I'm looking for a place with Wi-Fi availability and a good selection of vegan dishes",
        "What is the price range for italian restaurants in this area?",
        "What's the best seafood place in town that's open for lunch?",
        "Where can I find some discounted barbecue options in the area?",
        "What's the best place in town for a fancy dinner?",
        "I'm craving some dim sum, where can I find a place with a good selection for dinner tonight?",
        "I'm looking for a family-friendly place with a playground and a diverse menu. Any suggestions?",
        "Can you recommend a good Japanese restaurant in the downtown area?",
        "Can you recommend a place nearby with a mediocre rating for a quick bite?",
        "I want to try something new, can you recommend a place with vegan options?",
        "Can you recommend any 5-star late-night dining options with positive feedback?",
        "I'm looking for a cost-effective restaurant with a must-try dish around here",
        "Is there a wallet-friendly restaurant nearby with a good vegetarian menu?",
        "I want to take my date to a place with outstanding reviews, do you know any highly rated restaurants in the area?",
        "I'm craving some gluten-free options, can you recommend a restaurant at the crossroads?",
        "I need a reservation for 2 at a top-rated Italian restaurant for tonight",
        "Where can I find a seafood restaurant close by?",
        "Can you recommend any Chipotle Mexican Grill locations nearby with outdoor seating and vegan options?",
        "show me a nearby restaurant serving Korean dishes within 20 dollars",
        "I'm craving a juicy hamburger, can you recommend a place with a great one?",
        "Can you recommend a restaurant adjacent to the Greek quarter?",
        "I'm craving some roast beef, where can I find the nearest Arby's?",
        "I want to have a fancy dinner tonight, can you recommend a high-end restaurant with a good wine selection?",
        "I'm looking for a restaurant with a cozy atmosphere and a fireplace",
        "Can you recommend a restaurant with good WiFi connection and a variety of vegan dishes?",
        "I'm craving some authentic Italian food, any suggestions for a good Italian restaurant?",
        "I'm in the mood for some Chinese cuisine, is there a place with a good happy hour menu nearby?",
        "I need a late-night dining spot with a reasonable price, can you recommend one?",
        "show me the nearest expensive restaurants with outdoor seating",
        "I'm craving a burger, where can I find a good one near Five Guys ?",
        "I'm craving some fried chicken, do you know any restaurants in the area that serve it?",
        "What's a good seafood place with outdoor seating and a view of the ocean?",
        "I want to try some authentic Italian pasta, do you know a place with good reviews and reasonable prices Closing soon ?",
        "Can you recommend any brunch spots with positive feedback in the area?",
        "Is there a restaurant with a self-serve Beverage station in this area?",
        "are there any restaurants open past midnight in this area?",
        "can you recommend a restaurant with outdoor seating and good seafood dishes",
        "What's the best seafood restaurant near me that's open late?",
        "Which restaurants nearby offer vegetarian dishes at a reasonable price?",
        "I'm in the mood for sushi. Is there a place nearby with good reviews?",
        "What are the operating hours for the sushi place on Main Street?",
        "Do you know any restaurants with great vegetarian options?",
        "What's the best intersection for Korean cuisine and Vietnamese food around here?",
        "Can you recommend a must-try Italian restaurant that is cost-effective",
        "Where is the nearest place where I can get bibimbap for a reasonable price?",
        "I'm craving some soup, where can I find the best bowl of soup in town?",
        "I'd like to make a reservation at The Mimosa Mansion for dinner tonight",
        "What are the hours for the nearest Italian restaurant to my location?",
        "I'm looking for a restaurant with a high rating in this area, any suggestions?",
        "I'm craving some Italian cuisine, is there a restaurant nearby with a great pasta dish?",
        "What are the operating hours for the sushi restaurant near the mall?",
        "Where can I find breakfast coupons and discounts in the area?",
        "What is the price range for Italian restaurants in the area?",
        "I'm craving some Italian cuisine, are there any places with a good rating nearby",
        "I'm craving sushi, is there a good sushi bar that opens late nearby",
        "What are the opening hours for the seafood restaurant on Main Street?",
        "Please recommend a good sushi restaurant nearby.",
        "Can you recommend any five-star late-night establishments in this area?",
        "What's the best place in the area for a quick bite to eat?",
        "What are the operating hours for the new Italian restaurant downtown?",
        "I'm looking for a place to eat with outdoor seating and a diverse menu, do you have any suggestions?",
        "What's a popular Mexican restaurant in the area?",
        "What are the operating hours of the restaurants in Flapjack Junction for tomorrow?",
        "I'm taking my friend who has celiac disease out to eat, do you know of any restaurants with a gluten-free menu in the area?",
        "Can you suggest a place with outdoor seating and a diverse menu, maybe with some vegetarian options?",
        "I'm craving some pad thai, what's the best Thai restaurant nearby?",
        "Which restaurant in this area has a patio and serves vegetarian dishes?",
        "Where can I find a restaurant with amazing French cuisine?",
        "I need to find a restaurant near me that serves quality food at a reasonable price, any recommendations other than Wendy's ?",
        "Can you recommend a restaurant with outdoor seating in the business district?",
        "Can you recommend a breakfast inexpensive restaurant serving continental cuisine in this area?",
        "Recommend a cozy restaurant with a good ambiance and affordable prices for dinner.",
        "Can you recommend a restaurant in the area with a Michelin star rating?",
        "I'm craving some breakfast tacos, where can I find a place that serves them?",
        "Can you recommend a restaurant with outdoor seating and a vegan menu?",
        "What are the operating hours for the nearest sushi bar?",
        "Can you recommend any restaurants with a Good Food Guide rating within walking distance?",
        "Can you recommend a restaurant with delicious mussels?",
        "What are the restaurant hours for Pizza Hut?",
        "Can you recommend a restaurant nearby that serves delicious fish tacos?",
        "I'm craving some authentic Mexican cuisine. Are there any restaurants nearby that fit the bill?",
        "do you know of any restaurants with vegan options offering outdoor seating?",
        "what time does The Bagel Barn close tonight",
        "I'm craving some authentic Mexican dishes, do you know any well-rated restaurants nearby?",
        "Can you recommend a restaurant with a good wine selection and Last seating time?",
        "I need to grab a quick bite, is there a highly recommended low-cost burger joint around here?",
        "What are the operating hours for the Brazilian steakhouse in the city center?",
        "What are the operating hours for The Brunch Box on Sundays?",
        "I'm in the mood for Italian cuisine, where can I find a good Italian restaurant nearby?",
        "Which restaurant serves authentic Italian pizza in this area?",
        "I'm looking for a restaurant with a waterfront view for dinner.",
        "I'm craving some sushi, what's a good place for that around here?",
        "I'm craving some authentic Italian pasta, where can I find a good Italian restaurant nearby?",
        "Where can I find a good Nighttime Noshery with vegetarian options?",
        "What are the operating hours for the barbecue joint on Main Street?",
        "what is the best sushi restaurant in the area",
        "I need a recommendation for a budget-friendly restaurant in the industrial area with a diverse cuisine selection open before 9 am.",
        "Can you recommend any restaurants in Uptown that offer cooking classes on the weekend?",
        "I'm looking for a place with a playground for the kids, any suggestions?",
        "I'm craving Italian food, where can I find a highly rated pizza restaurant near me?",
        "What are the opening hours for the Indian restaurant on Main Street?",
        "Where can I find a good grilled cheese in this area?",
        "Can you recommend a high-rated restaurant where I can find a delicious seafood platter?",
        "Where can I find a spectacular outdoor dining spot with a view of the river?",
        "Do you know if Huddle House serves breakfast all day or if they have specific hours for it?",
        "Do you know of any Italian restaurants with outdoor seating and a view within walking distance of Alfred Coffee?",
        "Can you recommend any five-star rated brunch spots in the area?",
        "Can you recommend a terrific café that allows BYOB?",
        "Find a place with live music and a 4-star rating for dinner tonight",
        "Where can I find a good Italian restaurant around here?",
        "I'm craving some good sushi, where can I find a place with high ratings?",
        "Where can I find value for money food options nearby?",
        "I'm craving some sushi, is there a place nearby with all-you-can-eat pricing?",
        "can you recommend any Nearby Italian restaurants with a patio?",
        "I'm craving some authentic Italian cuisine, any suggestions for a good Italian restaurant nearby?",
        "I'm craving some Korean barbecue, where can I find a good place for it?",
        "Find me a Spanish restaurant open on Wednesday night",
        "I'm craving a Big Mac, where is the nearest McDonald's?",
        "I'm looking for a restaurant in the vicinity of Downtown Diner with a high rating",
        "I'm craving some Indian food, where can I find a highly rated restaurant in this area?",
        "I want to try some authentic Italian food, any recommendations?",
        "What are the operating hours for the best seafood restaurant in town?",
        "I'm craving sushi, where's the best place to get it in this area?",
        "where is the closest bakery counter",
        "what type of cuisine does The Coffee House offer?",
        "I'm looking for a place with outdoor seating and a good happy hour deal. Any recommendations?",
        "I'm craving some Southern comfort food, where can I find a place with affordable prices?",
        "I'm craving some Greek food, where can I find a good Greek restaurant around here",
        "Can you recommend a popular choice for a restaurant that offers gluten-free options?",
        "I'm looking for a budget-friendly restaurant with a vegan menu, any suggestions?",
        "Can you recommend a place with a good selection of vegetarian dishes and a patio?",
        "Where can I find a place serving halal cuisine around here?",
        "which restaurant has the best view of the city and is open late",
        "Do you know any French places with a good happy hour deal?",
        "I'm craving some authentic Italian cuisine, where can I find a good Italian restaurant open late?",
        "Do you know of any restaurants in New York City with a New American cuisine menu",
        "I'm in the mood for some sushi, can you recommend a top-ranked Japanese restaurant?",
        "Do you know of any restaurants that serve veggie burgers for under $15?",
        "recommend a budget-friendly steakhouse with a good wine selection",
        "Which restaurant in Las Vegas has the best ratings for Mexican cuisine?",
        "What are some highly rated Italian restaurants in the area according to Zagat",
        "I'm looking for a restaurant that offers a family pack meal",
        "Can you recommend a restaurant with a great outdoor seating area?",
        "I'm craving Korean food, where can I find a bargain for a family-friendly section?",
        "Can you recommend a highly rated seafood restaurant in City ?",
        "I'm craving a healthy breakfast, where can I get a delicious granola bowl?",
        "What's a popular Mexican restaurant with outdoor seating for dinner?",
        "Can you recommend the best-reviewed Italian restaurant in the suburban area?",
        "I'm craving sushi, where's a good Japanese place nearby?",
        "Is there a highly rated café nearby with outdoor seating?",
        "I'm looking for some Breakfast economic choices around here",
        "Can you recommend a good restaurant with a diverse menu and a great ambiance for under 30 dollars a plate?",
        "I'm looking for a place for night time dining with good seafood, any suggestions?",
        "Do you know of any vegan-friendly restaurants with wifi in the downtown area?",
        "What is the best Italian restaurant in the suburbs with outdoor seating",
        "Can you suggest a restaurant with a diverse cuisine options that is open late?",
        "Can you recommend any restaurants in Atlanta that offer not too expensive late night dining?",
        "Hey, can you recommend a place for a special occasion dinner with a view of the water?",
        "What are the hours for the Italian restaurant in the shopping center?",
        "I'm looking for a restaurant with a chocolate fountain for a special occasion, can you recommend one?",
        "What are the operating hours of the nearest seafood restaurant?",
        "Do you know any restaurants with afternoon opening hours and lobster rolls on the menu?",
        "I'm craving a cheesesteak from Cheesesteak Central Food Truck , where is it located right now?",
        "What are the hours of operation for the nearest burger joint?",
        "I'm craving a fine dining experience, can you suggest a restaurant like Per Se?",
        "What are the hours of operation for the nearest sushi place?",
        "I'm looking for a restaurant with outdoor seating area that serves vegetarian dishes.",
        "I'm looking for an inexpensive restaurant with group discounts.",
        "What is the best Italian restaurant in this area according to reviews?",
        "I'm looking for a reasonably priced Lebanese restaurant with high ratings for dinner tonight.",
        "Where can I find good value for money restaurants in this area?",
        "show me the highest rated Lebanese restaurants in the area",
        "Can you recommend a restaurant with handicap accessibility for dinner tonight?",
        "What are the top-rated Indian restaurants in the city center?",
        "Can you recommend any budget-friendly late night dining options nearby?",
        "What restaurants with an OpenTable rating of 4 stars or above are open past midnight?",
        "Can you recommend any highly acclaimed lunch places nearby?",
        "Do you know of any Spanish restaurants with a prix fixe menu for dinner?",
        "I'm craving something sweet, can you recommend a place with the best croissants in town?",
        "I'm looking for a restaurant with a good rating and outdoor seating in the downtown area.",
        "I'm looking for a fancy place to have an expensive dinner tonight",
        "I'm craving some Italian cuisine, can you recommend a restaurant nearby?",
        "I'm looking for some expensive brunch restaurants in the area, any recommendations?",
        "Can you recommend a Lebanese restaurant that uses local ingredients for their dishes?",
        "Which restaurant around here has a good happy hour menu?",
        "I'm in the mood for some tacos, can you find the nearest Taco Bell for me?",
        "I'm looking for a place downtown with valet parking and an impressive menu.",
        "I'm craving sushi. Is there a place with a high rating in this area?",
        "I'm looking for a cozy place with affordable prices for dinner tonight",
        "Is there any restaurant nearby with live music tonight?",
        "I'm craving avocado toast, is there a Bluestone Lane in the area?",
        "I'm in the mood for some upscale dining tonight, where can I find a reservation at Blue Hill at Stone Barns?",
        "I want to take my friends out for a nice barbecue dinner, but I don't want to spend too much. Any suggestions?",
        "I'm looking for a restaurant with a Michelin star in the downtown area with bar service hours.",
        "What are the opening hours for the Japanese restaurant downtown?",
        "Is there a highly rated restaurant that offers both patio seating and good value for money?",
        "What's the best nighttime noshery in the area?",
        "Can you recommend a place that serves a good cheeseburger?",
        "What are the best vegetarian dishes at Five Guys ?",
        "Can you recommend a farm-to-table restaurant on the map?",
        "I'm looking for a restaurant with a steeper price range, any recommendations?",
        "I'm craving some barbecue, can you recommend a good restaurant nearby?",
        "Can you recommend any mid-priced late night restaurants in the area?",
        "I'm craving for some authentic Italian pasta, is there a place nearby?",
        "Can you recommend a low-cost place with extended hours that serves Toby's Estate Coffee?",
        "I'm craving some authentic Italian cuisine, where can I find a good spot for that?",
        "what are the hours of operation for Eleven Madison Park",
        "Where can I find the best pho soup in town?",
        "What are the closing hours for Block restaurant?",
        "What are the operating hours for Italian restaurant Scott's Trattoria?",
        "I need a quiet place for brunch within a reasonable price range",
        "Do you know any restaurants that offer meal deals for dinner tonight?",
        "I'm craving a dish with spicy flavors, can you recommend a restaurant that serves spicy food?",
        "What time does Domino's Pizza close tonight?",
        "Do you know any restaurants with outdoor seating and a kids menu?",
        "Can you recommend a good reviews café in the downtown area?",
        "Which burger joint has the highest rating in this area?",
        "What time does TGI Fridays close tonight?",
        "Can you recommend any restaurants nearby that have a great selection of sandwiches",
        "Can you recommend a restaurant with good value for The Halal Food Cart?",
        "Which restaurant has the most affordable prices for a plate of pho soup?",
        "Where is the nearest location of The Cheesecake Factory?",
        "I'm craving for some authentic Italian cuisine, where can I find a place with a good wine selection?",
        "where can I get the best sushi in town",
        "Do you know any brunch packages in the area?",
        "What's the best spot for brunch with bottomless mimosas in this area?",
        "What's the best restaurant in town that offers a chocolate fountain dessert?",
        "I'm craving a fancy steak dinner, can you recommend The Capital Grille?",
        "Can you make a reservation at Blue Hill at Stone Barns for 7 pm tonight?",
        "I'm craving some spicy food, where can I find a restaurant with authentic Wendy's cuisine?",
        "What are the hours of operation for a budget-friendly Indian restaurant near me?",
        "I'm in the mood for some delicious pastries, where can I find a top-notch café around here?",
        "What are the restaurant options with vegan dishes and outdoor seating?",
        "Can you recommend a Bargain sushi restaurant near me?",
        "I'm craving some authentic Mexican cuisine, where can I find a restaurant with reasonable prices and good reviews?",
        "Can you recommend a barbecue restaurant with a good rating in the downtown area?",
        "What's the highest-rated seafood restaurant with outdoor seating and a view of the ocean?",
        "I want to take my date somewhere excellent. Can you recommend a restaurant?",
        "Can you recommend any affordable options for Italian food with outdoor seating?",
        "I'm craving some good fried chicken, where's the nearest restaurant with a takeout window?",
        "Is there a nearby place with a good rating for seafood dishes?",
        "I'm craving some tacos, where can I find a good taqueria in this area",
        "I'm a vegetarian, do you have any recommendations for a good veggie burger in the area?",
        "I'm in the mood for some authentic sushi. Where's the best Japanese restaurant in town?",
        "What are the opening hours of the nearest Thai restaurant?",
        "Recommend a place with outdoor seating and a good view of the city skyline",
        "Where can I find a restaurant with good value for money in the area?",
        "What type of cuisine does Noma specialize in?",
        "I'm looking for a burger joint open past midnight",
        "What's the best sushi place in town with a high rating?",
        "What are the popular late-night restaurant reviews in this area?",
        "I'm looking for a family-friendly restaurant with a kids' menu for dinner on Wednesday",
        "Can you recommend a seafood restaurant with a waterfront view?",
        "What time does the Italian restaurant in downtown open for dinner?",
        "Can you recommend a restaurant with Korean barbecue for dinner tonight?",
        "Do you know if the reservation system is working at that new Italian restaurant downtown?",
        "Synthetic Query: \"I'm craving some authentic Italian food, where can I find a good place?\"",
        "What's the best Italian restaurant in the area with affordable prices?",
        "can you suggest a place to dine at L'Atelier de Joël Robuchon with a high rating",
        "I'm craving sushi, is there a good Japanese restaurant nearby?",
        "Can you recommend a nearby Italian restaurant with a rating above 4 stars?",
        "What time do you close?",
        "I need a reservation for a family dinner at an Italian restaurant with a kids menu",
        "Hey, I'm looking for a vegan restaurant in the Urban area, can you recommend one?",
        "Where is the closest Indian restaurant with vegetarian options?",
        "Can you recommend a good barbecue restaurant near Texas Roadhouse with outdoor seating?",
        "What are some sushi places with outdoor seating and vegan options?",
        "Do you know any restaurants near Eleven Madison Park that are open for dinner?",
        "I'm in the mood for some French cuisine, where can I find a good French restaurant in the area?",
        "recommend a place with outdoor seating for brunch",
        "Where can I find a restaurant with the best mussels in town?",
        "What are the operating hours of the nearest Italian restaurant?",
        "I need a restaurant with outdoor seating in a romantic setting",
        "Recommend a place for a fancy dinner with a seafood menu within walking distance.",
        "What's a highly rated restaurant in this area where I can enjoy a nice steak dinner?",
        "What's the best Italian restaurant in the area and what are their hours?",
        "Do you know of any Breakfast Clubhouse in the area that opens early?",
        "Find me a restaurant with a patio and outdoor seating, I prefer Italian cuisine.",
        "What are the top Italian restaurants in the area",
        "I'm looking for a vegan-friendly place. How about The Bean Counter Bistro?",
        "Can you recommend a restaurant with a Senior Citizen Discount and good seafood options?",
        "Can you recommend an outstanding food truck in the area?",
        "Which restaurant serves the best sushi in the city and is open late on weekends?",
        "I'm looking for a brunch place with good food and reasonable prices. Any recommendations?",
        "Can you recommend a bar with a great selection of appetizers?"
    ]
}