{
    "not-allowed-entity-type": [
        "I'm looking for a fancy breakfast spot that offers vegetarian options",
        "where can I find a high-end restaurant serving vegetarian breakfast",
        "recommend a luxurious place for a vegetarian morning meal",
        "Can you recommend a Spanish restaurant with upscale and elegant ambience for dinner tonight?",
        "I'm looking for a formal restaurant that serves biscuits and gravy for breakfast",
        "I need to find a breakfast spot with a formal setting that offers biscuits and gravy",
        "Can you recommend a trendy fine dining restaurant with a low-carb menu in the suburbs?",
        "I'm looking for a fine dining restaurant with a trendy atmosphere and a low-carb menu in the suburbs, any recommendations?",
        "Where in the suburbs can I find a fine dining restaurant with a trendy ambience and a low-carb menu?",
        "Where can I find a food truck serving Mexican cuisine for lunch?",
        "I'm looking for a nearby food truck with a good rating and affordable prices for a quick dinner after work.",
        "I need to grab a snack from a food truck before my evening meeting. Any recommendations close by?",
        "I'm looking for a fancy restaurant with waterfront views that serves a delicious breakfast",
        "Can you recommend an upscale place with a breakfast menu and a beautiful waterfront location?",
        "I want to have a luxurious breakfast with a view of the water, can you suggest a restaurant?",
        "I'm looking for a mid-range restaurant with low-carb options that also has a playground for kids.",
        "Where can I find a fast food restaurant with low-carb options and a mid-range price range that also offers nutrition information?",
        "I'm looking for a place with a low-carb brunch menu and a nice bar/lounge area",
        "Where can I find a restaurant with a low-carb brunch and a bar/lounge area?",
        "I need a recommendation for a brunch place with a bar/lounge area that offers low-carb options",
        "Can you recommend any buffet restaurants for pescatarians near The World's 50 Best Restaurants?",
        "What are the buffet options for pescatarians at Shoney's?",
        "I'm looking for a buffet restaurant suitable for pescatarians within walking distance of The World's 50 Best Restaurants.",
        "Where can I find a waterfront restaurant offering a buffet for a 50-year-old male doctor?",
        "I'm looking for a fancy outdoor dining experience near Atomix. What are the options?",
        "I'm craving some fast food for dinner, can you recommend a restaurant with delivery service?",
        "I need to order a fine dining meal for delivery tonight, do you have any suggestions?",
        "Where can I find a delivery service that offers fast food options for a quick lunch?",
        "Can you recommend a budget-friendly breakfast spot near Parkside Diner?",
        "Where can I grab a quick breakfast on a college campus with early hours?",
        "I'm in the mood for some vegan options from a food truck. Do you know any Gourmet Grub spots nearby?",
        "Where can I find a vegan-friendly food truck with a bar counter for a quick bite?",
        "I'm craving some vegan BBQ on Wheels. Any recommendations for a food truck serving that?",
        "I'm looking for a classy café with a wheelchair-accessible entrance and a great margherita pizza for a group of business professionals in their 50s.",
        "Can you recommend a Korean restaurant in the vicinity that serves halal lunch?",
        "Where can I find a halal Korean restaurant for lunch around here?",
        "What food trucks around here serve barbecue grill?",
        "Which food truck offers barbecue grill dishes in the area?",
        "I want to try some barbecue grill from a food truck, do you know any nearby?",
        "Can you recommend a restaurant with upscale breakfast options like a breakfast wrap?",
        "I'm looking for a trendy spot with wheelchair accessibility for a chic breakfast downtown",
        "Where can I find a hip restaurant with wheelchair accessibility for breakfast near my retail job?",
        "Can you recommend a cool place with wheelchair accessibility for a modern breakfast in this area?",
        "Can you recommend a cozy restaurant with a brunch menu",
        "I'm looking for a charming place to have brunch around here",
        "Where can I find a rustic restaurant that serves brunch",
        "I'm looking for a Lebanese restaurant in the upscale price range that serves low-carb brunch",
        "Where can I find an upscale Lebanese restaurant offering low-carb brunch options?",
        "Where can I find a brunch place with a tasting menu in the late morning",
        "Which restaurant has a tasting menu for brunch around late morning",
        "Can you recommend a place with a tasting menu for brunch around late morning",
        "I'm looking for a café with outdoor seating and a good brunch menu",
        "Can you recommend a restaurant with a good happy hour deal for lunch?",
        "I'm looking for a late night buffet with a dessert bar for a gluten-free meal",
        "What's the best gluten-free buffet restaurant in the area with a dessert bar?",
        "Find me a restaurant with a gluten-free late night buffet and a wide variety of dessert options",
        "Can you recommend a Lebanese restaurant with an urban/chic ambience for a doctor in his 30s for lunch?",
        "I'm looking for a quality-approved Italian restaurant with a chic atmosphere for a 30-something male doctor. Any suggestions for lunch?",
        "Where can I find an Italian restaurant that is popular among professionals in their 30s and has a chic urban ambience for lunch?",
        "Can you recommend a highly rated gourmet restaurant with a waterfront ambience for dinner on Thursday?",
        "Can you recommend a trendy restaurant for dinner near Chez Panisse?",
        "I'm looking for a trendy restaurant with a dinner menu around Chez Panisse",
        "where can I have a fancy dinner with a view tonight",
        "I'm looking for a chic place to have a fine dining experience with a cocktail bar. Do you have any suggestions?",
        "I'm in the mood for an upscale and elegant Japanese restaurant for a paleo-friendly lunch",
        "Can you recommend an elegant lunch spot with paleo options, maybe a PF Chang's location?",
        "Where can I find a fancy Japanese restaurant in the area that serves paleo-friendly dishes for lunch?",
        "Can you recommend a fine dining restaurant that offers gluten-free options?",
        "I'm looking for a high-end restaurant with a gluten-free menu, do you have any suggestions?",
        "recommend a rustic buffet restaurant with halal options in the area",
        "find me a buffet place with a rustic atmosphere serving halal food",
        "I'm looking for a restaurant with a buffet that offers halal dishes and has a rustic vibe",
        "Can you recommend an outstanding fast food restaurant with low-carb options in the downtown area?",
        "What outstanding fast food restaurant in the city serves low-carb meals and has a high rating?",
        "I'm looking for an outstanding fast food restaurant that offers low-carb dishes, where can I find one?",
        "I'm looking for a place with early bird specials for dinner",
        "Where is the nearest Chili's Grill & Bar for dinner tonight?",
        "I'm looking for a restaurant with outdoor seating and a good lunch menu near the waterfront",
        "Can you recommend a place with vegetarian options for lunch and a 4-star rating?",
        "Can you recommend any fine dining restaurants with gluten-free options and a business center?",
        "Can you recommend a budget-friendly restaurant with a buffet for a 35-year-old male construction worker?",
        "Can you recommend a restaurant with good lunch meal deals for delivery?",
        "I'm looking for a place with affordable lunch options for delivery. Any recommendations?",
        "I'm looking for a restaurant with parking that offers happy hour specials for dinner",
        "Where can I find a restaurant with margherita pizza and fajitas for dinner",
        "I need a recommendation for a dinner place with good margherita pizza and fajitas and a parking lot",
        "I'm a male doctor in my 30s looking for a sushi place with affordable prices and a relaxed atmosphere for dinner. Any recommendations?",
        "I'm looking for a top-notch buffet restaurant that offers vegetarian options and delivery service.",
        "I'm craving a low-carb dinner, any suggestions for a restaurant with Margherita pizza?",
        "can you recommend a private dining spot for an elegant lunch",
        "where can I find an upscale restaurant with french cuisine for a senior lady's lunch",
        "show me the nearest elegant restaurant, maybe La Petite Creperie, for a retired woman's lunch",
        "Can you recommend a cozy and intimate restaurant with a bar that serves lunch?",
        "I'm looking for a late-night dining spot with a cozy ambience that serves lunch.",
        "Find me a restaurant with a bar and a cozy atmosphere for a lunch meeting.",
        "I'm looking for a cost-efficient buffet restaurant with WiFi that serves paleo-friendly dishes",
        "Can you recommend a budget-friendly buffet place with WiFi that offers paleo options",
        "Where can I find a buffet restaurant that is affordable, has WiFi, and accommodates paleo diets?",
        "I'm looking for a restaurant that offers inexpensive late-night dining options, can you recommend one?",
        "Can you recommend a food truck with patio seating for a dine-in meal?",
        "I'm looking for a food truck with patio seating that offers dine-in options. Any suggestions?",
        "Is there a food truck around here that has patio seating for dine-in meals?",
        "Can you recommend any Chinese restaurants with paleo options for dinner?",
        "Where can I find a restaurant for dinner that offers paleo-friendly options and also serves afternoon tea?"
    ],
    "entity-not-found": [
        "find a mid-range Middle Eastern restaurant with a good wine selection",
        "Which restaurants in the area offer a breakfast menu with luxurious options?",
        "I'm looking for a restaurant with upscale ambience and dinner hours serving Spanish cuisine.",
        "Can you recommend a fine dining restaurant with gourmet cuisine?",
        "I'm looking for a fine dining restaurant known for its gourmet dishes",
        "I'm looking for a popular café with outdoor seating in San Francisco for a business meeting",
        "What food trucks in Denver have a high rating for their cuisine?",
        "Which food trucks around here are known for their Mexican cuisine?",
        "I'm looking for a brunch & munch place that won't break the bank. Any suggestions?",
        "Can you recommend a restaurant around the corner with live music during lunchtime?",
        "Can you recommend any restaurants open late on Thursday with superb dinner options?",
        "I need a brunch spot near my workplace, preferably with a good rating",
        "Where can I find an upscale café with a smoking area and wheelchair-accessible entrance, perfect for a business owner in his 50s, for a luxurious dining experience?",
        "I'm looking for a luxurious dining experience, do you know of any high-end haul food trucks nearby",
        "I'm looking for a quirky late-night dining spot. Any suggestions?",
        "What are the nearest Italian restaurants open for dinner?",
        "I'm looking for a late-night restaurant with vegan options, preferably close by",
        "Where can I find an upscale restaurant that specializes in breakfast wraps?",
        "What's a good place for a quick bite to eat, maybe a trendy café with a cozy atmosphere?",
        "Can you recommend any Asian food trucks close by that serve Vietnamese cuisine?",
        "I'm craving some fish and chips, where can I get a discounted meal in the fast food category?",
        "Is there a restaurant nearby that offers a buffet option for vegetarians?",
        "I want to have a traditional English breakfast delivered to my hotel, where can I find a place that offers this?",
        "Do you know a café that is wheelchair-accessible and has a peaceful atmosphere, as well as dairy-free options?",
        "Do you know of any upscale cafés that offer an express lunch menu",
        "Can you recommend a low-cost fine dining restaurant for late-night American cuisine?",
        "I'm looking for a late-night dining option for American cuisine with a fine dining ambience that won't break the bank.",
        "Where can I find a wheelchair-accessible café with mid-range prices?",
        "can you recommend a brunch place that allows pets on their patio",
        "what are the top-rated cafés in downtown with free Wi-Fi?",
        "Can you recommend a place with a good rating that serves gluten-free food late at night?",
        "Can you recommend a cool and trendy fast food spot, maybe like Five Guys?",
        "Can you recommend a Vietnamese restaurant in Portland with vegetarian lunch options",
        "Which quirky and eccentric restaurant serves the best bagels for brunch",
        "Which restaurant serves gourmet sandwiches for a five-star lunch experience?",
        "I'm looking for a five-star lunch place that offers a prix fixe menu.",
        "Can you recommend a high-end restaurant with a great breakfast menu for the morning shift?",
        "Can you recommend a breakfast place with WiFi where I can have a business meeting with a client?",
        "I'm looking for a breakfast spot with WiFi that has a cozy atmosphere and is within a 10-minute walk from my office",
        "I'm craving some Asian cuisine, where can I find a buffet place open until 10 p.m.?",
        "Can you recommend a buffet restaurant with a kid-friendly atmosphere that opens for lunch?",
        "do you know any casual cafés around here that offer tasting menus",
        "show me fast food restaurants with chef's specials",
        "recommend a fast food restaurant with chef's specials",
        "Where can I find a top-notch fine dining restaurant that caters to gluten-free diners?",
        "I'm craving some vegan paella. Is there a food truck nearby that serves it?",
        "I'm looking for a peaceful lunch spot with Caribbean food in Nashville that's popular among young adults. Any suggestions?",
        "Where can I find a quiet lunch place serving Caribbean cuisine that's popular with female students in Nashville on Fridays?",
        "What is the lunch menu at Yard House on the West side?",
        "I'm looking for a cheap lunch spot near Yard House, any suggestions?",
        "What are some brunch spots that serve acai bowls and are known for their cozy ambiance?",
        "I'm looking for a restaurant that offers healthy options for brunch, particularly acai bowls.",
        "I need to find a place for dinner that is gluten-free and offers takeout.",
        "I'm looking for a mid-range restaurant in Seattle that serves American brunch with cocktails",
        "I'm looking for high-priced food truck fare in the area, can you recommend one?",
        "I'm a teacher in my mid-thirties and I'd like to find a café with a diverse menu that includes Chipotle dishes. Any suggestions?",
        "I'm craving a late-night meal with a fast-casual vibe, where can I find some Texas Roadhouse around here?",
        "I need to grab some late-night food, do you know if there's a fast-casual spot like P.F. Chang's nearby?",
        "Is there a place near P.F. Chang's where I can get a hearty meal after my construction shift ends at 10 pm?",
        "I need to grab some food on the go, is there a Dunkin' Donuts with a drive-thru?",
        "I'm in the mood for some fast food, where can I find a place with gourmet burgers?",
        "I want to grab a quick bite, where can I get some high-end tacos in this area?",
        "I need to find a place for a fancy fast food meal, where can I get some upscale chicken sandwiches?",
        "can you recommend a buffet restaurant with gourmet options that won't break the bank",
        "I'm craving some late-night Indian cuisine with a rustic ambience, can you recommend any restaurants?",
        "I'm looking for a fine dining restaurant with a high OpenTable rating that serves Chinese and French cuisine.",
        "Which fine dining restaurant nearby offers gluten-free options and specializes in Chinese and French cuisine?",
        "I'm craving sushi. Is there a highly rated sushi bar with a view near downtown?",
        "I'm looking for a place with a buffet that's good for a 35-year-old construction worker and won't break the bank.",
        "Where can I find a buffet that's suitable for a 35-year-old construction worker without spending too much?",
        "Can you recommend a restaurant with an oceanview buffet?",
        "Where can I find a critic-recommended restaurant with a buffet offering?",
        "which restaurant offers breakfast tasting menus with affordable prices and business hours",
        "Is there a restaurant that offers lunch meal deals and delivers in the area?",
        "Where can I find a buffet restaurant that delivers and serves vegetarian dishes, like Old Country Buffet?",
        "Where can I find a buffet restaurant with Greek cuisine and a lounge/bar atmosphere that won't break the bank?",
        "I need a breakfast spot that caters to a construction worker like me and stays open late",
        "Where can I find a restaurant with a breakfast menu that's open late, and also has a good rating?",
        "Can you recommend a restaurant with delicious ribs and a rustic, charming atmosphere for dinner?",
        "What quality cafés around here offer tasting menus?",
        "Where can I find a café with high-quality tasting menus nearby?",
        "Can you recommend a buffet restaurant in Paris with a chic urban ambience and paleo options",
        "I'm looking for a Mediterranean restaurant in Paris with a buffet and a chic urban atmosphere",
        "Where can I find BBQ ribs in Paris with a chic urban atmosphere and a buffet option for paleo eaters",
        "Can you recommend a restaurant with a drive-thru that operates during lunch hours in the city center?",
        "which nearby café offers takeout for coffee and pastries",
        "Where can I find a restaurant that offers waffles as part of their brunch menu on Tuesday mornings?",
        "which restaurants around here serve late-night Chinese dishes and deliver?",
        "Where can I have a fine dining experience with a romantic ambience and a view of the mountains?",
        "I'm looking for a restaurant with a buffet and bottomless mimosas that won't break the bank. Do you have any suggestions?",
        "Which restaurant around here offers breakfast at a reasonable price",
        "Where can I find a Mexican restaurant with vegetarian options for dinner?",
        "What are the top-rated restaurants with a late-night dining menu for families?"
    ],
    "entity-not-found-overlap": [
        "find me a place with a fantastic breakfast value and private dining",
        "I'm looking for a place with lunch specials and a great happy hour menu, do you have any suggestions?",
        "Find me a restaurant with lunch options and a happy hour that starts before 3 pm",
        "what time does The Bagel Barn open for brunch",
        "I'm looking for a pocket-friendly restaurant with buffet serving hours"
    ],
    "low-logprob": [
        "Can you recommend a trendy food truck in Downtown with a diverse menu?",
        "I am craving some authentic Italian cuisine. Can you recommend any fine dining restaurants nearby?",
        "What is the best superior café in the downtown area for breakfast?",
        "What fast food restaurants are open past midnight in the downtown area",
        "What are the hours of operation for halal fast food restaurants in this area?",
        "I want to have a nice lunch with a friend, can you recommend any LongHorn Steakhouse with high ratings",
        "which restaurants have a good reputation for their Saturday morning brunch",
        "Can you recommend a high-rated French restaurant with outdoor seating?",
        "I'm craving some late-night sushi roll, can you recommend a place?",
        "I'm looking for an upscale buffet restaurant nearby, any suggestions?",
        "I'm looking for a buffet restaurant with decadent vegetarian options for dinner",
        "Which restaurant in the area has a good reputation for their brunch menu?",
        "I'm looking for a place with a superb brunch, where can I find one with affordable prices?",
        "I want to grab a quick bite that's not too pricy, can you locate a fast food place for me?",
        "Can you recommend a fast-food place with Thai cuisine and discounted items for a middle-aged accountant like me?",
        "Can you recommend a budget-friendly sushi restaurant with good ratings for dinner tonight?",
        "Can you recommend a Korean restaurant with good ratings for dinner on Thursday evening?",
        "what's the best place for a buffet lunch in the downtown area",
        "Can you recommend an Italian restaurant with budget-friendly lunch options?",
        "I want to try something new, where can I find a customer favorite food truck for lunch?",
        "Can you recommend a beachfront restaurant with a great brunch menu for this morning?",
        "I'm looking for a café with a cozy atmosphere and good coffee in the downtown area",
        "What's the best café for brunch hours in the downtown area?",
        "Where can I find a café with a mid-range price range for a quick bite?",
        "I'm looking for a budget-friendly place that serves delicious waffles in the morning",
        "Where can I find a restaurant offering waterfront views and a mid-range price range, specializing in Mediterranean cuisine for late-night dining?",
        "I'm in the mood for some fast food burgers, where can I find a food truck around here?",
        "What are some outstanding lunch establishments with a 5-star rating and a moderate price range?",
        "Can you recommend a trendy café around here for brunch?",
        "Can you recommend a good Italian buffet restaurant in the area for those with a dairy-free diet",
        "Can you recommend a Spanish restaurant that serves late-night tapas?",
        "Is there a Chinese restaurant nearby known for their excellent brunch menu and vegan-friendly dishes?",
        "I want to order brunch for delivery from a restaurant that offers all-day breakfast and outdoor seating.",
        "Can you recommend an excellent breakfast spot nearby?",
        "Can you recommend a café in the downtown zone with a high rating?",
        "Can you recommend a place for late-night dining with a good steak menu",
        "I'm craving some brunch, where can I find a good place for eggs benedict?",
        "which vegan café has the highest rating",
        "Where can I find a place by the beach that offers a morning brunch with a beautiful view?",
        "can you recommend a place for late-night dining that serves delicious pho soup",
        "Where can I get some mouth-watering takeout lobster rolls from a food truck here?",
        "What time does McDonald's open for breakfast?",
        "I need to find a dinner place with paleo options, preferably a Michelin star Italian restaurant with weekend hours.",
        "As a 50-year-old male doctor, I'm looking for a food truck with drive-thru service. Any suggestions near Big Mama's BBQ?",
        "What's the best Italian restaurant in the area for dinner?",
        "I need a reservation at a gourmet restaurant that offers early bird specials",
        "I need a reservation for a high-end restaurant serving gluten-free dishes tonight.",
        "I'm looking for a place with a diverse buffet menu including vegetarian options",
        "I'm craving some pancakes, is there a place nearby that serves breakfast besides Sunrise Diner?",
        "Could you recommend an upscale buffet with operating hours past 9pm?",
        "I'm looking for a budget-friendly Moroccan buffet place, do you have any suggestions?",
        "I'm looking for a mid-range priced restaurant with exquisite fine dining options on the west side",
        "Can you recommend a restaurant with unbeatable brunch options and outdoor seating?",
        "Where can I find an Italian buffet with a dairy-free menu and great cocktails",
        "Can you recommend a restaurant with a wide selection of seafood dishes for dinner tonight?",
        "where can I have a private breakfast meeting",
        "I'm in the mood for Flapjack Frenzy, where can I find it?",
        "Can you recommend a restaurant with a good wine selection for dinner tonight?",
        "I'm craving some casual fast food, can you suggest a place?",
        "Are there any waterfront restaurants known for their popular brunch destinations",
        "I want to try some Indian cuisine for lunch, can you suggest a highly-rated place nearby?",
        "What are the hours of operation for a highly recommended café in San Francisco?",
        "which buffet restaurant near me has a high rating",
        "Where can I find some affordable late-night dining options with a diverse menu?",
        "What's the nearest place that offers a takeout buffet for lunch?",
        "Can you recommend a Chicago brunch spot with outdoor seating and a high rating?",
        "Can you recommend a fast food restaurant near me that offers dinner service and has a drive-thru?",
        "Where can I find a buffet restaurant with a delicious fruit platter and affordable prices",
        "What's the best spot for affordable tacos and coffee in a café around here?",
        "suggest a dinner spot with exquisite cuisine and a modest price",
        "What's the best fast food place in the area for a quick dine-in meal?",
        "Where can I find a waterfront café with halal dishes at an affordable price?",
        "I'm craving some fast food, where can I get a gourmet burger in this area?",
        "I'm craving late-night dining with a waterfront view, can you recommend any restaurants?",
        "find me a café with free Wi-Fi and good food in the area",
        "Can you recommend any restaurants with waterfront views for dinner tonight?",
        "Can you recommend the most popular café with a cozy ambience?",
        "find me a Michelin Guide recommended upscale food truck nearby",
        "I'm looking for a casual place for lunch near Ruth's Chris Steak House",
        "where can I find affordable late-night dining in the area",
        "where is the nearest food truck with an impressive menu",
        "Where can I find a buffet restaurant with affordable prices in this area?",
        "Can you recommend a critically acclaimed restaurant with a romantic ambiance that serves Italian cuisine in the downtown area for dinner?",
        "I'm looking for a place with a weekend buffet serving Korean food, can you help?",
        "which brunch spot in Los Angeles has affordable prices",
        "Where can I find a food truck with outdoor seating and chef's specials?",
        "Where can I find the nearest fast food restaurant with a drive-thru?",
        "Can you recommend a good Italian restaurant with outdoor seating for dinner tonight?",
        "Find a high-end buffet restaurant in the Kings Buffet region",
        "I'm in the mood for some Thai food, where can I find a fast-food restaurant with discounted items nearby?",
        "I'm looking for a waterfront restaurant with good deals for lunch.",
        "I'm looking for a fast food place open after-hours",
        "Can you recommend a rustic restaurant with a cozy atmosphere that serves delicious French toast for breakfast?",
        "I'm looking for a mid-range sushi place in Sydney with a last call for dinner.",
        "I'm looking for a buffet restaurant with a $35 budget, what are the operation hours?",
        "I'm craving a delicious steak for a late-night dinner, can you suggest a nearby restaurant",
        "Can you recommend a restaurant with a pet-friendly patio for lunch?",
        "I'm craving fast food, where can I find a Carl's Jr. nearby?",
        "I need a place with highly recommended happy hours and inexpensive lunch options for today",
        "What are the operating hours of the seafood café near the waterfront?",
        "Can you recommend a trendy lunch spot around here, maybe Carrabba's Italian Grill?",
        "I'm craving some cheap burgers, where can I get a good deal",
        "where can I find a locale with a buffet breakfast",
        "Can you recommend a highly recommended café in San Francisco?",
        "I'm craving a healthy brunch, where can I find the best granola in town?",
        "Can you recommend any buffet restaurants that offer dine-in service?",
        "what's the best buffet place in the city for a doctor in his 30s",
        "Where can I find a restaurant around here that serves a vegetarian buffet during lunchtime?",
        "I'm craving pancakes and a mimosa, is there a restaurant bar nearby that offers them for breakfast?",
        "I'm looking for a cozy mid-range café with an upscale price range that serves brunch nearby.",
        "Can you recommend a fine dining restaurant with a great wine selection that has received the Wine Spectator Award of Excellence?",
        "Can you recommend a low-cost dinner place in Vancouver?",
        "I'm looking for a place to have a quick lunch with some sushi",
        "What are some nearby fast food options for a meal deal",
        "Can you recommend a fine dining restaurant with a pricy buffet?",
        "Do you know any waterfront restaurants with a good brunch menu?",
        "do you know any pet-friendly cafes with high customer satisfaction",
        "I'm looking for a highly-rated restaurant known for its upscale atmosphere and French cuisine to have dinner tonight.",
        "I'm craving some Dollar Fries, where's the nearest fast food joint?",
        "I'm looking for a café with weekend hours and special discounts",
        "Where is the nearest restaurant with a gluten-free menu that's open late?",
        "Where can I find waterfront restaurants open past midnight for a late-night meal?",
        "I'm looking for a fine dining restaurant with a lounge/bar ambience",
        "Where can I find a fast food restaurant with a good beverage station?",
        "I'm craving some specialty coffee, can you recommend an espresso bar in the area?",
        "Where can I find an upscale restaurant with outdoor seating and a buffet option?",
        "I'm looking for a beachfront or waterfront restaurant with late-night dining options",
        "Can you recommend a Mexican restaurant with a good lunch menu and affordable prices?",
        "I'm looking for a café that serves steak. Any recommendations for late-night dining?",
        "Can you recommend a place with great deals for breakfast and excellent scones?",
        "Can you recommend a romantic lunch place around Panera Bread that serves Italian cuisine?",
        "I'm looking for a café with vegan options for lunch",
        "Any suggestions for a unique café with an outdoor terrace in London that would appeal to a 45-year-old businessman?",
        "what's a good place with vegan options that's open past midnight",
        "I'm looking for a lunch spot with good vegetarian options in Portland",
        "can you recommend a good brunch place nearby",
        "I'm looking for a café that offers a variety of options for brunch in the downtown area",
        "what's a good café for tasting menus",
        "can you recommend a café on Yelp with dairy-free options for dine-in",
        "can you recommend a quarters café with mid-range prices?",
        "Where can I grab a croissant for breakfast at a local fast-casual spot?",
        "Can you recommend a halal-friendly buffet restaurant with reasonable prices?",
        "I need a place for dinner with a private dining room that has a romantic atmosphere and is within a moderate price range",
        "What are some high-end restaurants in Tokyo offering French cuisine for dinner",
        "I'm craving a good steak for dinner at a cozy café",
        "which restaurant has a high rating for late-night dining",
        "What are some affordable French fast food restaurants with indoor seating?",
        "what's the best-rated café on Yelp that offers dairy-free dishes for dine-in",
        "Can you suggest a highly recommended restaurant with inexpensive lunch and happy hours nearby?",
        "I need to find a restaurant with gluten-free options for late-night dining",
        "I'm craving some delicious dessert, is there a cafe nearby known for its yummy pastries and sweet treats?",
        "Can you recommend a restaurant with a good buffet and vegetarian choices?",
        "Where can I find a nice breakfast spot at Sunrise Diner?",
        "I'm craving some gluten-free ribs for lunch, can you recommend a restaurant with a mid-range price?",
        "Where can I find a café with Turkish dishes that won't break the bank?",
        "I'm looking for a place in Orlando with a nice ambiance for a lunch meeting, preferably with vegetarian options.",
        "What are the operating hours for the top-rated French restaurant in the city?",
        "Can you recommend a brunch spot with mid-range prices?",
        "where can I find a high-rated buffet restaurant near me",
        "I'm craving some Lebanese fast food, where can I find it?",
        "What are the top-rated fine dining restaurants in the area that offer stuffed mushrooms on their menu?",
        "Find me an impressive spot with a late-night seafood menu suitable for pescatarians.",
        "Can you recommend a fine dining restaurant with a lounge or bar ambience for a special occasion?",
        "I'm looking for a casual burger joint that's open late for dinner.",
        "can you recommend any restaurants with exceptional dining experiences for lunch?",
        "Where can I find a mid-range priced restaurant for brunch?",
        "What are the operating hours for places serving inexpensive late-night dining options?",
        "I'm looking for a lunch spot with good ratings and a parking lot uptown, do you have any suggestions?",
        "Can you recommend a high-end haul food truck in the downtown area",
        "Can you recommend a budget-friendly Italian restaurant with outdoor seating for dinner?",
        "What are the operational timings for IHOP for lunch?",
        "I'm looking for a brunch place with good customer feedback, preferably serving Chinese food.",
        "Do you know of any restaurants serving paleo-friendly brunch dishes?",
        "Are there any restaurants nearby that offer late-night dining and free parking",
        "I'm looking for a café with dairy-free options and a mid-range price. Any suggestions in the Steep area?",
        "What are the opening hours of a wheelchair accessible café nearby?",
        "I'm looking for a place with a nice ambiance for brunch, but not too expensive. Any recommendations?",
        "I'm looking for a fancy place that serves a delicious breakfast wrap. Any suggestions?",
        "can you recommend a cost-effective late night dining option on Main Street that serves Japanese cuisine",
        "which restaurant serves buffet breakfast in the morning",
        "I'm looking for a vegan-friendly restaurant nearby for lunch",
        "Where can I find a fine dining restaurant with mid-range prices on the west side that offers exquisite cuisine",
        "I'm looking for a food truck with a upscale menu, maybe The Grilled Cheese Truck",
        "Can you recommend a restaurant with a great BBQ menu for a midday meal?",
        "Can you recommend a Taco Bell location with high ratings and a convenient drive-thru?",
        "where can I find The Luxe Buffet with early bird specials",
        "I'm looking for a family-friendly restaurant with a kids menu and outdoor seating for dinner.",
        "Where in Austin can I find a Japanese restaurant with outdoor seating for brunch?",
        "Where is a casual restaurant with live music in Locale that serves breakfast",
        "I'm looking for a high-class Indian restaurant, preferably with outdoor seating",
        "Is there a restaurant in Dallas with outdoor seating that offers brunch options?",
        "What are the operating hours of the popular food truck in Downtown known for its unique dishes?",
        "what are the best options for late night Japanese cuisine on River Road",
        "I'm looking for a cozy spot for late-night dining with a romantic atmosphere",
        "I'm looking for a waterfront restaurant that serves a delicious brunch in the morning",
        "I need a caffeine fix, what are the best coffee options near Bluestone Lane?",
        "Can you recommend a lunch spot in Dubai with a diverse menu and outdoor seating?",
        "Which restaurant offers a dinner special with gourmet burgers?",
        "\"I'm looking for a top-rated place to have dinner on Thursday night, any suggestions?",
        "Where can I find a restaurant with a charming ambiance and tasty ribs for dinner tonight?",
        "can you recommend a sushi restaurant with outdoor seating and a good rating",
        "I want to have dinner at a popular restaurant that serves Mediterranean buffet. What are the operating hours for the best one?",
        "I'm looking for a food truck with free Wi-Fi that offers upscale ambience and delicious burritos.",
        "I'm looking for a place with exceptionally good lunch options in a lounge/bar setting",
        "What's a good place for a quick lunch with vegetarian options?",
        "Recommend me a café with a great menu for Vietnamese cuisine and discounts",
        "I am craving a buffet meal from Eleven Madison Park. Can you help me find a restaurant that offers delivery service?",
        "what cafés are open for breakfast",
        "what food truck in the area has the best ratings for their barbecue dishes?",
        "can you recommend a buffet restaurant with a dim sum selection in a cozy atmosphere?",
        "Where can I find a mid-range buffet restaurant in Rome?",
        "Can you suggest a cozy and intimate restaurant close by that serves lavish dinner?",
        "Can you recommend a fine dining restaurant with a budget-friendly price range for a special occasion?",
        "I'm craving some breakfast at the most popular café, do you have any suggestions?",
        "Can you recommend a café with a great outdoor seating area?",
        "I'm looking for a reservation at a fine dining establishment known for its exceptional fusion cuisine and high Gault Millau rating. Can you help me find one?",
        "Do you know any restaurants that offer a great brunch with affordable cost of brunch?",
        "I'm looking for a dinner spot in Tokyo with a view of the city",
        "I'm looking for a trendy restaurant in Nashville that serves late-night eats, any suggestions?",
        "Can you recommend a romantic restaurant with a wine selection and a prix fixe menu for dinner?",
        "I'm looking for a fine dining place with a rustic atmosphere that offers value for money. Any recommendations?",
        "Could you recommend a restaurant with a delicious acai bowl for brunch in the downtown area?",
        "Can you recommend a breakfast spot that offers tasting menus?",
        "I'm looking for a high-end restaurant with a riverside view.",
        "I'm looking for an upscale restaurant with a private dining room for a special occasion.",
        "Can you recommend an upscale and elegant restaurant with a great brunch menu, especially with delicious breakfast sandwiches?",
        "Is there a fast food restaurant nearby with outdoor seating and a drive-thru",
        "What are some restaurants with tasting menus that serve brunch in this area",
        "can you recommend a food truck listed in the Michelin Guide?",
        "Can you recommend a café with a stellar experience for a quick bite to eat after 5 pm",
        "I'm craving a steak. Can you recommend a café with late-night hours?",
        "I'm looking for a budget-friendly Asian food truck with Vietnamese dishes. Any suggestions?",
        "Can you recommend a Splendid restaurant with French cuisine for dinner tonight",
        "I'm craving some delicious street food from a food truck that has wheelchair accessibility. Any recommendations?",
        "What restaurants in the city center serve breakfast before 8 am?",
        "I'm looking for a buffet spot in the area with Mediterranean dishes. What's the rating for the top one?",
        "Where can I find a deluxe café with live music on weekends?",
        "Can you recommend any restaurants in the vicinity with a vegetarian buffet for lunchtime?",
        "I'm looking for a fine dining restaurant that serves seafood and is open past 10 pm.",
        "I need a café that serves vegan options and is open 24 hours",
        "I'm in the mood for some fast food, where can I find a Whataburger with order kiosks?",
        "Where can I find a pet-friendly patio to enjoy lunch at Yard House?",
        "Where can I find a waterfront restaurant with a decadent dinner menu",
        "I need to find a café with a cozy atmosphere and good coffee for lunch",
        "I'm craving sushi, can you find a highly rated sushi bar nearby for dinner?",
        "Where can I find a high-end late-night dining spot like The Nightcap Eatery?",
        "I'm looking for a café with outdoor seating around Bluestone Lane, what's available?",
        "Where can I find a fine dining restaurant that serves amazing sushi?",
        "I'm looking for a place with a cozy atmosphere and outdoor seating for brunch hours",
        "I heard there's a popular food truck serving Mexican cuisine near Dollar Diner, can you provide more information?",
        "What's the best food truck in the area for fast food?",
        "I'm craving some burgers and fries, where can I find a Five Guys nearby?",
        "I'm in the mood for some breakfast tacos at a cozy café, any recommendations?",
        "I'm craving some fast food for dinner, where can I get a good burger for takeout?",
        "Where can I find a breakfast locale that offers delivery service?",
        "Can you recommend a pricy buffet restaurant on the outskirts of town?",
        "Can you recommend a fine dining restaurant that offers waterfront views around the corner",
        "I need to find a restaurant with gluten-free options that is open past midnight.",
        "Find me a restaurant with vegan dishes that's open late and fits within my budget",
        "I'm craving some BYOB brunch place, where can I find a good Eggs Benedict?",
        "Can you recommend a restaurant with a parking lot in the Uptown area for lunch?",
        "I'm looking for a restaurant on the Eater 38 list that serves buffet-style meals. Can you suggest any?",
        "Can you recommend a fine dining restaurant on the south side with outdoor seating?",
        "Where can I find a breakfast spot with affordable options",
        "I'm a 28-year-old female software developer looking for affordable late-night dining options in Las Vegas, do you know anywhere open until 2 am?",
        "what is a good café nearby with a casual atmosphere and a tasting menu",
        "Can you recommend a beachfront restaurant in Dubai with a diverse menu for dinner?",
        "what's a good restaurant for late-night dining with a mid-range price for pho soup",
        "where are the best places to have brunch on a Saturday morning",
        "Can you recommend any fine dining restaurants that serve stuffed mushrooms?",
        "What is the highest rated food truck in the city that serves Mexican cuisine?",
        "Can you recommend a fast food place with a good value for meals in the mid-price range?",
        "I'm looking for a restaurant with a tasting menu for breakfast with free Wi-Fi",
        "I'm looking for a place to take my colleagues for a nice meal, do you have any recommendations for upscale cafes in the vicinity?",
        "I'm looking for a waterfront restaurant with dinner hours that has a gourmet menu and high ratings. Do you have any recommendations?",
        "Can you recommend a fine dining restaurant close to the theater district?",
        "I'm looking for a food truck near me in Houston that has a drive-thru",
        "I'm looking for a breakfast spot with live music and a good Bagel and cream cheese",
        "Where can I have a paleo-friendly meal in a café with parking nearby in Sydney?",
        "Can you recommend a quirky and eccentric café with an outdoor terrace in New York City?",
        "can you make a reservation at a high-end steakhouse for tonight?",
        "Can you recommend a food truck with a drive-thru close by in Houston",
        "Do you know of any fine dining establishments in the North area with a lounge/bar ambience?",
        "Where can I find a breakfast spot with vegan options near Sunrise Bistro?",
        "Can you recommend any Korean restaurants with weekend buffet timings?",
        "I'm in the mood for some farm-to-table Southern cuisine, where can I find a hip and trendy food truck?",
        "I'm craving some Korean barbecue from a food truck, do you know any place that offers low-carb options and delivers?",
        "Find me a place with a burger promotion for dinner tonight",
        "recommend a place with awesome breakfast options",
        "Can you recommend a buffet restaurant with waterfront views in this area?",
        "I'm looking for a fast food place with $1.99 chicken sandwich",
        "Can you recommend a restaurant with high chairs for kids and a costly dinner menu?",
        "I'm looking for a fine dining restaurant in the area that serves gluten-free brunch options",
        "I'm craving sushi, where is the best Japanese restaurant for dinner?",
        "Where can I find a fine dining restaurant known for its quirky and eccentric ambience and also listed in the San Pellegrino Top 50 rankings?",
        "I'm looking for a café with a cozy ambiance in the shopping district",
        "Can you recommend a café in Sydney with paleo-friendly options?",
        "What are the operating hours for Taco Bell in this area?",
        "I'm craving a chicken dish for dinner, do you know any upscale cafes in the area?",
        "I'm craving some fast food, can you recommend a place that serves pizza?",
        "What are the operating hours of the nearest budget-friendly fine dining restaurant?",
        "Can you recommend a restaurant with live music for breakfast?",
        "I'm looking for a restaurant with outdoor seating for Saturday lunch",
        "Where can I find a fantastic late-night dining spot for dinner on Thursday?",
        "Can you recommend a fine dining restaurant with a romantic ambience and waterfront views?",
        "Are there any cafés nearby that serve American cuisine for breakfast",
        "I'm in the mood for some BBQ for lunch, where can I find a good spot nearby?",
        "I'm looking for a phenomenal dinner spot in Sydney with a convenient location. Any suggestions?",
        "I need a place for a fancy brunch date, preferably with a view of the waterfront.",
        "Can you recommend a fine dining restaurant with a Forbes Travel Guide rating?",
        "What time does Sunny Side Cafe start serving brunch?",
        "find me a cozy café with takeout service for a quick lunch",
        "where can I have a breakfast tasting menu with affordable prices",
        "recommend a fine dining restaurant with a prix fixe menu",
        "I'm looking for a cool place to hang out with friends, maybe a café with outdoor seating?",
        "Can you recommend any hip and trendy restaurants in Nashville for late-night dining?",
        "Which hip eatery offers quick and affordable fast food options?",
        "where can I find the best buffet in town with a trendy ambience",
        "I'm in the mood for some tacos, is there an affordable food truck with outdoor seating nearby?"
    ],
    "sentences": [
        "I'm looking for a fancy breakfast spot that offers vegetarian options",
        "where can I find a high-end restaurant serving vegetarian breakfast",
        "recommend a luxurious place for a vegetarian morning meal",
        "Can you recommend a Spanish restaurant with upscale and elegant ambience for dinner tonight?",
        "I'm looking for a formal restaurant that serves biscuits and gravy for breakfast",
        "I need to find a breakfast spot with a formal setting that offers biscuits and gravy",
        "Can you recommend a trendy fine dining restaurant with a low-carb menu in the suburbs?",
        "I'm looking for a fine dining restaurant with a trendy atmosphere and a low-carb menu in the suburbs, any recommendations?",
        "Where in the suburbs can I find a fine dining restaurant with a trendy ambience and a low-carb menu?",
        "Where can I find a food truck serving Mexican cuisine for lunch?",
        "I'm looking for a nearby food truck with a good rating and affordable prices for a quick dinner after work.",
        "I need to grab a snack from a food truck before my evening meeting. Any recommendations close by?",
        "I'm looking for a fancy restaurant with waterfront views that serves a delicious breakfast",
        "Can you recommend an upscale place with a breakfast menu and a beautiful waterfront location?",
        "I want to have a luxurious breakfast with a view of the water, can you suggest a restaurant?",
        "I'm looking for a mid-range restaurant with low-carb options that also has a playground for kids.",
        "Where can I find a fast food restaurant with low-carb options and a mid-range price range that also offers nutrition information?",
        "I'm looking for a place with a low-carb brunch menu and a nice bar/lounge area",
        "Where can I find a restaurant with a low-carb brunch and a bar/lounge area?",
        "I need a recommendation for a brunch place with a bar/lounge area that offers low-carb options",
        "Can you recommend any buffet restaurants for pescatarians near The World's 50 Best Restaurants?",
        "What are the buffet options for pescatarians at Shoney's?",
        "I'm looking for a buffet restaurant suitable for pescatarians within walking distance of The World's 50 Best Restaurants.",
        "Where can I find a waterfront restaurant offering a buffet for a 50-year-old male doctor?",
        "I'm looking for a fancy outdoor dining experience near Atomix. What are the options?",
        "I'm craving some fast food for dinner, can you recommend a restaurant with delivery service?",
        "I need to order a fine dining meal for delivery tonight, do you have any suggestions?",
        "Where can I find a delivery service that offers fast food options for a quick lunch?",
        "Can you recommend a budget-friendly breakfast spot near Parkside Diner?",
        "Where can I grab a quick breakfast on a college campus with early hours?",
        "I'm in the mood for some vegan options from a food truck. Do you know any Gourmet Grub spots nearby?",
        "Where can I find a vegan-friendly food truck with a bar counter for a quick bite?",
        "I'm craving some vegan BBQ on Wheels. Any recommendations for a food truck serving that?",
        "I'm looking for a classy café with a wheelchair-accessible entrance and a great margherita pizza for a group of business professionals in their 50s.",
        "Can you recommend a Korean restaurant in the vicinity that serves halal lunch?",
        "Where can I find a halal Korean restaurant for lunch around here?",
        "What food trucks around here serve barbecue grill?",
        "Which food truck offers barbecue grill dishes in the area?",
        "I want to try some barbecue grill from a food truck, do you know any nearby?",
        "Can you recommend a restaurant with upscale breakfast options like a breakfast wrap?",
        "I'm looking for a trendy spot with wheelchair accessibility for a chic breakfast downtown",
        "Where can I find a hip restaurant with wheelchair accessibility for breakfast near my retail job?",
        "Can you recommend a cool place with wheelchair accessibility for a modern breakfast in this area?",
        "Can you recommend a cozy restaurant with a brunch menu",
        "I'm looking for a charming place to have brunch around here",
        "Where can I find a rustic restaurant that serves brunch",
        "I'm looking for a Lebanese restaurant in the upscale price range that serves low-carb brunch",
        "Where can I find an upscale Lebanese restaurant offering low-carb brunch options?",
        "Where can I find a brunch place with a tasting menu in the late morning",
        "Which restaurant has a tasting menu for brunch around late morning",
        "Can you recommend a place with a tasting menu for brunch around late morning",
        "I'm looking for a café with outdoor seating and a good brunch menu",
        "Can you recommend a restaurant with a good happy hour deal for lunch?",
        "I'm looking for a late night buffet with a dessert bar for a gluten-free meal",
        "What's the best gluten-free buffet restaurant in the area with a dessert bar?",
        "Find me a restaurant with a gluten-free late night buffet and a wide variety of dessert options",
        "Can you recommend a Lebanese restaurant with an urban/chic ambience for a doctor in his 30s for lunch?",
        "I'm looking for a quality-approved Italian restaurant with a chic atmosphere for a 30-something male doctor. Any suggestions for lunch?",
        "Where can I find an Italian restaurant that is popular among professionals in their 30s and has a chic urban ambience for lunch?",
        "Can you recommend a highly rated gourmet restaurant with a waterfront ambience for dinner on Thursday?",
        "Can you recommend a trendy restaurant for dinner near Chez Panisse?",
        "I'm looking for a trendy restaurant with a dinner menu around Chez Panisse",
        "where can I have a fancy dinner with a view tonight",
        "I'm looking for a chic place to have a fine dining experience with a cocktail bar. Do you have any suggestions?",
        "I'm in the mood for an upscale and elegant Japanese restaurant for a paleo-friendly lunch",
        "Can you recommend an elegant lunch spot with paleo options, maybe a PF Chang's location?",
        "Where can I find a fancy Japanese restaurant in the area that serves paleo-friendly dishes for lunch?",
        "Can you recommend a fine dining restaurant that offers gluten-free options?",
        "I'm looking for a high-end restaurant with a gluten-free menu, do you have any suggestions?",
        "recommend a rustic buffet restaurant with halal options in the area",
        "find me a buffet place with a rustic atmosphere serving halal food",
        "I'm looking for a restaurant with a buffet that offers halal dishes and has a rustic vibe",
        "Can you recommend an outstanding fast food restaurant with low-carb options in the downtown area?",
        "What outstanding fast food restaurant in the city serves low-carb meals and has a high rating?",
        "I'm looking for an outstanding fast food restaurant that offers low-carb dishes, where can I find one?",
        "I'm looking for a place with early bird specials for dinner",
        "Where is the nearest Chili's Grill & Bar for dinner tonight?",
        "I'm looking for a restaurant with outdoor seating and a good lunch menu near the waterfront",
        "Can you recommend a place with vegetarian options for lunch and a 4-star rating?",
        "Can you recommend any fine dining restaurants with gluten-free options and a business center?",
        "Can you recommend a budget-friendly restaurant with a buffet for a 35-year-old male construction worker?",
        "Can you recommend a restaurant with good lunch meal deals for delivery?",
        "I'm looking for a place with affordable lunch options for delivery. Any recommendations?",
        "I'm looking for a restaurant with parking that offers happy hour specials for dinner",
        "Where can I find a restaurant with margherita pizza and fajitas for dinner",
        "I need a recommendation for a dinner place with good margherita pizza and fajitas and a parking lot",
        "I'm a male doctor in my 30s looking for a sushi place with affordable prices and a relaxed atmosphere for dinner. Any recommendations?",
        "I'm looking for a top-notch buffet restaurant that offers vegetarian options and delivery service.",
        "I'm craving a low-carb dinner, any suggestions for a restaurant with Margherita pizza?",
        "can you recommend a private dining spot for an elegant lunch",
        "where can I find an upscale restaurant with french cuisine for a senior lady's lunch",
        "show me the nearest elegant restaurant, maybe La Petite Creperie, for a retired woman's lunch",
        "Can you recommend a cozy and intimate restaurant with a bar that serves lunch?",
        "I'm looking for a late-night dining spot with a cozy ambience that serves lunch.",
        "Find me a restaurant with a bar and a cozy atmosphere for a lunch meeting.",
        "I'm looking for a cost-efficient buffet restaurant with WiFi that serves paleo-friendly dishes",
        "Can you recommend a budget-friendly buffet place with WiFi that offers paleo options",
        "Where can I find a buffet restaurant that is affordable, has WiFi, and accommodates paleo diets?",
        "I'm looking for a restaurant that offers inexpensive late-night dining options, can you recommend one?",
        "Can you recommend a food truck with patio seating for a dine-in meal?",
        "I'm looking for a food truck with patio seating that offers dine-in options. Any suggestions?",
        "Is there a food truck around here that has patio seating for dine-in meals?",
        "Can you recommend any Chinese restaurants with paleo options for dinner?",
        "Where can I find a restaurant for dinner that offers paleo-friendly options and also serves afternoon tea?",
        "find a mid-range Middle Eastern restaurant with a good wine selection",
        "Which restaurants in the area offer a breakfast menu with luxurious options?",
        "I'm looking for a restaurant with upscale ambience and dinner hours serving Spanish cuisine.",
        "Can you recommend a fine dining restaurant with gourmet cuisine?",
        "I'm looking for a fine dining restaurant known for its gourmet dishes",
        "I'm looking for a popular café with outdoor seating in San Francisco for a business meeting",
        "What food trucks in Denver have a high rating for their cuisine?",
        "Which food trucks around here are known for their Mexican cuisine?",
        "I'm looking for a brunch & munch place that won't break the bank. Any suggestions?",
        "Can you recommend a restaurant around the corner with live music during lunchtime?",
        "Can you recommend any restaurants open late on Thursday with superb dinner options?",
        "I need a brunch spot near my workplace, preferably with a good rating",
        "Where can I find an upscale café with a smoking area and wheelchair-accessible entrance, perfect for a business owner in his 50s, for a luxurious dining experience?",
        "I'm looking for a luxurious dining experience, do you know of any high-end haul food trucks nearby",
        "I'm looking for a quirky late-night dining spot. Any suggestions?",
        "What are the nearest Italian restaurants open for dinner?",
        "I'm looking for a late-night restaurant with vegan options, preferably close by",
        "Where can I find an upscale restaurant that specializes in breakfast wraps?",
        "What's a good place for a quick bite to eat, maybe a trendy café with a cozy atmosphere?",
        "Can you recommend any Asian food trucks close by that serve Vietnamese cuisine?",
        "I'm craving some fish and chips, where can I get a discounted meal in the fast food category?",
        "Is there a restaurant nearby that offers a buffet option for vegetarians?",
        "I want to have a traditional English breakfast delivered to my hotel, where can I find a place that offers this?",
        "Do you know a café that is wheelchair-accessible and has a peaceful atmosphere, as well as dairy-free options?",
        "Do you know of any upscale cafés that offer an express lunch menu",
        "Can you recommend a low-cost fine dining restaurant for late-night American cuisine?",
        "I'm looking for a late-night dining option for American cuisine with a fine dining ambience that won't break the bank.",
        "Where can I find a wheelchair-accessible café with mid-range prices?",
        "can you recommend a brunch place that allows pets on their patio",
        "what are the top-rated cafés in downtown with free Wi-Fi?",
        "Can you recommend a place with a good rating that serves gluten-free food late at night?",
        "Can you recommend a cool and trendy fast food spot, maybe like Five Guys?",
        "Can you recommend a Vietnamese restaurant in Portland with vegetarian lunch options",
        "Which quirky and eccentric restaurant serves the best bagels for brunch",
        "Which restaurant serves gourmet sandwiches for a five-star lunch experience?",
        "I'm looking for a five-star lunch place that offers a prix fixe menu.",
        "Can you recommend a high-end restaurant with a great breakfast menu for the morning shift?",
        "Can you recommend a breakfast place with WiFi where I can have a business meeting with a client?",
        "I'm looking for a breakfast spot with WiFi that has a cozy atmosphere and is within a 10-minute walk from my office",
        "I'm craving some Asian cuisine, where can I find a buffet place open until 10 p.m.?",
        "Can you recommend a buffet restaurant with a kid-friendly atmosphere that opens for lunch?",
        "do you know any casual cafés around here that offer tasting menus",
        "show me fast food restaurants with chef's specials",
        "recommend a fast food restaurant with chef's specials",
        "Where can I find a top-notch fine dining restaurant that caters to gluten-free diners?",
        "I'm craving some vegan paella. Is there a food truck nearby that serves it?",
        "I'm looking for a peaceful lunch spot with Caribbean food in Nashville that's popular among young adults. Any suggestions?",
        "Where can I find a quiet lunch place serving Caribbean cuisine that's popular with female students in Nashville on Fridays?",
        "What is the lunch menu at Yard House on the West side?",
        "I'm looking for a cheap lunch spot near Yard House, any suggestions?",
        "What are some brunch spots that serve acai bowls and are known for their cozy ambiance?",
        "I'm looking for a restaurant that offers healthy options for brunch, particularly acai bowls.",
        "I need to find a place for dinner that is gluten-free and offers takeout.",
        "I'm looking for a mid-range restaurant in Seattle that serves American brunch with cocktails",
        "I'm looking for high-priced food truck fare in the area, can you recommend one?",
        "I'm a teacher in my mid-thirties and I'd like to find a café with a diverse menu that includes Chipotle dishes. Any suggestions?",
        "I'm craving a late-night meal with a fast-casual vibe, where can I find some Texas Roadhouse around here?",
        "I need to grab some late-night food, do you know if there's a fast-casual spot like P.F. Chang's nearby?",
        "Is there a place near P.F. Chang's where I can get a hearty meal after my construction shift ends at 10 pm?",
        "I need to grab some food on the go, is there a Dunkin' Donuts with a drive-thru?",
        "I'm in the mood for some fast food, where can I find a place with gourmet burgers?",
        "I want to grab a quick bite, where can I get some high-end tacos in this area?",
        "I need to find a place for a fancy fast food meal, where can I get some upscale chicken sandwiches?",
        "can you recommend a buffet restaurant with gourmet options that won't break the bank",
        "I'm craving some late-night Indian cuisine with a rustic ambience, can you recommend any restaurants?",
        "I'm looking for a fine dining restaurant with a high OpenTable rating that serves Chinese and French cuisine.",
        "Which fine dining restaurant nearby offers gluten-free options and specializes in Chinese and French cuisine?",
        "I'm craving sushi. Is there a highly rated sushi bar with a view near downtown?",
        "I'm looking for a place with a buffet that's good for a 35-year-old construction worker and won't break the bank.",
        "Where can I find a buffet that's suitable for a 35-year-old construction worker without spending too much?",
        "Can you recommend a restaurant with an oceanview buffet?",
        "Where can I find a critic-recommended restaurant with a buffet offering?",
        "which restaurant offers breakfast tasting menus with affordable prices and business hours",
        "Is there a restaurant that offers lunch meal deals and delivers in the area?",
        "Where can I find a buffet restaurant that delivers and serves vegetarian dishes, like Old Country Buffet?",
        "Where can I find a buffet restaurant with Greek cuisine and a lounge/bar atmosphere that won't break the bank?",
        "I need a breakfast spot that caters to a construction worker like me and stays open late",
        "Where can I find a restaurant with a breakfast menu that's open late, and also has a good rating?",
        "Can you recommend a restaurant with delicious ribs and a rustic, charming atmosphere for dinner?",
        "What quality cafés around here offer tasting menus?",
        "Where can I find a café with high-quality tasting menus nearby?",
        "Can you recommend a buffet restaurant in Paris with a chic urban ambience and paleo options",
        "I'm looking for a Mediterranean restaurant in Paris with a buffet and a chic urban atmosphere",
        "Where can I find BBQ ribs in Paris with a chic urban atmosphere and a buffet option for paleo eaters",
        "Can you recommend a restaurant with a drive-thru that operates during lunch hours in the city center?",
        "which nearby café offers takeout for coffee and pastries",
        "Where can I find a restaurant that offers waffles as part of their brunch menu on Tuesday mornings?",
        "which restaurants around here serve late-night Chinese dishes and deliver?",
        "Where can I have a fine dining experience with a romantic ambience and a view of the mountains?",
        "I'm looking for a restaurant with a buffet and bottomless mimosas that won't break the bank. Do you have any suggestions?",
        "Which restaurant around here offers breakfast at a reasonable price",
        "Where can I find a Mexican restaurant with vegetarian options for dinner?",
        "What are the top-rated restaurants with a late-night dining menu for families?",
        "find me a place with a fantastic breakfast value and private dining",
        "I'm looking for a place with lunch specials and a great happy hour menu, do you have any suggestions?",
        "Find me a restaurant with lunch options and a happy hour that starts before 3 pm",
        "what time does The Bagel Barn open for brunch",
        "I'm looking for a pocket-friendly restaurant with buffet serving hours",
        "Can you recommend a trendy food truck in Downtown with a diverse menu?",
        "I am craving some authentic Italian cuisine. Can you recommend any fine dining restaurants nearby?",
        "What is the best superior café in the downtown area for breakfast?",
        "What fast food restaurants are open past midnight in the downtown area",
        "What are the hours of operation for halal fast food restaurants in this area?",
        "I want to have a nice lunch with a friend, can you recommend any LongHorn Steakhouse with high ratings",
        "which restaurants have a good reputation for their Saturday morning brunch",
        "Can you recommend a high-rated French restaurant with outdoor seating?",
        "I'm craving some late-night sushi roll, can you recommend a place?",
        "I'm looking for an upscale buffet restaurant nearby, any suggestions?",
        "I'm looking for a buffet restaurant with decadent vegetarian options for dinner",
        "Which restaurant in the area has a good reputation for their brunch menu?",
        "I'm looking for a place with a superb brunch, where can I find one with affordable prices?",
        "I want to grab a quick bite that's not too pricy, can you locate a fast food place for me?",
        "Can you recommend a fast-food place with Thai cuisine and discounted items for a middle-aged accountant like me?",
        "Can you recommend a budget-friendly sushi restaurant with good ratings for dinner tonight?",
        "Can you recommend a Korean restaurant with good ratings for dinner on Thursday evening?",
        "what's the best place for a buffet lunch in the downtown area",
        "Can you recommend an Italian restaurant with budget-friendly lunch options?",
        "I want to try something new, where can I find a customer favorite food truck for lunch?",
        "Can you recommend a beachfront restaurant with a great brunch menu for this morning?",
        "I'm looking for a café with a cozy atmosphere and good coffee in the downtown area",
        "What's the best café for brunch hours in the downtown area?",
        "Where can I find a café with a mid-range price range for a quick bite?",
        "I'm looking for a budget-friendly place that serves delicious waffles in the morning",
        "Where can I find a restaurant offering waterfront views and a mid-range price range, specializing in Mediterranean cuisine for late-night dining?",
        "I'm in the mood for some fast food burgers, where can I find a food truck around here?",
        "What are some outstanding lunch establishments with a 5-star rating and a moderate price range?",
        "Can you recommend a trendy café around here for brunch?",
        "Can you recommend a good Italian buffet restaurant in the area for those with a dairy-free diet",
        "Can you recommend a Spanish restaurant that serves late-night tapas?",
        "Is there a Chinese restaurant nearby known for their excellent brunch menu and vegan-friendly dishes?",
        "I want to order brunch for delivery from a restaurant that offers all-day breakfast and outdoor seating.",
        "Can you recommend an excellent breakfast spot nearby?",
        "Can you recommend a café in the downtown zone with a high rating?",
        "Can you recommend a place for late-night dining with a good steak menu",
        "I'm craving some brunch, where can I find a good place for eggs benedict?",
        "which vegan café has the highest rating",
        "Where can I find a place by the beach that offers a morning brunch with a beautiful view?",
        "can you recommend a place for late-night dining that serves delicious pho soup",
        "Where can I get some mouth-watering takeout lobster rolls from a food truck here?",
        "What time does McDonald's open for breakfast?",
        "I need to find a dinner place with paleo options, preferably a Michelin star Italian restaurant with weekend hours.",
        "As a 50-year-old male doctor, I'm looking for a food truck with drive-thru service. Any suggestions near Big Mama's BBQ?",
        "What's the best Italian restaurant in the area for dinner?",
        "I need a reservation at a gourmet restaurant that offers early bird specials",
        "I need a reservation for a high-end restaurant serving gluten-free dishes tonight.",
        "I'm looking for a place with a diverse buffet menu including vegetarian options",
        "I'm craving some pancakes, is there a place nearby that serves breakfast besides Sunrise Diner?",
        "Could you recommend an upscale buffet with operating hours past 9pm?",
        "I'm looking for a budget-friendly Moroccan buffet place, do you have any suggestions?",
        "I'm looking for a mid-range priced restaurant with exquisite fine dining options on the west side",
        "Can you recommend a restaurant with unbeatable brunch options and outdoor seating?",
        "Where can I find an Italian buffet with a dairy-free menu and great cocktails",
        "Can you recommend a restaurant with a wide selection of seafood dishes for dinner tonight?",
        "where can I have a private breakfast meeting",
        "I'm in the mood for Flapjack Frenzy, where can I find it?",
        "Can you recommend a restaurant with a good wine selection for dinner tonight?",
        "I'm craving some casual fast food, can you suggest a place?",
        "Are there any waterfront restaurants known for their popular brunch destinations",
        "I want to try some Indian cuisine for lunch, can you suggest a highly-rated place nearby?",
        "What are the hours of operation for a highly recommended café in San Francisco?",
        "which buffet restaurant near me has a high rating",
        "Where can I find some affordable late-night dining options with a diverse menu?",
        "What's the nearest place that offers a takeout buffet for lunch?",
        "Can you recommend a Chicago brunch spot with outdoor seating and a high rating?",
        "Can you recommend a fast food restaurant near me that offers dinner service and has a drive-thru?",
        "Where can I find a buffet restaurant with a delicious fruit platter and affordable prices",
        "What's the best spot for affordable tacos and coffee in a café around here?",
        "suggest a dinner spot with exquisite cuisine and a modest price",
        "What's the best fast food place in the area for a quick dine-in meal?",
        "Where can I find a waterfront café with halal dishes at an affordable price?",
        "I'm craving some fast food, where can I get a gourmet burger in this area?",
        "I'm craving late-night dining with a waterfront view, can you recommend any restaurants?",
        "find me a café with free Wi-Fi and good food in the area",
        "Can you recommend any restaurants with waterfront views for dinner tonight?",
        "Can you recommend the most popular café with a cozy ambience?",
        "find me a Michelin Guide recommended upscale food truck nearby",
        "I'm looking for a casual place for lunch near Ruth's Chris Steak House",
        "where can I find affordable late-night dining in the area",
        "where is the nearest food truck with an impressive menu",
        "Where can I find a buffet restaurant with affordable prices in this area?",
        "Can you recommend a critically acclaimed restaurant with a romantic ambiance that serves Italian cuisine in the downtown area for dinner?",
        "I'm looking for a place with a weekend buffet serving Korean food, can you help?",
        "which brunch spot in Los Angeles has affordable prices",
        "Where can I find a food truck with outdoor seating and chef's specials?",
        "Where can I find the nearest fast food restaurant with a drive-thru?",
        "Can you recommend a good Italian restaurant with outdoor seating for dinner tonight?",
        "Find a high-end buffet restaurant in the Kings Buffet region",
        "I'm in the mood for some Thai food, where can I find a fast-food restaurant with discounted items nearby?",
        "I'm looking for a waterfront restaurant with good deals for lunch.",
        "I'm looking for a fast food place open after-hours",
        "Can you recommend a rustic restaurant with a cozy atmosphere that serves delicious French toast for breakfast?",
        "I'm looking for a mid-range sushi place in Sydney with a last call for dinner.",
        "I'm looking for a buffet restaurant with a $35 budget, what are the operation hours?",
        "I'm craving a delicious steak for a late-night dinner, can you suggest a nearby restaurant",
        "Can you recommend a restaurant with a pet-friendly patio for lunch?",
        "I'm craving fast food, where can I find a Carl's Jr. nearby?",
        "I need a place with highly recommended happy hours and inexpensive lunch options for today",
        "What are the operating hours of the seafood café near the waterfront?",
        "Can you recommend a trendy lunch spot around here, maybe Carrabba's Italian Grill?",
        "I'm craving some cheap burgers, where can I get a good deal",
        "where can I find a locale with a buffet breakfast",
        "Can you recommend a highly recommended café in San Francisco?",
        "I'm craving a healthy brunch, where can I find the best granola in town?",
        "Can you recommend any buffet restaurants that offer dine-in service?",
        "what's the best buffet place in the city for a doctor in his 30s",
        "Where can I find a restaurant around here that serves a vegetarian buffet during lunchtime?",
        "I'm craving pancakes and a mimosa, is there a restaurant bar nearby that offers them for breakfast?",
        "I'm looking for a cozy mid-range café with an upscale price range that serves brunch nearby.",
        "Can you recommend a fine dining restaurant with a great wine selection that has received the Wine Spectator Award of Excellence?",
        "Can you recommend a low-cost dinner place in Vancouver?",
        "I'm looking for a place to have a quick lunch with some sushi",
        "What are some nearby fast food options for a meal deal",
        "Can you recommend a fine dining restaurant with a pricy buffet?",
        "Do you know any waterfront restaurants with a good brunch menu?",
        "do you know any pet-friendly cafes with high customer satisfaction",
        "I'm looking for a highly-rated restaurant known for its upscale atmosphere and French cuisine to have dinner tonight.",
        "I'm craving some Dollar Fries, where's the nearest fast food joint?",
        "I'm looking for a café with weekend hours and special discounts",
        "Where is the nearest restaurant with a gluten-free menu that's open late?",
        "Where can I find waterfront restaurants open past midnight for a late-night meal?",
        "I'm looking for a fine dining restaurant with a lounge/bar ambience",
        "Where can I find a fast food restaurant with a good beverage station?",
        "I'm craving some specialty coffee, can you recommend an espresso bar in the area?",
        "Where can I find an upscale restaurant with outdoor seating and a buffet option?",
        "I'm looking for a beachfront or waterfront restaurant with late-night dining options",
        "Can you recommend a Mexican restaurant with a good lunch menu and affordable prices?",
        "I'm looking for a café that serves steak. Any recommendations for late-night dining?",
        "Can you recommend a place with great deals for breakfast and excellent scones?",
        "Can you recommend a romantic lunch place around Panera Bread that serves Italian cuisine?",
        "I'm looking for a café with vegan options for lunch",
        "Any suggestions for a unique café with an outdoor terrace in London that would appeal to a 45-year-old businessman?",
        "what's a good place with vegan options that's open past midnight",
        "I'm looking for a lunch spot with good vegetarian options in Portland",
        "can you recommend a good brunch place nearby",
        "I'm looking for a café that offers a variety of options for brunch in the downtown area",
        "what's a good café for tasting menus",
        "can you recommend a café on Yelp with dairy-free options for dine-in",
        "can you recommend a quarters café with mid-range prices?",
        "Where can I grab a croissant for breakfast at a local fast-casual spot?",
        "Can you recommend a halal-friendly buffet restaurant with reasonable prices?",
        "I need a place for dinner with a private dining room that has a romantic atmosphere and is within a moderate price range",
        "What are some high-end restaurants in Tokyo offering French cuisine for dinner",
        "I'm craving a good steak for dinner at a cozy café",
        "which restaurant has a high rating for late-night dining",
        "What are some affordable French fast food restaurants with indoor seating?",
        "what's the best-rated café on Yelp that offers dairy-free dishes for dine-in",
        "Can you suggest a highly recommended restaurant with inexpensive lunch and happy hours nearby?",
        "I need to find a restaurant with gluten-free options for late-night dining",
        "I'm craving some delicious dessert, is there a cafe nearby known for its yummy pastries and sweet treats?",
        "Can you recommend a restaurant with a good buffet and vegetarian choices?",
        "Where can I find a nice breakfast spot at Sunrise Diner?",
        "I'm craving some gluten-free ribs for lunch, can you recommend a restaurant with a mid-range price?",
        "Where can I find a café with Turkish dishes that won't break the bank?",
        "I'm looking for a place in Orlando with a nice ambiance for a lunch meeting, preferably with vegetarian options.",
        "What are the operating hours for the top-rated French restaurant in the city?",
        "Can you recommend a brunch spot with mid-range prices?",
        "where can I find a high-rated buffet restaurant near me",
        "I'm craving some Lebanese fast food, where can I find it?",
        "What are the top-rated fine dining restaurants in the area that offer stuffed mushrooms on their menu?",
        "Find me an impressive spot with a late-night seafood menu suitable for pescatarians.",
        "Can you recommend a fine dining restaurant with a lounge or bar ambience for a special occasion?",
        "I'm looking for a casual burger joint that's open late for dinner.",
        "can you recommend any restaurants with exceptional dining experiences for lunch?",
        "Where can I find a mid-range priced restaurant for brunch?",
        "What are the operating hours for places serving inexpensive late-night dining options?",
        "I'm looking for a lunch spot with good ratings and a parking lot uptown, do you have any suggestions?",
        "Can you recommend a high-end haul food truck in the downtown area",
        "Can you recommend a budget-friendly Italian restaurant with outdoor seating for dinner?",
        "What are the operational timings for IHOP for lunch?",
        "I'm looking for a brunch place with good customer feedback, preferably serving Chinese food.",
        "Do you know of any restaurants serving paleo-friendly brunch dishes?",
        "Are there any restaurants nearby that offer late-night dining and free parking",
        "I'm looking for a café with dairy-free options and a mid-range price. Any suggestions in the Steep area?",
        "What are the opening hours of a wheelchair accessible café nearby?",
        "I'm looking for a place with a nice ambiance for brunch, but not too expensive. Any recommendations?",
        "I'm looking for a fancy place that serves a delicious breakfast wrap. Any suggestions?",
        "can you recommend a cost-effective late night dining option on Main Street that serves Japanese cuisine",
        "which restaurant serves buffet breakfast in the morning",
        "I'm looking for a vegan-friendly restaurant nearby for lunch",
        "Where can I find a fine dining restaurant with mid-range prices on the west side that offers exquisite cuisine",
        "I'm looking for a food truck with a upscale menu, maybe The Grilled Cheese Truck",
        "Can you recommend a restaurant with a great BBQ menu for a midday meal?",
        "Can you recommend a Taco Bell location with high ratings and a convenient drive-thru?",
        "where can I find The Luxe Buffet with early bird specials",
        "I'm looking for a family-friendly restaurant with a kids menu and outdoor seating for dinner.",
        "Where in Austin can I find a Japanese restaurant with outdoor seating for brunch?",
        "Where is a casual restaurant with live music in Locale that serves breakfast",
        "I'm looking for a high-class Indian restaurant, preferably with outdoor seating",
        "Is there a restaurant in Dallas with outdoor seating that offers brunch options?",
        "What are the operating hours of the popular food truck in Downtown known for its unique dishes?",
        "what are the best options for late night Japanese cuisine on River Road",
        "I'm looking for a cozy spot for late-night dining with a romantic atmosphere",
        "I'm looking for a waterfront restaurant that serves a delicious brunch in the morning",
        "I need a caffeine fix, what are the best coffee options near Bluestone Lane?",
        "Can you recommend a lunch spot in Dubai with a diverse menu and outdoor seating?",
        "Which restaurant offers a dinner special with gourmet burgers?",
        "\"I'm looking for a top-rated place to have dinner on Thursday night, any suggestions?",
        "Where can I find a restaurant with a charming ambiance and tasty ribs for dinner tonight?",
        "can you recommend a sushi restaurant with outdoor seating and a good rating",
        "I want to have dinner at a popular restaurant that serves Mediterranean buffet. What are the operating hours for the best one?",
        "I'm looking for a food truck with free Wi-Fi that offers upscale ambience and delicious burritos.",
        "I'm looking for a place with exceptionally good lunch options in a lounge/bar setting",
        "What's a good place for a quick lunch with vegetarian options?",
        "Recommend me a café with a great menu for Vietnamese cuisine and discounts",
        "I am craving a buffet meal from Eleven Madison Park. Can you help me find a restaurant that offers delivery service?",
        "what cafés are open for breakfast",
        "what food truck in the area has the best ratings for their barbecue dishes?",
        "can you recommend a buffet restaurant with a dim sum selection in a cozy atmosphere?",
        "Where can I find a mid-range buffet restaurant in Rome?",
        "Can you suggest a cozy and intimate restaurant close by that serves lavish dinner?",
        "Can you recommend a fine dining restaurant with a budget-friendly price range for a special occasion?",
        "I'm craving some breakfast at the most popular café, do you have any suggestions?",
        "Can you recommend a café with a great outdoor seating area?",
        "I'm looking for a reservation at a fine dining establishment known for its exceptional fusion cuisine and high Gault Millau rating. Can you help me find one?",
        "Do you know any restaurants that offer a great brunch with affordable cost of brunch?",
        "I'm looking for a dinner spot in Tokyo with a view of the city",
        "I'm looking for a trendy restaurant in Nashville that serves late-night eats, any suggestions?",
        "Can you recommend a romantic restaurant with a wine selection and a prix fixe menu for dinner?",
        "I'm looking for a fine dining place with a rustic atmosphere that offers value for money. Any recommendations?",
        "Could you recommend a restaurant with a delicious acai bowl for brunch in the downtown area?",
        "Can you recommend a breakfast spot that offers tasting menus?",
        "I'm looking for a high-end restaurant with a riverside view.",
        "I'm looking for an upscale restaurant with a private dining room for a special occasion.",
        "Can you recommend an upscale and elegant restaurant with a great brunch menu, especially with delicious breakfast sandwiches?",
        "Is there a fast food restaurant nearby with outdoor seating and a drive-thru",
        "What are some restaurants with tasting menus that serve brunch in this area",
        "can you recommend a food truck listed in the Michelin Guide?",
        "Can you recommend a café with a stellar experience for a quick bite to eat after 5 pm",
        "I'm craving a steak. Can you recommend a café with late-night hours?",
        "I'm looking for a budget-friendly Asian food truck with Vietnamese dishes. Any suggestions?",
        "Can you recommend a Splendid restaurant with French cuisine for dinner tonight",
        "I'm craving some delicious street food from a food truck that has wheelchair accessibility. Any recommendations?",
        "What restaurants in the city center serve breakfast before 8 am?",
        "I'm looking for a buffet spot in the area with Mediterranean dishes. What's the rating for the top one?",
        "Where can I find a deluxe café with live music on weekends?",
        "Can you recommend any restaurants in the vicinity with a vegetarian buffet for lunchtime?",
        "I'm looking for a fine dining restaurant that serves seafood and is open past 10 pm.",
        "I need a café that serves vegan options and is open 24 hours",
        "I'm in the mood for some fast food, where can I find a Whataburger with order kiosks?",
        "Where can I find a pet-friendly patio to enjoy lunch at Yard House?",
        "Where can I find a waterfront restaurant with a decadent dinner menu",
        "I need to find a café with a cozy atmosphere and good coffee for lunch",
        "I'm craving sushi, can you find a highly rated sushi bar nearby for dinner?",
        "Where can I find a high-end late-night dining spot like The Nightcap Eatery?",
        "I'm looking for a café with outdoor seating around Bluestone Lane, what's available?",
        "Where can I find a fine dining restaurant that serves amazing sushi?",
        "I'm looking for a place with a cozy atmosphere and outdoor seating for brunch hours",
        "I heard there's a popular food truck serving Mexican cuisine near Dollar Diner, can you provide more information?",
        "What's the best food truck in the area for fast food?",
        "I'm craving some burgers and fries, where can I find a Five Guys nearby?",
        "I'm in the mood for some breakfast tacos at a cozy café, any recommendations?",
        "I'm craving some fast food for dinner, where can I get a good burger for takeout?",
        "Where can I find a breakfast locale that offers delivery service?",
        "Can you recommend a pricy buffet restaurant on the outskirts of town?",
        "Can you recommend a fine dining restaurant that offers waterfront views around the corner",
        "I need to find a restaurant with gluten-free options that is open past midnight.",
        "Find me a restaurant with vegan dishes that's open late and fits within my budget",
        "I'm craving some BYOB brunch place, where can I find a good Eggs Benedict?",
        "Can you recommend a restaurant with a parking lot in the Uptown area for lunch?",
        "I'm looking for a restaurant on the Eater 38 list that serves buffet-style meals. Can you suggest any?",
        "Can you recommend a fine dining restaurant on the south side with outdoor seating?",
        "Where can I find a breakfast spot with affordable options",
        "I'm a 28-year-old female software developer looking for affordable late-night dining options in Las Vegas, do you know anywhere open until 2 am?",
        "what is a good café nearby with a casual atmosphere and a tasting menu",
        "Can you recommend a beachfront restaurant in Dubai with a diverse menu for dinner?",
        "what's a good restaurant for late-night dining with a mid-range price for pho soup",
        "where are the best places to have brunch on a Saturday morning",
        "Can you recommend any fine dining restaurants that serve stuffed mushrooms?",
        "What is the highest rated food truck in the city that serves Mexican cuisine?",
        "Can you recommend a fast food place with a good value for meals in the mid-price range?",
        "I'm looking for a restaurant with a tasting menu for breakfast with free Wi-Fi",
        "I'm looking for a place to take my colleagues for a nice meal, do you have any recommendations for upscale cafes in the vicinity?",
        "I'm looking for a waterfront restaurant with dinner hours that has a gourmet menu and high ratings. Do you have any recommendations?",
        "Can you recommend a fine dining restaurant close to the theater district?",
        "I'm looking for a food truck near me in Houston that has a drive-thru",
        "I'm looking for a breakfast spot with live music and a good Bagel and cream cheese",
        "Where can I have a paleo-friendly meal in a café with parking nearby in Sydney?",
        "Can you recommend a quirky and eccentric café with an outdoor terrace in New York City?",
        "can you make a reservation at a high-end steakhouse for tonight?",
        "Can you recommend a food truck with a drive-thru close by in Houston",
        "Do you know of any fine dining establishments in the North area with a lounge/bar ambience?",
        "Where can I find a breakfast spot with vegan options near Sunrise Bistro?",
        "Can you recommend any Korean restaurants with weekend buffet timings?",
        "I'm in the mood for some farm-to-table Southern cuisine, where can I find a hip and trendy food truck?",
        "I'm craving some Korean barbecue from a food truck, do you know any place that offers low-carb options and delivers?",
        "Find me a place with a burger promotion for dinner tonight",
        "recommend a place with awesome breakfast options",
        "Can you recommend a buffet restaurant with waterfront views in this area?",
        "I'm looking for a fast food place with $1.99 chicken sandwich",
        "Can you recommend a restaurant with high chairs for kids and a costly dinner menu?",
        "I'm looking for a fine dining restaurant in the area that serves gluten-free brunch options",
        "I'm craving sushi, where is the best Japanese restaurant for dinner?",
        "Where can I find a fine dining restaurant known for its quirky and eccentric ambience and also listed in the San Pellegrino Top 50 rankings?",
        "I'm looking for a café with a cozy ambiance in the shopping district",
        "Can you recommend a café in Sydney with paleo-friendly options?",
        "What are the operating hours for Taco Bell in this area?",
        "I'm craving a chicken dish for dinner, do you know any upscale cafes in the area?",
        "I'm craving some fast food, can you recommend a place that serves pizza?",
        "What are the operating hours of the nearest budget-friendly fine dining restaurant?",
        "Can you recommend a restaurant with live music for breakfast?",
        "I'm looking for a restaurant with outdoor seating for Saturday lunch",
        "Where can I find a fantastic late-night dining spot for dinner on Thursday?",
        "Can you recommend a fine dining restaurant with a romantic ambience and waterfront views?",
        "Are there any cafés nearby that serve American cuisine for breakfast",
        "I'm in the mood for some BBQ for lunch, where can I find a good spot nearby?",
        "I'm looking for a phenomenal dinner spot in Sydney with a convenient location. Any suggestions?",
        "I need a place for a fancy brunch date, preferably with a view of the waterfront.",
        "Can you recommend a fine dining restaurant with a Forbes Travel Guide rating?",
        "What time does Sunny Side Cafe start serving brunch?",
        "find me a cozy café with takeout service for a quick lunch",
        "where can I have a breakfast tasting menu with affordable prices",
        "recommend a fine dining restaurant with a prix fixe menu",
        "I'm looking for a cool place to hang out with friends, maybe a café with outdoor seating?",
        "Can you recommend any hip and trendy restaurants in Nashville for late-night dining?",
        "Which hip eatery offers quick and affordable fast food options?",
        "where can I find the best buffet in town with a trendy ambience",
        "I'm in the mood for some tacos, is there an affordable food truck with outdoor seating nearby?"
    ]
}