{
    "entity-not-found": [
        "Can you tell me the name of the biopic film that features the song 'Mamma Mia!'?",
        "I'm looking for a behind-the-scenes documentary about a treasure hunt movie released in the past decade.",
        "Can I watch Forbidden romance on any streaming platforms?",
        "Is The Princess Bride available to stream anywhere? I really need a pick-me-up.",
        "Could you tell me about any electrifying psychological thrillers from 2017 that involve an undercover operation?",
        "Did Jon Favreau direct any movies that have won the Cannes Grand Prix?",
        "Are there any movies suitable for a pre-teen girl that have won awards at Cannes?",
        "I'm interested in a Civil War movie with a captivating score. Do you have any recommendations?",
        "Can I find a trailer for any romantic movies from the 1980s or 1990s?",
        "Can you tell me the plot of any family-friendly movies released between 1945 and 1955?",
        "When You Wish Upon a Star, is there a movie suitable for pre-teens showing this weekend?",
        "Who directed the making-of documentary for Star Wars and what year did it come out?",
        "Who composed the music for the movie The Lion King",
        "Hey, I'm bored. Can you tell me if 'Zombieland' with Emma Stone is available on any streaming platforms?",
        "I need something to watch. Is there a romantic comedy movie starring Emma Stone that I can stream right now?",
        "Who directed the film The Fugitive and what makes the casting exceptional?",
        "Can you tell me if Dorothy Gale appears in the movie Aashiqui 2, which actor stars in it and is it considered perfect by viewers?",
        "I'm looking for a movie that features song snippets in the background",
        "Can you highlight the plot of any heartfelt crime dramas with a 5-star rating that came out in 1995?",
        "I'm looking for a film set in the prohibition era, with unparalleled direction and a significant nod from the critics.",
        "Has the movie Cassidy Davis, released in 2015, won any awards at film festivals?",
        "Can you tell me about any awards or nominations received by the movie Cassidy Davis, which was released in 2015 and won at a film festival?",
        "I'm interested in finding out if the film Cassidy Davis, from 2015, has garnered any festival wins or nominations.",
        "I heard about a film set in the 1670s. Do you know who directed it? I think it's called This is Spinal Tap.",
        "Can I find any 2019 movies by Richard Linklater to stream that are considered a must-see",
        "Can you tell me who directed the movie 12 Angry Men that was released between 1965 and 1970?",
        "When was The Social Network trailer released and what is the MPAA Rating for the film?",
        "Can you give me a brief summary of the plot for any action film released between 1995 and 2000?",
        "Do you have any clips or a sizzle reel for a movie with Leonardo DiCaprio in a complex narrative?",
        "Have you heard of any electrifying movies from 1992 to 1998 that got really good ratings?",
        "Who directed the movie Superman and is Peeta Mellark in it?",
        "Could you recommend a breathtaking movie released between 1970 and 1980?",
        "I'm feeling pretty down. Could you recommend a movie review or rating for Gone with the Wind to cheer me up?",
        "Can you recommend any classic sci-fi thriller movies from the 1940s or 1950s that are restricted?",
        "Hey, can you give me a quick rundown of the plot for any Francis Ford Coppola movie?",
        "Have you seen any movies featuring Gal Gadot with well-developed plotlines?",
        "I'm looking for a movie about a girl who overcomes obstacles and achieves her dreams, maybe related to sports or something like that.",
        "Can you recommend a movie featurette that reveals the behind-the-scenes makeup and hairstyling process?",
        "Could you recommend any sports movies with remarkable casting?",
        "Are there any 1920s period dramas directed by Michael Bay?",
        "Can you recommend a movie with a beautiful music score and emotional soundtrack?",
        "What genre of movies does Patty Jenkins typically direct that would appeal to middle-aged women?",
        "Hey, who directed that cool movie about corruption in the 2010s?",
        "Can you tell me the plot of a movie with a spectacular and dense plot released between 1995 and 2005?",
        "I'm interested in a movie from the late 90s with a captivating plot. Can you give me a synopsis of such a film?",
        "Can you give me a brief overview of the plot for the action movie released between 1970 and 2010 with a great teaser trailer?",
        "I'm looking for a mystery movie with an intriguing plot released between 1970 and 2010, and could you show me a teaser for it?",
        "Can you tell me which movie won the European Film Award recently and the number of nominations it received?",
        "Hey, has The Artist received any awards or nominations for its amazing acting?",
        "Have any movies about an undercover agent won big awards recently?",
        "I'm really sad. Can you tell me when the trailer for the upcoming Mr. Incredible movie will be released?",
        "Are there any 1960s movies with strong female characters available for streaming?",
        "Can you provide me with information about any NC-17 rated movies released between 1960 and 1965 that are in the film noir genre?",
        "Can you tell me if Emma Stone starred in any horror-thriller movies between 2005 and 2010?",
        "Who directed the movie involving drug trafficking and a hero's journey that was released between 2005 and 2010?",
        "Has the movie Philadelphia received any awards or nominations?",
        "Show me a movie directed by Paul Feig that I can stream with parental controls.",
        "Who directed the movie Saving Private Ryan?",
        "Hey, I'm so bored. Can you tell me where I can stream Midsommar with parental controls?",
        "Which movie directed by Christopher Nolan won a Goya Award and is celebrated by award committees?",
        "Yo, has Javier Bardem's breakthrough performance in Joker been acclaimed in the awards circuit?",
        "Yo, was Joker rated NR despite its acclaimed performance in the awards circuit?",
        "Can you recommend a hip hop movie with an amazing soundtrack from a film directed by Edgar Wright in the last decade?",
        "I'm looking for a movie with an outstanding hip hop soundtrack, can you suggest me a film with an F rating?",
        "Can you tell me if Aladdin has won any People's Choice Awards",
        "I want to watch a must-see movie that won multiple Awards like The Bridge on the River Kwai",
        "Can you tell me about any awards or nominations the movie Ex Machina received in 2014",
        "Can you recommend any coming-of-age films directed by Steven Spielberg?",
        "I'm curious to know the plot synopsis of any R-rated movie released between 1960 and 2020",
        "Hey, I heard that Meryl Streep won a lot of awards for her role in The Iron Lady. Can you tell me which awards she received for that movie?",
        "I love Leonardo DiCaprio in Titanic, but did Jack Dawson win any awards for his performance? Or maybe the movie itself?",
        "Can you recommend a monster movie released between 2002 and 2005 with a PG-13 rating?",
        "I would like to know more about the plot of the movie A Whole New World, can you provide a summary?",
        "I'm looking for a G or PG rated film that delves into the making-of process of a critically acclaimed Anne Bancroft movie.",
        "Is Stayin' Alive available to stream on any platform?",
        "I'm looking for a musical composition featured in a movie from 1999, can you help?",
        "Are there any unrated movies available to stream?",
        "Can you tell me about any science fiction movies that offer rare behind-the-scenes glimpses?",
        "Can I watch the trailer for any movie released between 2010 and 2015?",
        "Which critically acclaimed movies from 1980 to 1985 have Yorgos Lanthimos directed?",
        "I'm interested in learning more about a popular movie involving dinosaurs. Can you provide me with the plot details?",
        "Can you show me the teaser trailer for any compelling neo-noir movies released between 2010 and 2020?",
        "Can you tell me about the making of a movie from the 1970s or 1980s that was directed by a legendary filmmaker?",
        "What are some captivating historical dramas from the 2000s?",
        "I'm not sure about the film The Time of My Life. How can I find out if it's worth watching?",
        "Could you showcase the trailer of a terrific true crime movie with an amazing 95% audience score that came out in 1972?",
        "What R-rated movies from 1972 are available on streaming platforms?",
        "Could you play the trailer for the latest Idris Elba movie?",
        "I'm looking for a movie with an intriguing plot involving Christian Bale and Emma Watson. Do you have any recommendations?",
        "Could you find me a list of Gotham Awards recipients for the years 1960-1962?",
        "Which film was the winner at the Berlin International Film Festival featuring a strong female lead?",
        "Are there any streaming platforms that have the movie Lady Bird available for senior citizens?",
        "Is the movie Kiss the Girl available for streaming? I'd like to watch it with my fellow senior citizens.",
        "Can you tell me if there were any movies between 1990 and 1995 that received outstanding awards?",
        "I'm curious about the reviews for Terry Gilliam's films released between 2012 and 2015. Can you tell me the ratings for any of them?",
        "Is there a movie about Buzz Lightyear with no rating for me to watch?",
        "I'd like to know if Interstellar is accessible on any streaming platforms, what can you tell me about it?",
        "Can you tell me if the movie \"The Shape of Water\" received any awards or nominations for its romantic fantasy genre?",
        "Hey, can I get an exclusive look at a biopic on La La Land that's available on any streaming platform?",
        "What movie is currently playing that appeals to a wide audience regardless of gender?",
        "Who directed the movie The Princess Bride and what was the year of its release?",
        "Could you recommend a film from 2018 that received prestigious awards and nominations?",
        "Can you tell me about any movies with 5-star ratings that received high praise for their visual effects?",
        "I'm looking for a film released between 1995 and 2000 that was directed by James Cameron and starred Al Pacino. Also, do you have any G or PG-rated movies that fit that description?",
        "Can you tell me the plot of any satire film released between 2010 and 2020?",
        "I'm interested in finding out if there are any successful movies that combine war themes with drama. If so, have any of them been recognized with awards or nominations?",
        "Is it true that the movie 'Arrival' received an Academy Award nomination for Best Director?",
        "Has any movie with a solid track record in awards recognition come out between 1983 and 1986?",
        "I'm desperate to watch 'I Don't Want to Miss'! Can you please show me the trailer and tell me where I can find it to stream?",
        "Are there any solid spy movies from the 2010s to the 2020s available for streaming?",
        "I'm interested in learning more about the behind-the-scenes details of any movies made between 1960 and 1990.",
        "What's the best movie with a rating of 8/10 directed by Mike Leigh?",
        "I'm curious if there are any highly lauded movies that were Golden Globes or Festival winners.",
        "I heard great things about the new animated film - any showtimes available?",
        "I'm curious to know if the movie with the song 'Let It Go' has won any Academy Awards and nominations.",
        "Spoken movie query: \"I'm looking for the pickiest heist movie that has won a Golden Globe. Can you help me with that?\"",
        "Can you tell me if any movie directed by Kenneth Branagh and starring Emma Thompson has received significant awards or nominations?",
        "Can you tell me about any behind-the-scenes details of movies released between 1963 and 1968?",
        "Show me some behind-the-scenes footage of Gwyneth Paltrow's films from 2003 to 2008.",
        "Can you provide information on any masterful portrayals by actors in the cult ritual film The Blues Brothers?"
    ],
    "missing-entity-type": [
        "Can you find production featurettes for the movie directed by David Yates that features Hermione Granger as a main character?",
        "Are there any on-location shooting films starring Viola Davis?",
        "Is the movie Inception available on Prime Video?",
        "Can I watch any foreign language films on Prime Video?",
        "Are there any classic Disney animations on Prime Video?",
        "I need information on the box office availability of a fantastic movie released in 2007.",
        "Can you recommend a movie with top-notch performances by Leonardo DiCaprio and directed by Martin Scorsese?",
        "Where can I find a film with top-notch performances by Meryl Streep and Tom Hanks?",
        "I'm looking for a movie known for top-notch performances by the entire cast, especially the lead actor and actress.",
        "I need to know if Black Widow won any awards, like now!",
        "Did Nomadland get any nominations? I don't have all day!",
        "Tell me, what awards did Jamie Foxx win in 1956? I'm in a hurry!",
        "Is there a mystery movie suitable for families with young children that came out in the same year as The Terminator?",
        "Can you tell me who directed the historical reenactment film set in the 1960s?",
        "Show me a movie about a midlife crisis that features the actor from Assassin's Creed.",
        "What movie is Annie known for, and who directed it?",
        "Can you recommend a movie with a detailed director's commentary for the character Severus Snape?",
        "I'm interested in finding a movie featuring behind-the-scenes insights about Severus Snape's character. Can you help?",
        "Is there a movie with a director's commentary that delves into Severus Snape's role in the film?",
        "Can you tell me who directed the martial arts film that follows the hero's journey in a remote village in China?",
        "Show me a movie where the main character goes on a hero's journey to master martial arts and save their family from a crime syndicate.",
        "I'm looking for a film with an iconic martial arts scene, featuring the hero's journey of a young boy who becomes a legendary fighter.",
        "Can I watch Eternal Sunshine of the Spotless Mind on any streaming platforms?",
        "Show me the teaser trailer for a movie featuring Jon Snow",
        "Are there any movies from the early 1990s available for streaming?",
        "Can you recommend a movie with incredible acting by Emma Watson and a brilliant director?",
        "Yo, where can I find the Indiana Jones movies to stream?",
        "Hey, is there a streaming platform with West Side Story on it?",
        "Can you tell me if the movie The Hunger won any awards or received nominations?",
        "I'd like to know if the movie Cross Creek, released between 1983 and 1986, received any awards or nominations.",
        "Is Spider-Man: No Way Home available for streaming on any platform for middle-aged women?",
        "Has any movie directed by Amy Sherman-Palladino received an impressive track record in awards?",
        "Which award-winning neo-noir film was directed by Jonathan Demme and received a 1/10 rating?",
        "Hey, what's the deal with The Shawshank Redemption? Did it win any major awards?",
        "I heard Lady Gaga is starring in a new film directed by Oliver Stone. What's it about and has it received any nominations yet?",
        "I'm feeling really down today. Can you tell me if Laura Dern has won any awards for her role in the movie Crime Spree?",
        "I'm feeling pretty blue. Has the movie William Wilson been nominated for any awards?",
        "Has the movie Blade Runner 2049 won any awards or nominations",
        "I'm looking for a decent cyberpunk film from 2006 that was recognized with awards or nominations",
        "Yo, did that new flick win any awards or get nominated for anything? I'm talkin' like, the Independent Spirit Award recipient or somethin' like that.",
        "Is there any X movie that cleaned up at the awards? Like, did it win anything or get nominated for anything big?",
        "can you tell me about the set design of the newest animated family movie",
        "who was the set designer for the latest fantasy movie for families",
        "Can you recommend a film directed by Patty Jenkins that has strong family dynamics?",
        "I'd like to see an extended trailer for the film Inception",
        "Do you have any featurettes for movies directed by Danny Boyle?",
        "I'm feeling a bit down right now. Could you show me a movie preview that will cheer me up a bit?",
        "I'm in the mood for something that will lift my spirits. Can you recommend an official trailer for a feel-good movie?",
        "I'm feeling a little blue. Do you have any promos for movies that could brighten my day?",
        "What is the directors' rating on The Sixth Sense, and can you provide any making-of details?",
        "Can you tell me which movie directed by Danny Boyle was awarded for its outstanding performances?",
        "Show me a promo for a disaster movie released between 1965-1970",
        "What movie from the 1965-1970 period received the most awards and nominations?",
        "What is the MPAA rating for the movie in the genre Science Fiction that I can watch with my friends?",
        "I'm looking for a movie with some exclusive behind-the-scenes footage, maybe something like Crazy Heart.",
        "Can you tell me about the casting process for the movie Whiplash?",
        "What is the plot of the movie starring Christian Bale and Emma Watson?",
        "Is there an Adam Sandler movie that's TV-G on any streaming service?",
        "Can you tell me about the making-of the film Titanic",
        "I always feel so sad thinking about how Heath Ledger's performance as the Joker in The Dark Knight came to be. Can you share some behind-the-scenes information about it?",
        "I'm feeling down and could use a good cry. Do you have any information about the making-of the movie Schindler's List?",
        "Is the movie Moulin Rouge! available to stream on any platform?",
        "Can I watch any Alicia Vikander movies on streaming services?",
        "Are there any popular movies from the 1970s currently streaming online?",
        "What's a great movie to watch when you're bored, something in the same genre as Black Swan?",
        "Who directed The Grand Budapest Hotel and what genre does it fall under?",
        "I heard The Grand Budapest Hotel has a fantastic soundtrack. What song from the movie do people love the most?",
        "Can you tell me some of the actors in The Grand Budapest Hotel and their performances in the film?",
        "Can I watch a trailer for a romantic comedy with terrible ratings?",
        "Show me a movie trailer with Gal Gadot involving betrayal and time travel",
        "Is there a Johnny Depp movie similar to The Great Gatsby that has a teaser available?",
        "Is there a movie with political corruption that has received high viewers' ratings?",
        "Is Black Panther available on any streaming platforms right now?",
        "What is the genre of the movie Professor, and can I find it on any streaming platforms?",
        "Has Leonardo DiCaprio ever starred in an NC-17 film, and can I watch it on any streaming platforms?",
        "I heard that there were some controversies during the making of a Colin Firth film at a Hollywood studio, can you give me some details about it?",
        "I have my doubts about the authenticity of the behind-the-scenes footage from a Hollywood studio for a recent movie. Can you show it to me?",
        "Can you tell me which movie won the most awards for fantasy-comedy genre?",
        "Could you provide me with a list of courtroom dramas released in 2016 that were nominated for major awards?"
    ],
    "not-allowed-entity-type": [
        "Yo, I'm looking for some movies with Hera Syndulla from Star Wars, you know, the animated ones with her in it?",
        "What's the deal with The Incredibles? Is it a superhero movie or more of a family film?",
        "Can you recommend a heart-wrenching romantic movie from the 1980-2000 period?",
        "I'm looking for a heart-wrenching drama set in the 1990s, any suggestions?",
        "Show me a heart-wrenching coming-of-age film from the 1980-2000 era, please.",
        "Can I stream any Batman movies on your platform?",
        "Are there any apocalyptic future movies available to watch?",
        "What movie featuring Tommy DeVito has received nominations for major awards?",
        "What is the name of the thriller movie with the song 'Sweet Home Chicago' performed by The Blues Brothers?",
        "I'm looking for a movie with a thrilling plot and a soundtrack similar to The Blues Brothers. Can you suggest anything?",
        "I heard there was a movie released in 2013 that received multiple nominations, can you tell me which one it is?",
        "Are there any showings for Ghostbusters in the next week?",
        "Have any coming of age films from the 90s been nominated for Academy Awards?",
        "Can you find a short film featuring Mickey Mouse",
        "Can you tell me about the well-deserved nominations for the movie No Country for Old Men",
        "I'm interested in knowing if Girl, Interrupted received any nominations or awards",
        "What were the award nominations for movies released between 1965-1970?",
        "Can you recommend a musical with epic musical compositions by David O. Russell?",
        "I want to know more about the movie with Daniel Craig that's similar to Blade Runner.",
        "Has any film received the New York Film Critics Circle honoree award?",
        "Which movie from 1985 received an honorable mention?",
        "Has Samuel Jackson ever directed an Oscar-winning film?",
        "I heard George Miller's latest movie is a must-see, did it receive any Oscar nominations?",
        "What movie with Samantha Phillips has won the most awards?",
        "Has any movie been honored at Cannes for its outstanding cinematography or acting performances?",
        "Can you recommend a movie featuring a robot uprising, starring Chris Hemsworth, and receiving critical acclaim for its special effects?",
        "Is the movie 'Where'd You Go, Bernadette' available on any streaming platforms in 2019",
        "Are there any chilling movies from 2019 directed by Richard Linklater that I can watch on streaming platforms",
        "Can you tell me which movie from 1953 won the most awards and nominations?",
        "I'm looking for a highly acclaimed movie from 1953 that received a lot of accolades, especially from the Academy. Can you recommend one?",
        "I heard that there's a classic movie from 1953 that was approved by almost everyone and received numerous awards. Can you tell me which one it is?",
        "Do you have showtimes for The Sixth Sense? I've heard it's a must-see and I'm a young adult looking for something new to watch.",
        "Can you suggest a movie with a captivating soundtrack that elevates the movie?",
        "What movie directed by Tim Story has a remarkable soundtrack?",
        "Are there any GP-rated movies with a memorable soundtrack that enhances the viewing experience?",
        "What's the best action movie with a subgenre of spy thriller?",
        "I'm in the mood for a comedy, but more specifically a romantic comedy. What's a great one to watch?",
        "I need to find showtimes for the new mockumentary film 'NR' and buy tickets ASAP",
        "Can I watch any TV-G movies on Netflix suitable for young children?",
        "Are there any family-friendly movies from the early 1980s available to stream on Disney+?",
        "Is Avatar with the song 'I Will Always Love You' available for streaming on Amazon Prime Video?",
        "Show me the trailer for the movie Bridget Jones's Diary, which was nominated for Best Picture.",
        "Has the movie Platoon, directed by Oliver Stone, been nominated for multiple awards?",
        "Can you tell me about a groundbreaking film on war themes, such as the movie X, and its nominations?",
        "I'm interested in a war movie that has been nominated for multiple awards. How about the film directed by Oliver Stone?",
        "Can you tell me about any Oscar nominations that the movie The Descendants received?",
        "I'm feeling nostalgic. Can you tell me which perfect movie won an Academy Award for Best Picture?",
        "I'm interested in learning about movies in which John Lennon was involved as a composer. Can you suggest any?",
        "Do you know of any movies featuring Sulley with music by Alexander Payne?",
        "Can I watch any of Patty Jenkins' movies on Netflix?",
        "What are some classic Alfred Hitchcock thrillers that are suitable for young adults?",
        "Can you recommend a suspenseful movie suitable for young adult males?",
        "I'm feeling nostalgic for a film about body swapping with a memorable score. Can you suggest one?",
        "Can you recommend a five-star movie with a special feature focused on The Blues Brothers?",
        "I am interested in knowing about the European Film Award winner in the past year.",
        "I heard The Departed had a lot of recognition for acting, can you tell me more about that?",
        "Tell me about the genre of The Lion King. Is it classified as an animated musical film, or does it fall under the adventure film subgenre?",
        "I'm curious about The Departed. Can you provide me with information on whether it's considered a crime film, or if it belongs to the gangster film subgenre?",
        "Are there any movies about corporate corruption that have won Golden Globes?",
        "Can I stream any post-apocalyptic world movies with parental controls?",
        "Are there any movies by Michael Moore available on streaming platforms?",
        "I'm in the mood for a movie featuring Ellen Ripley. Do you know where I can find one to stream?",
        "Can you recommend a mystery solving movie that Grace Walker received nominations for?",
        "Show me a film with a strong female lead that has received multiple awards and nominations.",
        "Can you tell me if any movies have won an award for Best Original Screenplay?",
        "I'm curious to know if the movie X has been nominated for any awards.",
        "Can you tell me if the film 'The Godfather' was Oscar nominated and how many awards it received?",
        "I'm feeling nostalgic. Do you have any information on Oscar nominated movies from the 90s?",
        "I'd like to know if 'Forrest Gump' won any Oscars. It's one of my favorite films from the 90s.",
        "Show me a movie with music composed by Andrew Lloyd Webber that has received awards and nominations.",
        "Do you know any time loop movies that are not too serious, like something Sofia Coppola would direct?",
        "Can you give me a brief summary of the plot for the movie The Dark Knight Rises",
        "I'm not sure where to find it, but is the movie Scar available for streaming on Disney+?",
        "I'm curious if there are any streamable movies on Disney+ that involve a character named Mark and are about cybercrime?",
        "I'm feeling really down right now. Can you tell me if a particular movie received multiple nominations for any awards?",
        "I'm curious about any awards or nominations received by movies that are considered spectacular. Can you provide some information on this?",
        "I'm looking for information on the actors in the film School of Rock. Who starred in it?",
        "Has The Lion King won any Academy Awards or received high praise from critics?",
        "Can you recommend an ocean adventure movie that I can watch on any platform? I'm open to any suggestions!",
        "Can I find any terrific revenge movies on any streaming platforms?",
        "I'm looking for a film montage, any recommendations on streaming platforms?",
        "Are there any promotions or special deals for watching J.J. Abrams' films from 2002?",
        "I'm curious if there's a sneak peek available for the upcoming Spider-Man movie, have you heard anything about it?",
        "Can you recommend any disaster movies that were nominated for awards?",
        "Is there a movie with a strong female lead in the subgenre X that would be appropriate for me to watch?",
        "I'm bored. Can you recommend a new movie with Dwayne Johnson in it and show me a sneak peek?",
        "Can I watch any R-rated historical movies on a streaming platform?",
        "Has Ron Weasley starred in any award-winning movies in the romance or history genre?",
        "Can you tell me about any award-nominated movies that depict the history of romance, maybe featuring Ron Weasley?",
        "Hey, have you seen the Golden Globe nominated trailer for any gangster movies from 1979 or 2008?",
        "Do you know if any gangster movies from 1979 or 2008 have received any awards or nominations?",
        "I'm curious, has there been any award-winning gangster movies from 1979 or 2008?",
        "I'm in the mood for a thought-provoking space exploration movie, can you suggest one?",
        "Can I watch any Anne Hathaway movies on Netflix, like a psychological thriller or an award-winning film?",
        "Are there any Dreamgirls movies available to stream for free for a pre-teen girl like me?",
        "What is a good movie from 2010 that I can watch with my family, maybe something with Anne Hathaway in it?",
        "Can you tell me if Interstellar is available on any streaming platform?",
        "I'm interested in finding out the streaming platform availability for Interstellar, could you provide that information?",
        "Did the movie directed by David Lee win any awards?",
        "Are there any nominations for the movie featuring Spock?",
        "I find it hard to believe that the movie with David Lee as the director received any awards",
        "Can you recommend a movie with a soundtrack featuring a reggae musician?",
        "Do you know if a movie directed by Damien Chazelle and with a mystique plot is streaming somewhere? I'm looking for something TV-MA.",
        "Hey, is there a Woody Allen film I can watch on a streaming platform that's based on a true story?",
        "Can you tell me if the film Gravity was honored with prestigious awards and nominations?",
        "I'm interested in knowing if the director Alfonso Cuarón has any movies that were honored with prestigious awards.",
        "Can you tell me if the movie Silver Linings Playbook received any Awards or nominations?",
        "I'm curious to know if Silver Linings Playbook has been recognized by industry peers for any accolades.",
        "Have there been any Awards or nominations for Silver Linings Playbook, and if so, could you provide me with some details?",
        "I'm looking for a survival thriller that will really keep me on the edge of my seat. Do you have any recommendations?",
        "Has any movie won multiple awards for Best Picture directed by Christopher Nolan",
        "I heard that the film 'Mean Girls' was nominated for an award, but can you confirm if it's for a remarkable achievement?",
        "Are there any alien invasion movies with Tina Fey in them that were approved by critics and received a nominated trailer?",
        "Is Gone Girl considered a thriller or a psychological thriller movie?",
        "Has The Departed movie won any awards for Best Director or Best Picture?",
        "Can you tell me if there are any Oscar-winning melodramas that have received impressive accolades?",
        "Which drama film has the most notable awards and nominations?",
        "Can you recommend a movie with an outstanding original score that was composed by Hans Zimmer?",
        "Show me a movie from the 1990s with a memorable original score that won an Oscar.",
        "Hey, can I watch Spy on any streaming platforms?",
        "Where can I find A Hard Day's Night to watch online?",
        "Can you tell me which movie features Celine Dion in a supporting role?",
        "Are there any low-rated movies in-cinema right now that showcase role diversity in the cast and crew?",
        "Do you have any recommendations for a movie directed by Zack Snyder that falls under a subgenre of action?",
        "Is American Beauty available for streaming? I heard it's a must-see for movie lovers.",
        "Can you recommend a movie with a surreal genre, preferably a subgenre that is emotionally resonant?",
        "I'm looking for a film that falls under the subgenre of The Avengers, but with a twist of fame. Do you have any suggestions?",
        "I'm very picky about the type of movies I watch. Can you suggest a film that combines the elements of fame and emotion, possibly falling under the surreal genre?",
        "I heard Park Chan-wook directed a new film, who are the actors in it?",
        "I'm looking for a movie with a stellar ensemble cast, any suggestions?",
        "What movie soundtrack did Justin Timberlake work on as a music producer?",
        "Can you provide me with information about the album release party for a movie soundtrack that Agent Smith was involved in?",
        "Show me a list of movies that have a soundtrack produced by Justin Timberlake.",
        "Can you recommend a melodrama film directed by Baz Luhrmann that has won multiple awards?",
        "I'm looking for a movie by Lars von Trier that has been nominated for an Academy Award.",
        "Show me a Francis Ford Coppola film with a high viewers' rating and has received prestigious awards.",
        "Can you tell me which movie from 1977 was recommended by viewers and received an Academy Award nominee?",
        "I'm feeling adventurous. Show me a film that received an Academy Award nominee for the song 'The Time of My Life'.",
        "Spoken movie query: \"What are the Awards and nominations received for the Golden Globe winner in the romantic comedy genre?\""
    ],
    "low-logprob": [
        "What film from 1984 has the most nominations and awards?",
        "I'm in the mood for a picky watch today. Can you recommend a documentary about the making of a highly compelling historical movie released between 1977-1982? I'm particularly interested in learning about the director's vision and any screenplay rewrites that took place.",
        "Are there any streaming platforms that offer Teen movies right now?",
        "I want to watch a movie with Mark Wahlberg and some cool jazz music in it, do you have any suggestions?",
        "Which movie with a 4-star rating has received the most nominations?",
        "I'm looking for a movie featuring Zoe Saldana that has a rating of NC-17",
        "I heard that drug trafficking is a theme in some movies. Can you recommend a film with a perfectly cast hero's journey?",
        "I'm freaking out, is the movie 'Yesterday' available for streaming anywhere? I need to watch it tonight!",
        "Can you suggest a movie that has a silent film vibe, maybe something from the 1920s or 1930s?",
        "Do you have any showtimes available for the new Marvel movie that just came out?",
        "Could you show me a musical film that includes the song My Sharona and is similar to Saturday Night Fever?",
        "What famous actors were in the movie Her that came out in 2011",
        "Could you provide the plot summary for the film noir classic 'Double Indemnity' released in 1944?",
        "I'm interested in historical dramas featuring Tessa Thompson, any suggestions?",
        "I need to find the most epic movie trailer of all time. Have you got any pre-release footage of The Karate Kid?",
        "I heard there's this phenomenal movie coming out soon, what's the scoop on the making of that one?",
        "Which movie from 2013 has a scene with Charlie Chaplin as a character?",
        "I'm looking for a solid documentary about the making of movies. Can you recommend a film with a behind-the-scenes focus?",
        "I'm looking for a movie about alien invasion directed by a female director, can you help me with that?",
        "I'm interested in watching a movie that has received numerous nominations and awards. Can you suggest one?",
        "Are there any movies that feature Professor Dumbledore in a prominent role that you can highlight for me?",
        "What movie did Vin Diesel star in as the lead role and who was the director",
        "What's the storyline for the movie Pulp Fiction?",
        "I'm looking for a movie with a one-star review that features Julia Roberts and the song Old Time Rock and Roll. Can you recommend one?",
        "Which movie features a character similar to Ron Weasley and has a soundtrack that appeals to middle-aged women?",
        "I'm looking for some thrilling musical arrangements in a movie. Can you recommend anything with EDM or rock and roll legend in the soundtrack?",
        "Can you recommend a captivating movie directed by John Woo?",
        "I'm desperate to see a happy movie with a suspenseful plot. Can you show me the theatrical trailer for The Lord of the Rings?",
        "Hey there, can you tell me if there are any showtimes for movies starring Natalie Portman?",
        "Do you have any movie footage of a zombie film with high ratings?",
        "Do you have any information on a movie from 2019 that explores the making-of computer hacking scenes in an educational way?",
        "What year was Toy Story 3 released in?",
        "I heard there's a movie with a really cool plot, can you tell me more about it?",
        "What's the synopsis of a movie about a robot uprising, possibly directed by Kevin Hart?",
        "Is there any documentary about the making of a film released in 2003?",
        "I'm interested in learning more about Staying Alive. Can you tell me about the making-of documentary for this film?",
        "Could you provide me with the director's commentary for the movie The Bodyguard?",
        "Can you tell me the genre and subgenre classification of the movie 'Not Rated'?",
        "Is there an exclusive look at the new World War II movie available on any streaming platform?",
        "I'm super excited to find out about the chilling spy movie that got an excellent rating. Can you show me a movie clip for it?",
        "Do you know any teen movies with high ratings?",
        "I'm looking for the top-rated Forbidden romance films from the 90s, are any available for streaming?",
        "I need to know the viewers' rating for the movie Identity theft from 2013, hurry up!",
        "What is the name of the movie where Steven Spielberg directed and the main actor has a great rapport with the director?",
        "I am interested in a formal synopsis of a promotional film released in 1969, can you provide that for me?",
        "Can you recommend a secret agent movie with an NC-17 rating that came out in the 90s?",
        "I'm looking for a movie with epic musical moments and action. Any suggestions?",
        "I need an engaging movie with an exciting plot, M.",
        "I'm looking for a movie teaser for a 2001 film with an adventurous plot, maybe something with treasure hunting or jungle exploration.",
        "Is the movie When Harry Met Sally available on any streaming platforms?",
        "Do you have any information about the behind-the-scenes of a film involving Michael Bay and a historical setting?",
        "Can you tell me the main actor in the groundbreaking movie R?",
        "I heard that there is a highly acclaimed movie featuring Kevin Spacey in a dramatic role. Can you tell me if it has won any awards or received nominations?",
        "What are the showtimes for the latest adventure movie with a plot similar to Frankenstein's Monster?",
        "Is there a movie about corporate espionage that has an intriguing trailer?",
        "Have you seen that family drama with Nada in it? Did it win any awards?",
        "I'm looking for a film with an amazing on-screen presence by the actress Zendaya and directed by a female director.",
        "I'm bored, can you tell me the plot of the movie Ghostbusters?",
        "What movie involves an undercover mission and is set during the Civil War era?",
        "Can you provide me with an exclusive look at the new movie featuring Adam Driver and Scarlett Johansson?",
        "Yo, can you hook me up with the trailer for that new high school drama movie?",
        "I'm curious, can I find any movies with Magneto in them on any streaming platforms? Maybe with some exclusive behind-the-scenes footage?",
        "Do you have any information about the movie featuring Gwyneth Paltrow and Lupita Nyong'o? I'm interested in learning more about the real-life stories behind the scenes.",
        "I'm looking for a film with a compulsive plot and the letter M in the title, can you help me?",
        "Can I buy tickets for the upcoming Boba Fett movie?",
        "I heard there's a commercial for the 2008 cult classic film clip, do you have any details or showtimes?",
        "Yo, where can I find the red band trailer for that new horror flick?",
        "I'm looking for a movie with an uplifting music soundtrack, something that really gets the heart pumping. Can you recommend something with music similar to Gwen Stefani's style?",
        "I'd like to know about Al Pacino's involvement in the making of the film 'Scent of a Woman'. Can you share some behind-the-scenes information?",
        "Can you show me the making-of featurette for the teenage classic 'Rebel Without a Cause'?",
        "What cult movie with an unrated classification has a captivating plot synopsis?",
        "I need to know if the vigilante justice movie is available on any streaming platforms right now, I really need to watch it.",
        "Have you seen the teaser trailer for that terrifying new horror movie?",
        "Show me a movie directed by Hayao Miyazaki with an intriguing plot.",
        "Hey, can you show me a visually stunning movie trailer with some intense katana action scenes?",
        "Can you play the trailer for the movie Dynamic, suitable for families with young children?",
        "Can you tell me about a movie that has some informative scene on computer hacking in 2019?",
        "Did the movie Joker receive any nominations for awards?",
        "I heard about a movie rated 1.5 out of X, what is it about?",
        "Can you recommend a movie with a forbidden love theme that has an appalling rating?",
        "I'm searching for a gripping film directed by Taika Waititi. Can you recommend something brilliant?",
        "Show me the trailer of a recent movie with a ghost in it.",
        "Can you give me a summary of the plot for The Pursuit of Happyness?",
        "Could you tell me about the soundstage where Jessica Chastain filmed a MA15+ rated movie?",
        "I'm not sure if I'm interested, but have you seen any movie clips featuring an undercover operation with Luke Skywalker",
        "Are there any unrated movies featuring strong female leads that middle-aged women would enjoy watching?",
        "Show me behind-the-scenes footage or interviews from any 1990s movies with Jennifer Aniston",
        "Could you show me a trailer for a family-friendly adventure movie with Shia LaBeouf?",
        "Can you tell me about the movie released in 2006, featuring Uhura and directed by someone famous?",
        "Which movie features a masterful portrayal of an actress by the name of Meryl Streep in a historical film set in ancient Rome?",
        "Show me a movie that delves into the costume design process, particularly with a focus on the letter 'U'.",
        "I was wondering if there's a movie with the perfect soundtrack for a hacker-themed party",
        "I need something new to watch, how about a documentary with an exciting storyline?",
        "I heard there was a movie with a thrilling trailer directed by James Cameron in 1997. Do you know the title?",
        "Spoken Movie Query 1: \"Wow, I need to find a movie with compelling performances from 2000 on a streaming platform. Are there any movies featuring Han Solo, Donkey, or the song 'Rainbow Connection' available?\"",
        "I find it hard to believe, but are there any great movies playing right now that I can watch?",
        "I'm curious if there are any critically acclaimed war dramas that Katy Perry has been involved in. Can you provide me with information on any awards or nominations received by these movies?",
        "I'm interested in getting a glimpse of a movie with Tom Hanks",
        "What is the specific subgenre of the movie Iron Man?",
        "Can I watch a trailer for the latest spy movie directed by J.J. Abrams?",
        "Hey, can you show me a sneak peek of any mystery movies from the 1950s directed by Alfred Hitchcock?",
        "Show me a movie from 1999 with a soundtrack that includes dance music.",
        "Can you tell me about the making of the movie Hallelujah that was directed by Alfonso Cuarón?",
        "I'm looking for a movie that's a bit picky and has a musical comedy flair like Mamma Mia!, with some interesting making-of tidbits.",
        "Is there a PG-rated movie that has a well-developed synopsis and was popular with middle-aged women?",
        "Could you please show me a teaser for the movie Pocahontas?",
        "I'm interested in watching a war drama from 2011, can you check if 'X' is playing anywhere nearby?",
        "Show me a glimpse of the Rocky Balboa film, please.",
        "Can you recommend a movie with a great dance soundtrack from the mid 2000s?",
        "Can you recommend a movie similar to A Star is Born, with exceptional reviews and numerous awards and nominations",
        "Hey, can I get an advance look at that movie with Cathy Yan directing? I heard it has superb casting!",
        "Could you please show me the trailer for the latest Joker movie starring Joaquin Phoenix?",
        "What are the top-rated spy movies from the 1970s with J.J. Abrams as the director?",
        "Hey, what's the plot of that dance movie with the terrific storyline?",
        "Hey, who directed that heist movie from the 1970s with Drake in it?",
        "I'm trying to decide what to watch. Do you know if the movie Ant-Man is available on any streaming platforms?",
        "Can you tell me who the versatile actors are in the movie School of Rock?",
        "I'm interested in finding a movie similar to The Incredibles, but with a different genre. Any suggestions?",
        "May I inquire about the showtimes and ticket availability for any movie related to political conspiracy?",
        "I'm feeling hopeful about finding a thought-provoking movie. Could you recommend any eye-opening documentaries about cybercrime?",
        "Can you recommend a movie directed by Lana Wachowski with a PG-13 or R rating? I'm open to any genre.",
        "Is there a TV-MA historical heist movie that offers a behind-the-scenes look at the making of the film?",
        "Spoken Movie Query: \"Can you recommend a movie similar to Deadpool with a high viewers' rating?\"",
        "I'm curious to know if there are any highly-rated movies involving a character named Fiona.",
        "Hey, has Grace Walker ever won any awards for her acting?",
        "Can you recommend a well-executed movie directed by Jordan Peele with an impeccable plot?",
        "Could you show me some movies with an innovative and innovative subgenre type, like the one with the character Scar from 1987?",
        "Can I see a teaser clip for a gripping Gothic movie from 1975-1980?",
        "I'm interested in a movie with an outstanding supporting cast, can you recommend one?",
        "Hey, do you have any movie trailers with jaw-dropping visual effects and some wicked katana action?",
        "I need a movie recommendation that's really touching. I'm a fan of Hugh Jackman, so something with him in it would be great.",
        "Can you tell me who directed the movie where Will Smith made his film debut in 1983?",
        "Which fantasy movie directed by Ron Howard has won the most awards and nominations?",
        "Are there any streaming platforms that have movies with decent reviews and a phenomenal rating?",
        "I'm feeling indecisive, but do you have a teaser for a game-changing film with the song 'I Don't Want to Miss'?",
        "Can you recommend a gangster movie that won multiple awards and nominations? I want to watch something with a lot of recognition.",
        "Has the movie Terms of Endearment won any awards or nominations?",
        "Which movie has been recognized with prestigious accolades for its outstanding cinematography?",
        "Who was the set designer for the latest Vin Diesel movie release",
        "What NR films have a compelling plot synopsis worth watching?",
        "I'm looking for an entertaining movie like Mamma Mia! with some smooth behind-the-scenes details. Can you suggest one?",
        "Can you recommend an empowering biographical movie about a historical figure?",
        "I'm not sure what I'm in the mood for. Can you show me a movie with an awesome EDM soundtrack?",
        "Is there a movie from 1988 with Winona Ryder in it that's directed by a female filmmaker and rated R?",
        "What is the viewers' rating for the latest Star Wars movie directed by J.J. Abrams?",
        "Is there a film that has some interesting behind-the-scenes stories, maybe directed by someone like Akira Kurosawa?",
        "Who directed the movie that features the song 'Smooth'? I'm interested in knowing more about the making-of details.",
        "Could you find out if the movie Can You Feel the Love Tonight has won any awards or nominations?",
        "I'm really interested in learning more about the making of the film Arrival. Could you provide me with the director's commentary and some behind-the-scenes details about the cinematography?",
        "What's a surreal family dynamics movie from 1994 that's not rated?",
        "Hey, I heard there's an excellent movie with Rey in it. Can you tell me the viewers' rating for it?",
        "Could you provide me with the showtimes and ticket availability for the movie Unforgettable directed by Clint Eastwood?",
        "Is there an action movie starring Tilda Swinton that is rated MA15+ and features some interesting behind-the-scenes footage?",
        "Can you give me a brief preview of the plot for Mr. Incredible?",
        "Can you tell me about a movie with a well-cast featuring Hugh Jackman in 2015?",
        "I'm interested in learning more about the making of a new action thriller film. Can you provide me with some behind-the-scenes details, such as the director and the MPAA rating?",
        "Spoken Movie Query: \"Can you provide information about the cinematography of The King's Speech film?\"",
        "Is there a TV-MA movie directed by Judd Apatow that I can watch?",
        "Can you give me a brief summary of the plot for The Social Network movie?",
        "I'm in the mood for something spooky, do you have any recommendations for movies with supernatural creatures in them?",
        "Can you give me a brief summary of the plot for the movie released in 2018?",
        "What is the viewers' rating for the latest sci-fi movie released this year?",
        "Do you know if there's a spy movie called Fiona with good ratings?",
        "Can you recommend a comedy movie with a touch of emotional rollercoaster?",
        "Can you give me a sneak peek at the trailer for the new Ryan Gosling movie coming out?",
        "I heard there's a new film coming out with Zendaya and Tom Holland, do you know if it's a PG-13 movie?",
        "Can you recommend a PG-rated movie from 1999 with a great dance soundtrack?",
        "Which movie featuring The Joker has been honored with multiple nominations?",
        "I heard there's a GP-rated movie with Gilderoy Lockhart in it. Can you tell me more about it?",
        "I'm indecisive about what type of movie to watch. Can you suggest a film from 1998 with Octavia Spencer and known for its great reviews?",
        "Hey, can you tell me if there are any showtimes for a well-paced and tightly edited movie from 1962?",
        "Can I find a movie with awe-inspiring cinematography featuring Denzel Washington on any streaming platform?",
        "Are there any reviews available for the film 500 Days of Summer's teaser?",
        "Can you recommend a movie with a subgenre related to adventure and mystery in the year 1977?",
        "Can you provide a teaser clip of the film Titanic and give me a brief synopsis of the plot?",
        "Who was the costume designer for the latest Mission: Impossible movie starring Ethan Hunt?",
        "I'm looking for a teaser of a movie that will make me happy, any suggestions?",
        "What can you tell me about the plot of the 1986 Dracula movie with the PG rating?",
        "Can you recommend a movie from 2013 with some provocative musical choices?",
        "Could you show me a list of award-winning animated movies from Danielle Taylor?",
        "Has A.R. Rahman received any awards for his work in movies?",
        "Is there a teaser for a movie with a compelling narrative that will be released soon?",
        "Can you provide some background on the art direction in the latest spy film featuring Jane Smith?",
        "Can you tell me who the set designer was for the movie The Departed directed by Brian De Palma?",
        "Can you recommend any environmental movies that are considered mockbusters?",
        "Can you tell me the plot of a multilayered science fiction movie with a G rating?",
        "I'm curious about the making-of details of Ben-Hur from 1996, can you share some behind-the-scenes information with me?",
        "What are some movies with a mafia theme that feature Al Pacino as the lead actor?",
        "I'm looking for a movie with a mature theme, something along the lines of a psychological thriller.",
        "I'm looking for a GP movie with some breathtaking action scenes - got any recommendations?",
        "Can you tell me the Plot of any action movie with at least an A rating ?",
        "Are there any outstanding movie showtimes for Thor this weekend?",
        "Can you tell me where to find a TV-MA movie trailer for an unbelievable spectacle",
        "I'm looking for a movie with a plot that will make me laugh, maybe something by Mel Brooks.",
        "I'm looking for movies directed by Robert Rodriguez that I can stream. Any recommendations for a non-binary young adult?",
        "Could you recommend a film deserving of accolades for its compelling storyline and exceptional acting?",
        "Do you have any information about the R-rated film starring Luke Skywalker?",
        "What genre of movies does Brian De Palma usually direct, and can you show me a trailer from one of his films?",
        "Who directed the movie Into the Woods and what is the MPAA rating?",
        "Are there any mafia family films that are actually worth watching on any streaming service?",
        "I'm curious, what genre does The Social Network fall under and how was it received by viewers?",
        "I'm looking for a movie with an impeccable director like Jordan Peele, that has received well-executed reviews. Can you suggest one?",
        "Can you recommend a movie with a disco soundtrack that adds excitement to the scenes?",
        "I'm interested in finding a behind-the-scenes featurette for a movie directed by Ryan Gosling. It has to be really in-depth and compelling, with lots of details about the production process. Got anything like that?",
        "I heard about this magnificent movie from 1998-2004, can you tell me if it's worth watching?",
        "I'm looking for a superb movie directed by Morpheus. Can you help me find one?",
        "Hey, can you play a preview of the soundtrack for the movie M?",
        "I'm looking for the showtimes and ticket availability for the movie Braveheart, which is considered a classic in the film industry.",
        "Can you recommend a science fiction movie directed by Andrea Arnold that is suitable for pre-teens, but not rated NR?",
        "What M-rated film has the most thrilling plot of all time",
        "I'm curious about a movie involving human cloning and a subtle psychological thriller, maybe something from 2010.",
        "Are there any showtimes for a movie with amazing music and high ratings?",
        "I'm looking for a movie with the song 'We Will Rock You' that came out in 2001. Can you show me a teaser?",
        "Can you tell me about the set designer for the movie with underwhelming performances",
        "Can you show me a teaser for the new science fiction movie with a solid performance by the lead actor?",
        "I'm looking for a movie with soul-stirring musical arrangements, directed by Francis Ford Coppola. Do you have any recommendations?",
        "I'm looking for a movie with an enchanting music soundtrack, do you have any recommendations?",
        "Yo, show me a movie preview that's as exciting as a rollercoaster ride and has the same thrill level as Mission Impossible.",
        "I'm feeling down, please recommend a movie where Patrick Bateman is the main character.",
        "I'm so bored, is there a Martin Scorsese movie with a great plot available on any streaming platform?",
        "Show me a movie featuring Cameron Diaz that has a captivating plot",
        "Is Black Widow worth watching? I heard it has an impressive rating.",
        "Can you recommend a behind-the-scenes documentary about the making of I Feel Pretty?",
        "Spoken movie query: \"Can you tell me the Awards and nominations received for the romantic comedy genre film The Silence of the Lambs?\"",
        "What genre does the Idris Elba film 'Beasts of No Nation' fall under?",
        "I need a sneak peek of an unmissable action movie. Can you show me a cool trailer?",
        "Hey, can you show me a charming clip from The Grand Budapest Hotel?",
        "Yo, I'm looking for a movie teaser that's a real masterpiece with some epic katana fight scenes. Got any recommendations?",
        "I'm bored, can you tell me if the movie starring John Legend received any awards or nominations for its soundtrack?",
        "Show me a behind-the-scenes analysis of the production process for the PG-rated movie directed by the cinematographer of The Bodyguard.",
        "I'm looking for a movie with a captivating plot from 2016 that has received rave reviews. Can you suggest one?",
        "Hey, can I watch Deadpool on any streaming service? I'm feeling nostalgic for some classic Ryan Reynolds comedy.",
        "I'm feeling nostalgic for some old movies featuring Lando Calrissian, can you suggest some?",
        "Can I find the groundbreaking movie 12 Years a Slave on any streaming platform?",
        "I'm really stressed about finding a theater with the most recent box office hits. Can you help me with that?",
        "Can you give me a quick overview of the plot for a movie with an undercover operation in it?",
        "Is Scarlett Johansson starring in any new movie with a synopsis available?",
        "I'm interested in a movie directed by Stanley Kubrick - maybe something with a synopsis. Do you have any recommendations, perhaps including the song You Never Can Tell?",
        "Can you provide me with the making-of details for the space opera film from the 2020s that received a B+ rating?",
        "I need to find a good movie to watch right now, something with a moving plot and great reviews. Can you recommend anything involving Legolas?",
        "Hi, can you tell me the showtimes for the movie 'Fiona'?",
        "Once showtimes for Steven Spielberg's adventure movie playing at the cinema?",
        "Do you have any footage from the Bruno Mars movie?",
        "Hey, what kind of movie is Dracula? Like, is it a horror or more of a supernatural thriller?",
        "I'm interested in learning about the making-of process for the G-rated animated film Toy Story, could you provide me with some details?",
        "Spoken Movie Query: \"Could you show me behind-the-scenes footage of a movie with Robert Downey Jr. in it?\"",
        "What is the viewers' rating for the movie starring Mel Gibson with a revenge plot?",
        "I'm looking for a movie with great reviews and ratings, perhaps involving footage from 1998. Can you help me with that?",
        "How engaging is the movie Nine to Five really? I've heard mixed opinions.",
        "Are there any exceptional behind-the-scenes documentaries about the making of Jim Carrey's movies?",
        "Hey, what's a really exciting movie from the late 1990s that's rated PG-13?",
        "I'm in the mood for an adventure film, preferably with a subgenre that involves pirates or treasure hunts.",
        "Hey, can I watch any entertaining movies by Wes Anderson on any streaming platform?",
        "Show me a movie directed by Spike Jonze with a great soundtrack from the year 1983.",
        "I'm wondering if the new Spider-Man movie has any familiar faces from other Marvel films, have you heard any casting news?",
        "Hey, can you show me a teaser for the new Puss in Boots movie?",
        "I'm looking for an unforgettable movie with a heartwarming plot. Do you have any recommendations?",
        "Show me a teaser trailer from the 80s for a war movie that has stood the test of time.",
        "Hey, can you show me a preview of that new sci-fi movie with an unmissable trailer?",
        "I'm interested in learning more about Taxi Driver - do you have any behind-the-scenes footage or interviews with the director available?",
        "I'm feeling down and could use a good movie to lift my spirits. Can you recommend a movie with a NR rating and a Montage scene?",
        "Can you tell me about the making-of documentary for the latest James Bond film with the code name M?",
        "Hey, I heard people really loved the crime spree movie, is it true?",
        "Can you recommend a behind-the-scenes documentary about the making of an eye-opening movie about space exploration?",
        "Could you recommend a documentary that explores the impressive behind-the-scenes work involved in bringing Anne Bancroft's character to life?",
        "I'm interested in movies with a love triangle plot. Can you recommend films similar to this theme, perhaps something akin to the romance genre in Poe Dameron's character arc?",
        "I'm curious if La La Land received any awards, it seems like a popular film",
        "Can you show me a teaser for the movie Dreamgirls and also provide some behind-the-scenes location scouting analysis?",
        "Hey, can I watch Jaws on any streaming platform?",
        "Hey, can you tell me about any PG-13 movies from the late 80s to early 90s that have a behind-the-scenes look at the sports industry?",
        "I'm looking for a mesmerizing movie teaser to watch. Any suggestions?",
        "I'm in the mood for something happy and light-hearted. Can you recommend a B movie that goes behind-the-scenes of a feel-good story?",
        "Can you recommend a movie with instrumental music that will leave me overwhelmed? Maybe something with the song 'Stayin' Alive' in it?",
        "What film from the 2000s has a thrilling plot and a really cool teaser?",
        "I'm interested in learning more about the CGI and animation in the movie 'Beauty and the Beast'. Can you provide some behind-the-scenes details?",
        "Spoken Movie Query: \"Can you recommend a well-reviewed movie with perfectly paced action and adventure, targeted for pre-teen girls?\"",
        "Is there an unrated movie directed by Joe Wright that has elements of both comedy and psycho-thriller?",
        "Can I watch Borat on any streaming platforms?",
        "Is there a film with Alfred Hitchcock's music that you'd recommend?",
        "Can I watch any Judd Apatow movies on any streaming platforms right now?",
        "Who directed the PG-rated movie The Terminator and who are the main cast members?",
        "What subgenre does the movie 'Tinker Tailor Soldier Spy' fall into, and is it similar to the Jason Bourne series?",
        "\"Can I see some pre-release footage of the new Tim Burton film with an animal adventure theme?",
        "I'm looking for a movie about corporate corruption that got a perfect score from critics. Any suggestions?",
        "Can you recommend any 1994 sci-fi movies that are worth watching?",
        "Is there an extended preview available for the latest George Lucas film?",
        "Which movie with a 8.5/10 rating has received the most awards and nominations in the family drama genre?",
        "Can you give me a synopsis of any travel movies directed by Channing Tatum involving betrayal?",
        "Can you provide information on any movies with underwhelming performances by the cast?",
        "Are there any G-rated movies from the past that have a fantastic Adventure theme song?",
        "I'm not sure if I want to watch a movie with excellent chemistry between the actors. Can you recommend a film?"
    ],
    "sentences": [
        "Can you tell me the name of the biopic film that features the song 'Mamma Mia!'?",
        "I'm looking for a behind-the-scenes documentary about a treasure hunt movie released in the past decade.",
        "Can I watch Forbidden romance on any streaming platforms?",
        "Is The Princess Bride available to stream anywhere? I really need a pick-me-up.",
        "Could you tell me about any electrifying psychological thrillers from 2017 that involve an undercover operation?",
        "Did Jon Favreau direct any movies that have won the Cannes Grand Prix?",
        "Are there any movies suitable for a pre-teen girl that have won awards at Cannes?",
        "I'm interested in a Civil War movie with a captivating score. Do you have any recommendations?",
        "Can I find a trailer for any romantic movies from the 1980s or 1990s?",
        "Can you tell me the plot of any family-friendly movies released between 1945 and 1955?",
        "When You Wish Upon a Star, is there a movie suitable for pre-teens showing this weekend?",
        "Who directed the making-of documentary for Star Wars and what year did it come out?",
        "Who composed the music for the movie The Lion King",
        "Hey, I'm bored. Can you tell me if 'Zombieland' with Emma Stone is available on any streaming platforms?",
        "I need something to watch. Is there a romantic comedy movie starring Emma Stone that I can stream right now?",
        "Who directed the film The Fugitive and what makes the casting exceptional?",
        "Can you tell me if Dorothy Gale appears in the movie Aashiqui 2, which actor stars in it and is it considered perfect by viewers?",
        "I'm looking for a movie that features song snippets in the background",
        "Can you highlight the plot of any heartfelt crime dramas with a 5-star rating that came out in 1995?",
        "I'm looking for a film set in the prohibition era, with unparalleled direction and a significant nod from the critics.",
        "Has the movie Cassidy Davis, released in 2015, won any awards at film festivals?",
        "Can you tell me about any awards or nominations received by the movie Cassidy Davis, which was released in 2015 and won at a film festival?",
        "I'm interested in finding out if the film Cassidy Davis, from 2015, has garnered any festival wins or nominations.",
        "I heard about a film set in the 1670s. Do you know who directed it? I think it's called This is Spinal Tap.",
        "Can I find any 2019 movies by Richard Linklater to stream that are considered a must-see",
        "Can you tell me who directed the movie 12 Angry Men that was released between 1965 and 1970?",
        "When was The Social Network trailer released and what is the MPAA Rating for the film?",
        "Can you give me a brief summary of the plot for any action film released between 1995 and 2000?",
        "Do you have any clips or a sizzle reel for a movie with Leonardo DiCaprio in a complex narrative?",
        "Have you heard of any electrifying movies from 1992 to 1998 that got really good ratings?",
        "Who directed the movie Superman and is Peeta Mellark in it?",
        "Could you recommend a breathtaking movie released between 1970 and 1980?",
        "I'm feeling pretty down. Could you recommend a movie review or rating for Gone with the Wind to cheer me up?",
        "Can you recommend any classic sci-fi thriller movies from the 1940s or 1950s that are restricted?",
        "Hey, can you give me a quick rundown of the plot for any Francis Ford Coppola movie?",
        "Have you seen any movies featuring Gal Gadot with well-developed plotlines?",
        "I'm looking for a movie about a girl who overcomes obstacles and achieves her dreams, maybe related to sports or something like that.",
        "Can you recommend a movie featurette that reveals the behind-the-scenes makeup and hairstyling process?",
        "Could you recommend any sports movies with remarkable casting?",
        "Are there any 1920s period dramas directed by Michael Bay?",
        "Can you recommend a movie with a beautiful music score and emotional soundtrack?",
        "What genre of movies does Patty Jenkins typically direct that would appeal to middle-aged women?",
        "Hey, who directed that cool movie about corruption in the 2010s?",
        "Can you tell me the plot of a movie with a spectacular and dense plot released between 1995 and 2005?",
        "I'm interested in a movie from the late 90s with a captivating plot. Can you give me a synopsis of such a film?",
        "Can you give me a brief overview of the plot for the action movie released between 1970 and 2010 with a great teaser trailer?",
        "I'm looking for a mystery movie with an intriguing plot released between 1970 and 2010, and could you show me a teaser for it?",
        "Can you tell me which movie won the European Film Award recently and the number of nominations it received?",
        "Hey, has The Artist received any awards or nominations for its amazing acting?",
        "Have any movies about an undercover agent won big awards recently?",
        "I'm really sad. Can you tell me when the trailer for the upcoming Mr. Incredible movie will be released?",
        "Are there any 1960s movies with strong female characters available for streaming?",
        "Can you provide me with information about any NC-17 rated movies released between 1960 and 1965 that are in the film noir genre?",
        "Can you tell me if Emma Stone starred in any horror-thriller movies between 2005 and 2010?",
        "Who directed the movie involving drug trafficking and a hero's journey that was released between 2005 and 2010?",
        "Has the movie Philadelphia received any awards or nominations?",
        "Show me a movie directed by Paul Feig that I can stream with parental controls.",
        "Who directed the movie Saving Private Ryan?",
        "Hey, I'm so bored. Can you tell me where I can stream Midsommar with parental controls?",
        "Which movie directed by Christopher Nolan won a Goya Award and is celebrated by award committees?",
        "Yo, has Javier Bardem's breakthrough performance in Joker been acclaimed in the awards circuit?",
        "Yo, was Joker rated NR despite its acclaimed performance in the awards circuit?",
        "Can you recommend a hip hop movie with an amazing soundtrack from a film directed by Edgar Wright in the last decade?",
        "I'm looking for a movie with an outstanding hip hop soundtrack, can you suggest me a film with an F rating?",
        "Can you tell me if Aladdin has won any People's Choice Awards",
        "I want to watch a must-see movie that won multiple Awards like The Bridge on the River Kwai",
        "Can you tell me about any awards or nominations the movie Ex Machina received in 2014",
        "Can you recommend any coming-of-age films directed by Steven Spielberg?",
        "I'm curious to know the plot synopsis of any R-rated movie released between 1960 and 2020",
        "Hey, I heard that Meryl Streep won a lot of awards for her role in The Iron Lady. Can you tell me which awards she received for that movie?",
        "I love Leonardo DiCaprio in Titanic, but did Jack Dawson win any awards for his performance? Or maybe the movie itself?",
        "Can you recommend a monster movie released between 2002 and 2005 with a PG-13 rating?",
        "I would like to know more about the plot of the movie A Whole New World, can you provide a summary?",
        "I'm looking for a G or PG rated film that delves into the making-of process of a critically acclaimed Anne Bancroft movie.",
        "Is Stayin' Alive available to stream on any platform?",
        "I'm looking for a musical composition featured in a movie from 1999, can you help?",
        "Are there any unrated movies available to stream?",
        "Can you tell me about any science fiction movies that offer rare behind-the-scenes glimpses?",
        "Can I watch the trailer for any movie released between 2010 and 2015?",
        "Which critically acclaimed movies from 1980 to 1985 have Yorgos Lanthimos directed?",
        "I'm interested in learning more about a popular movie involving dinosaurs. Can you provide me with the plot details?",
        "Can you show me the teaser trailer for any compelling neo-noir movies released between 2010 and 2020?",
        "Can you tell me about the making of a movie from the 1970s or 1980s that was directed by a legendary filmmaker?",
        "What are some captivating historical dramas from the 2000s?",
        "I'm not sure about the film The Time of My Life. How can I find out if it's worth watching?",
        "Could you showcase the trailer of a terrific true crime movie with an amazing 95% audience score that came out in 1972?",
        "What R-rated movies from 1972 are available on streaming platforms?",
        "Could you play the trailer for the latest Idris Elba movie?",
        "I'm looking for a movie with an intriguing plot involving Christian Bale and Emma Watson. Do you have any recommendations?",
        "Could you find me a list of Gotham Awards recipients for the years 1960-1962?",
        "Which film was the winner at the Berlin International Film Festival featuring a strong female lead?",
        "Are there any streaming platforms that have the movie Lady Bird available for senior citizens?",
        "Is the movie Kiss the Girl available for streaming? I'd like to watch it with my fellow senior citizens.",
        "Can you tell me if there were any movies between 1990 and 1995 that received outstanding awards?",
        "I'm curious about the reviews for Terry Gilliam's films released between 2012 and 2015. Can you tell me the ratings for any of them?",
        "Is there a movie about Buzz Lightyear with no rating for me to watch?",
        "I'd like to know if Interstellar is accessible on any streaming platforms, what can you tell me about it?",
        "Can you tell me if the movie \"The Shape of Water\" received any awards or nominations for its romantic fantasy genre?",
        "Hey, can I get an exclusive look at a biopic on La La Land that's available on any streaming platform?",
        "What movie is currently playing that appeals to a wide audience regardless of gender?",
        "Who directed the movie The Princess Bride and what was the year of its release?",
        "Could you recommend a film from 2018 that received prestigious awards and nominations?",
        "Can you tell me about any movies with 5-star ratings that received high praise for their visual effects?",
        "I'm looking for a film released between 1995 and 2000 that was directed by James Cameron and starred Al Pacino. Also, do you have any G or PG-rated movies that fit that description?",
        "Can you tell me the plot of any satire film released between 2010 and 2020?",
        "I'm interested in finding out if there are any successful movies that combine war themes with drama. If so, have any of them been recognized with awards or nominations?",
        "Is it true that the movie 'Arrival' received an Academy Award nomination for Best Director?",
        "Has any movie with a solid track record in awards recognition come out between 1983 and 1986?",
        "I'm desperate to watch 'I Don't Want to Miss'! Can you please show me the trailer and tell me where I can find it to stream?",
        "Are there any solid spy movies from the 2010s to the 2020s available for streaming?",
        "I'm interested in learning more about the behind-the-scenes details of any movies made between 1960 and 1990.",
        "What's the best movie with a rating of 8/10 directed by Mike Leigh?",
        "I'm curious if there are any highly lauded movies that were Golden Globes or Festival winners.",
        "I heard great things about the new animated film - any showtimes available?",
        "I'm curious to know if the movie with the song 'Let It Go' has won any Academy Awards and nominations.",
        "Spoken movie query: \"I'm looking for the pickiest heist movie that has won a Golden Globe. Can you help me with that?\"",
        "Can you tell me if any movie directed by Kenneth Branagh and starring Emma Thompson has received significant awards or nominations?",
        "Can you tell me about any behind-the-scenes details of movies released between 1963 and 1968?",
        "Show me some behind-the-scenes footage of Gwyneth Paltrow's films from 2003 to 2008.",
        "Can you provide information on any masterful portrayals by actors in the cult ritual film The Blues Brothers?",
        "Can you find production featurettes for the movie directed by David Yates that features Hermione Granger as a main character?",
        "Are there any on-location shooting films starring Viola Davis?",
        "Is the movie Inception available on Prime Video?",
        "Can I watch any foreign language films on Prime Video?",
        "Are there any classic Disney animations on Prime Video?",
        "I need information on the box office availability of a fantastic movie released in 2007.",
        "Can you recommend a movie with top-notch performances by Leonardo DiCaprio and directed by Martin Scorsese?",
        "Where can I find a film with top-notch performances by Meryl Streep and Tom Hanks?",
        "I'm looking for a movie known for top-notch performances by the entire cast, especially the lead actor and actress.",
        "I need to know if Black Widow won any awards, like now!",
        "Did Nomadland get any nominations? I don't have all day!",
        "Tell me, what awards did Jamie Foxx win in 1956? I'm in a hurry!",
        "Is there a mystery movie suitable for families with young children that came out in the same year as The Terminator?",
        "Can you tell me who directed the historical reenactment film set in the 1960s?",
        "Show me a movie about a midlife crisis that features the actor from Assassin's Creed.",
        "What movie is Annie known for, and who directed it?",
        "Can you recommend a movie with a detailed director's commentary for the character Severus Snape?",
        "I'm interested in finding a movie featuring behind-the-scenes insights about Severus Snape's character. Can you help?",
        "Is there a movie with a director's commentary that delves into Severus Snape's role in the film?",
        "Can you tell me who directed the martial arts film that follows the hero's journey in a remote village in China?",
        "Show me a movie where the main character goes on a hero's journey to master martial arts and save their family from a crime syndicate.",
        "I'm looking for a film with an iconic martial arts scene, featuring the hero's journey of a young boy who becomes a legendary fighter.",
        "Can I watch Eternal Sunshine of the Spotless Mind on any streaming platforms?",
        "Show me the teaser trailer for a movie featuring Jon Snow",
        "Are there any movies from the early 1990s available for streaming?",
        "Can you recommend a movie with incredible acting by Emma Watson and a brilliant director?",
        "Yo, where can I find the Indiana Jones movies to stream?",
        "Hey, is there a streaming platform with West Side Story on it?",
        "Can you tell me if the movie The Hunger won any awards or received nominations?",
        "I'd like to know if the movie Cross Creek, released between 1983 and 1986, received any awards or nominations.",
        "Is Spider-Man: No Way Home available for streaming on any platform for middle-aged women?",
        "Has any movie directed by Amy Sherman-Palladino received an impressive track record in awards?",
        "Which award-winning neo-noir film was directed by Jonathan Demme and received a 1/10 rating?",
        "Hey, what's the deal with The Shawshank Redemption? Did it win any major awards?",
        "I heard Lady Gaga is starring in a new film directed by Oliver Stone. What's it about and has it received any nominations yet?",
        "I'm feeling really down today. Can you tell me if Laura Dern has won any awards for her role in the movie Crime Spree?",
        "I'm feeling pretty blue. Has the movie William Wilson been nominated for any awards?",
        "Has the movie Blade Runner 2049 won any awards or nominations",
        "I'm looking for a decent cyberpunk film from 2006 that was recognized with awards or nominations",
        "Yo, did that new flick win any awards or get nominated for anything? I'm talkin' like, the Independent Spirit Award recipient or somethin' like that.",
        "Is there any X movie that cleaned up at the awards? Like, did it win anything or get nominated for anything big?",
        "can you tell me about the set design of the newest animated family movie",
        "who was the set designer for the latest fantasy movie for families",
        "Can you recommend a film directed by Patty Jenkins that has strong family dynamics?",
        "I'd like to see an extended trailer for the film Inception",
        "Do you have any featurettes for movies directed by Danny Boyle?",
        "I'm feeling a bit down right now. Could you show me a movie preview that will cheer me up a bit?",
        "I'm in the mood for something that will lift my spirits. Can you recommend an official trailer for a feel-good movie?",
        "I'm feeling a little blue. Do you have any promos for movies that could brighten my day?",
        "What is the directors' rating on The Sixth Sense, and can you provide any making-of details?",
        "Can you tell me which movie directed by Danny Boyle was awarded for its outstanding performances?",
        "Show me a promo for a disaster movie released between 1965-1970",
        "What movie from the 1965-1970 period received the most awards and nominations?",
        "What is the MPAA rating for the movie in the genre Science Fiction that I can watch with my friends?",
        "I'm looking for a movie with some exclusive behind-the-scenes footage, maybe something like Crazy Heart.",
        "Can you tell me about the casting process for the movie Whiplash?",
        "What is the plot of the movie starring Christian Bale and Emma Watson?",
        "Is there an Adam Sandler movie that's TV-G on any streaming service?",
        "Can you tell me about the making-of the film Titanic",
        "I always feel so sad thinking about how Heath Ledger's performance as the Joker in The Dark Knight came to be. Can you share some behind-the-scenes information about it?",
        "I'm feeling down and could use a good cry. Do you have any information about the making-of the movie Schindler's List?",
        "Is the movie Moulin Rouge! available to stream on any platform?",
        "Can I watch any Alicia Vikander movies on streaming services?",
        "Are there any popular movies from the 1970s currently streaming online?",
        "What's a great movie to watch when you're bored, something in the same genre as Black Swan?",
        "Who directed The Grand Budapest Hotel and what genre does it fall under?",
        "I heard The Grand Budapest Hotel has a fantastic soundtrack. What song from the movie do people love the most?",
        "Can you tell me some of the actors in The Grand Budapest Hotel and their performances in the film?",
        "Can I watch a trailer for a romantic comedy with terrible ratings?",
        "Show me a movie trailer with Gal Gadot involving betrayal and time travel",
        "Is there a Johnny Depp movie similar to The Great Gatsby that has a teaser available?",
        "Is there a movie with political corruption that has received high viewers' ratings?",
        "Is Black Panther available on any streaming platforms right now?",
        "What is the genre of the movie Professor, and can I find it on any streaming platforms?",
        "Has Leonardo DiCaprio ever starred in an NC-17 film, and can I watch it on any streaming platforms?",
        "I heard that there were some controversies during the making of a Colin Firth film at a Hollywood studio, can you give me some details about it?",
        "I have my doubts about the authenticity of the behind-the-scenes footage from a Hollywood studio for a recent movie. Can you show it to me?",
        "Can you tell me which movie won the most awards for fantasy-comedy genre?",
        "Could you provide me with a list of courtroom dramas released in 2016 that were nominated for major awards?",
        "Yo, I'm looking for some movies with Hera Syndulla from Star Wars, you know, the animated ones with her in it?",
        "What's the deal with The Incredibles? Is it a superhero movie or more of a family film?",
        "Can you recommend a heart-wrenching romantic movie from the 1980-2000 period?",
        "I'm looking for a heart-wrenching drama set in the 1990s, any suggestions?",
        "Show me a heart-wrenching coming-of-age film from the 1980-2000 era, please.",
        "Can I stream any Batman movies on your platform?",
        "Are there any apocalyptic future movies available to watch?",
        "What movie featuring Tommy DeVito has received nominations for major awards?",
        "What is the name of the thriller movie with the song 'Sweet Home Chicago' performed by The Blues Brothers?",
        "I'm looking for a movie with a thrilling plot and a soundtrack similar to The Blues Brothers. Can you suggest anything?",
        "I heard there was a movie released in 2013 that received multiple nominations, can you tell me which one it is?",
        "Are there any showings for Ghostbusters in the next week?",
        "Have any coming of age films from the 90s been nominated for Academy Awards?",
        "Can you find a short film featuring Mickey Mouse",
        "Can you tell me about the well-deserved nominations for the movie No Country for Old Men",
        "I'm interested in knowing if Girl, Interrupted received any nominations or awards",
        "What were the award nominations for movies released between 1965-1970?",
        "Can you recommend a musical with epic musical compositions by David O. Russell?",
        "I want to know more about the movie with Daniel Craig that's similar to Blade Runner.",
        "Has any film received the New York Film Critics Circle honoree award?",
        "Which movie from 1985 received an honorable mention?",
        "Has Samuel Jackson ever directed an Oscar-winning film?",
        "I heard George Miller's latest movie is a must-see, did it receive any Oscar nominations?",
        "What movie with Samantha Phillips has won the most awards?",
        "Has any movie been honored at Cannes for its outstanding cinematography or acting performances?",
        "Can you recommend a movie featuring a robot uprising, starring Chris Hemsworth, and receiving critical acclaim for its special effects?",
        "Is the movie 'Where'd You Go, Bernadette' available on any streaming platforms in 2019",
        "Are there any chilling movies from 2019 directed by Richard Linklater that I can watch on streaming platforms",
        "Can you tell me which movie from 1953 won the most awards and nominations?",
        "I'm looking for a highly acclaimed movie from 1953 that received a lot of accolades, especially from the Academy. Can you recommend one?",
        "I heard that there's a classic movie from 1953 that was approved by almost everyone and received numerous awards. Can you tell me which one it is?",
        "Do you have showtimes for The Sixth Sense? I've heard it's a must-see and I'm a young adult looking for something new to watch.",
        "Can you suggest a movie with a captivating soundtrack that elevates the movie?",
        "What movie directed by Tim Story has a remarkable soundtrack?",
        "Are there any GP-rated movies with a memorable soundtrack that enhances the viewing experience?",
        "What's the best action movie with a subgenre of spy thriller?",
        "I'm in the mood for a comedy, but more specifically a romantic comedy. What's a great one to watch?",
        "I need to find showtimes for the new mockumentary film 'NR' and buy tickets ASAP",
        "Can I watch any TV-G movies on Netflix suitable for young children?",
        "Are there any family-friendly movies from the early 1980s available to stream on Disney+?",
        "Is Avatar with the song 'I Will Always Love You' available for streaming on Amazon Prime Video?",
        "Show me the trailer for the movie Bridget Jones's Diary, which was nominated for Best Picture.",
        "Has the movie Platoon, directed by Oliver Stone, been nominated for multiple awards?",
        "Can you tell me about a groundbreaking film on war themes, such as the movie X, and its nominations?",
        "I'm interested in a war movie that has been nominated for multiple awards. How about the film directed by Oliver Stone?",
        "Can you tell me about any Oscar nominations that the movie The Descendants received?",
        "I'm feeling nostalgic. Can you tell me which perfect movie won an Academy Award for Best Picture?",
        "I'm interested in learning about movies in which John Lennon was involved as a composer. Can you suggest any?",
        "Do you know of any movies featuring Sulley with music by Alexander Payne?",
        "Can I watch any of Patty Jenkins' movies on Netflix?",
        "What are some classic Alfred Hitchcock thrillers that are suitable for young adults?",
        "Can you recommend a suspenseful movie suitable for young adult males?",
        "I'm feeling nostalgic for a film about body swapping with a memorable score. Can you suggest one?",
        "Can you recommend a five-star movie with a special feature focused on The Blues Brothers?",
        "I am interested in knowing about the European Film Award winner in the past year.",
        "I heard The Departed had a lot of recognition for acting, can you tell me more about that?",
        "Tell me about the genre of The Lion King. Is it classified as an animated musical film, or does it fall under the adventure film subgenre?",
        "I'm curious about The Departed. Can you provide me with information on whether it's considered a crime film, or if it belongs to the gangster film subgenre?",
        "Are there any movies about corporate corruption that have won Golden Globes?",
        "Can I stream any post-apocalyptic world movies with parental controls?",
        "Are there any movies by Michael Moore available on streaming platforms?",
        "I'm in the mood for a movie featuring Ellen Ripley. Do you know where I can find one to stream?",
        "Can you recommend a mystery solving movie that Grace Walker received nominations for?",
        "Show me a film with a strong female lead that has received multiple awards and nominations.",
        "Can you tell me if any movies have won an award for Best Original Screenplay?",
        "I'm curious to know if the movie X has been nominated for any awards.",
        "Can you tell me if the film 'The Godfather' was Oscar nominated and how many awards it received?",
        "I'm feeling nostalgic. Do you have any information on Oscar nominated movies from the 90s?",
        "I'd like to know if 'Forrest Gump' won any Oscars. It's one of my favorite films from the 90s.",
        "Show me a movie with music composed by Andrew Lloyd Webber that has received awards and nominations.",
        "Do you know any time loop movies that are not too serious, like something Sofia Coppola would direct?",
        "Can you give me a brief summary of the plot for the movie The Dark Knight Rises",
        "I'm not sure where to find it, but is the movie Scar available for streaming on Disney+?",
        "I'm curious if there are any streamable movies on Disney+ that involve a character named Mark and are about cybercrime?",
        "I'm feeling really down right now. Can you tell me if a particular movie received multiple nominations for any awards?",
        "I'm curious about any awards or nominations received by movies that are considered spectacular. Can you provide some information on this?",
        "I'm looking for information on the actors in the film School of Rock. Who starred in it?",
        "Has The Lion King won any Academy Awards or received high praise from critics?",
        "Can you recommend an ocean adventure movie that I can watch on any platform? I'm open to any suggestions!",
        "Can I find any terrific revenge movies on any streaming platforms?",
        "I'm looking for a film montage, any recommendations on streaming platforms?",
        "Are there any promotions or special deals for watching J.J. Abrams' films from 2002?",
        "I'm curious if there's a sneak peek available for the upcoming Spider-Man movie, have you heard anything about it?",
        "Can you recommend any disaster movies that were nominated for awards?",
        "Is there a movie with a strong female lead in the subgenre X that would be appropriate for me to watch?",
        "I'm bored. Can you recommend a new movie with Dwayne Johnson in it and show me a sneak peek?",
        "Can I watch any R-rated historical movies on a streaming platform?",
        "Has Ron Weasley starred in any award-winning movies in the romance or history genre?",
        "Can you tell me about any award-nominated movies that depict the history of romance, maybe featuring Ron Weasley?",
        "Hey, have you seen the Golden Globe nominated trailer for any gangster movies from 1979 or 2008?",
        "Do you know if any gangster movies from 1979 or 2008 have received any awards or nominations?",
        "I'm curious, has there been any award-winning gangster movies from 1979 or 2008?",
        "I'm in the mood for a thought-provoking space exploration movie, can you suggest one?",
        "Can I watch any Anne Hathaway movies on Netflix, like a psychological thriller or an award-winning film?",
        "Are there any Dreamgirls movies available to stream for free for a pre-teen girl like me?",
        "What is a good movie from 2010 that I can watch with my family, maybe something with Anne Hathaway in it?",
        "Can you tell me if Interstellar is available on any streaming platform?",
        "I'm interested in finding out the streaming platform availability for Interstellar, could you provide that information?",
        "Did the movie directed by David Lee win any awards?",
        "Are there any nominations for the movie featuring Spock?",
        "I find it hard to believe that the movie with David Lee as the director received any awards",
        "Can you recommend a movie with a soundtrack featuring a reggae musician?",
        "Do you know if a movie directed by Damien Chazelle and with a mystique plot is streaming somewhere? I'm looking for something TV-MA.",
        "Hey, is there a Woody Allen film I can watch on a streaming platform that's based on a true story?",
        "Can you tell me if the film Gravity was honored with prestigious awards and nominations?",
        "I'm interested in knowing if the director Alfonso Cuarón has any movies that were honored with prestigious awards.",
        "Can you tell me if the movie Silver Linings Playbook received any Awards or nominations?",
        "I'm curious to know if Silver Linings Playbook has been recognized by industry peers for any accolades.",
        "Have there been any Awards or nominations for Silver Linings Playbook, and if so, could you provide me with some details?",
        "I'm looking for a survival thriller that will really keep me on the edge of my seat. Do you have any recommendations?",
        "Has any movie won multiple awards for Best Picture directed by Christopher Nolan",
        "I heard that the film 'Mean Girls' was nominated for an award, but can you confirm if it's for a remarkable achievement?",
        "Are there any alien invasion movies with Tina Fey in them that were approved by critics and received a nominated trailer?",
        "Is Gone Girl considered a thriller or a psychological thriller movie?",
        "Has The Departed movie won any awards for Best Director or Best Picture?",
        "Can you tell me if there are any Oscar-winning melodramas that have received impressive accolades?",
        "Which drama film has the most notable awards and nominations?",
        "Can you recommend a movie with an outstanding original score that was composed by Hans Zimmer?",
        "Show me a movie from the 1990s with a memorable original score that won an Oscar.",
        "Hey, can I watch Spy on any streaming platforms?",
        "Where can I find A Hard Day's Night to watch online?",
        "Can you tell me which movie features Celine Dion in a supporting role?",
        "Are there any low-rated movies in-cinema right now that showcase role diversity in the cast and crew?",
        "Do you have any recommendations for a movie directed by Zack Snyder that falls under a subgenre of action?",
        "Is American Beauty available for streaming? I heard it's a must-see for movie lovers.",
        "Can you recommend a movie with a surreal genre, preferably a subgenre that is emotionally resonant?",
        "I'm looking for a film that falls under the subgenre of The Avengers, but with a twist of fame. Do you have any suggestions?",
        "I'm very picky about the type of movies I watch. Can you suggest a film that combines the elements of fame and emotion, possibly falling under the surreal genre?",
        "I heard Park Chan-wook directed a new film, who are the actors in it?",
        "I'm looking for a movie with a stellar ensemble cast, any suggestions?",
        "What movie soundtrack did Justin Timberlake work on as a music producer?",
        "Can you provide me with information about the album release party for a movie soundtrack that Agent Smith was involved in?",
        "Show me a list of movies that have a soundtrack produced by Justin Timberlake.",
        "Can you recommend a melodrama film directed by Baz Luhrmann that has won multiple awards?",
        "I'm looking for a movie by Lars von Trier that has been nominated for an Academy Award.",
        "Show me a Francis Ford Coppola film with a high viewers' rating and has received prestigious awards.",
        "Can you tell me which movie from 1977 was recommended by viewers and received an Academy Award nominee?",
        "I'm feeling adventurous. Show me a film that received an Academy Award nominee for the song 'The Time of My Life'.",
        "Spoken movie query: \"What are the Awards and nominations received for the Golden Globe winner in the romantic comedy genre?\"",
        "What film from 1984 has the most nominations and awards?",
        "I'm in the mood for a picky watch today. Can you recommend a documentary about the making of a highly compelling historical movie released between 1977-1982? I'm particularly interested in learning about the director's vision and any screenplay rewrites that took place.",
        "Are there any streaming platforms that offer Teen movies right now?",
        "I want to watch a movie with Mark Wahlberg and some cool jazz music in it, do you have any suggestions?",
        "Which movie with a 4-star rating has received the most nominations?",
        "I'm looking for a movie featuring Zoe Saldana that has a rating of NC-17",
        "I heard that drug trafficking is a theme in some movies. Can you recommend a film with a perfectly cast hero's journey?",
        "I'm freaking out, is the movie 'Yesterday' available for streaming anywhere? I need to watch it tonight!",
        "Can you suggest a movie that has a silent film vibe, maybe something from the 1920s or 1930s?",
        "Do you have any showtimes available for the new Marvel movie that just came out?",
        "Could you show me a musical film that includes the song My Sharona and is similar to Saturday Night Fever?",
        "What famous actors were in the movie Her that came out in 2011",
        "Could you provide the plot summary for the film noir classic 'Double Indemnity' released in 1944?",
        "I'm interested in historical dramas featuring Tessa Thompson, any suggestions?",
        "I need to find the most epic movie trailer of all time. Have you got any pre-release footage of The Karate Kid?",
        "I heard there's this phenomenal movie coming out soon, what's the scoop on the making of that one?",
        "Which movie from 2013 has a scene with Charlie Chaplin as a character?",
        "I'm looking for a solid documentary about the making of movies. Can you recommend a film with a behind-the-scenes focus?",
        "I'm looking for a movie about alien invasion directed by a female director, can you help me with that?",
        "I'm interested in watching a movie that has received numerous nominations and awards. Can you suggest one?",
        "Are there any movies that feature Professor Dumbledore in a prominent role that you can highlight for me?",
        "What movie did Vin Diesel star in as the lead role and who was the director",
        "What's the storyline for the movie Pulp Fiction?",
        "I'm looking for a movie with a one-star review that features Julia Roberts and the song Old Time Rock and Roll. Can you recommend one?",
        "Which movie features a character similar to Ron Weasley and has a soundtrack that appeals to middle-aged women?",
        "I'm looking for some thrilling musical arrangements in a movie. Can you recommend anything with EDM or rock and roll legend in the soundtrack?",
        "Can you recommend a captivating movie directed by John Woo?",
        "I'm desperate to see a happy movie with a suspenseful plot. Can you show me the theatrical trailer for The Lord of the Rings?",
        "Hey there, can you tell me if there are any showtimes for movies starring Natalie Portman?",
        "Do you have any movie footage of a zombie film with high ratings?",
        "Do you have any information on a movie from 2019 that explores the making-of computer hacking scenes in an educational way?",
        "What year was Toy Story 3 released in?",
        "I heard there's a movie with a really cool plot, can you tell me more about it?",
        "What's the synopsis of a movie about a robot uprising, possibly directed by Kevin Hart?",
        "Is there any documentary about the making of a film released in 2003?",
        "I'm interested in learning more about Staying Alive. Can you tell me about the making-of documentary for this film?",
        "Could you provide me with the director's commentary for the movie The Bodyguard?",
        "Can you tell me the genre and subgenre classification of the movie 'Not Rated'?",
        "Is there an exclusive look at the new World War II movie available on any streaming platform?",
        "I'm super excited to find out about the chilling spy movie that got an excellent rating. Can you show me a movie clip for it?",
        "Do you know any teen movies with high ratings?",
        "I'm looking for the top-rated Forbidden romance films from the 90s, are any available for streaming?",
        "I need to know the viewers' rating for the movie Identity theft from 2013, hurry up!",
        "What is the name of the movie where Steven Spielberg directed and the main actor has a great rapport with the director?",
        "I am interested in a formal synopsis of a promotional film released in 1969, can you provide that for me?",
        "Can you recommend a secret agent movie with an NC-17 rating that came out in the 90s?",
        "I'm looking for a movie with epic musical moments and action. Any suggestions?",
        "I need an engaging movie with an exciting plot, M.",
        "I'm looking for a movie teaser for a 2001 film with an adventurous plot, maybe something with treasure hunting or jungle exploration.",
        "Is the movie When Harry Met Sally available on any streaming platforms?",
        "Do you have any information about the behind-the-scenes of a film involving Michael Bay and a historical setting?",
        "Can you tell me the main actor in the groundbreaking movie R?",
        "I heard that there is a highly acclaimed movie featuring Kevin Spacey in a dramatic role. Can you tell me if it has won any awards or received nominations?",
        "What are the showtimes for the latest adventure movie with a plot similar to Frankenstein's Monster?",
        "Is there a movie about corporate espionage that has an intriguing trailer?",
        "Have you seen that family drama with Nada in it? Did it win any awards?",
        "I'm looking for a film with an amazing on-screen presence by the actress Zendaya and directed by a female director.",
        "I'm bored, can you tell me the plot of the movie Ghostbusters?",
        "What movie involves an undercover mission and is set during the Civil War era?",
        "Can you provide me with an exclusive look at the new movie featuring Adam Driver and Scarlett Johansson?",
        "Yo, can you hook me up with the trailer for that new high school drama movie?",
        "I'm curious, can I find any movies with Magneto in them on any streaming platforms? Maybe with some exclusive behind-the-scenes footage?",
        "Do you have any information about the movie featuring Gwyneth Paltrow and Lupita Nyong'o? I'm interested in learning more about the real-life stories behind the scenes.",
        "I'm looking for a film with a compulsive plot and the letter M in the title, can you help me?",
        "Can I buy tickets for the upcoming Boba Fett movie?",
        "I heard there's a commercial for the 2008 cult classic film clip, do you have any details or showtimes?",
        "Yo, where can I find the red band trailer for that new horror flick?",
        "I'm looking for a movie with an uplifting music soundtrack, something that really gets the heart pumping. Can you recommend something with music similar to Gwen Stefani's style?",
        "I'd like to know about Al Pacino's involvement in the making of the film 'Scent of a Woman'. Can you share some behind-the-scenes information?",
        "Can you show me the making-of featurette for the teenage classic 'Rebel Without a Cause'?",
        "What cult movie with an unrated classification has a captivating plot synopsis?",
        "I need to know if the vigilante justice movie is available on any streaming platforms right now, I really need to watch it.",
        "Have you seen the teaser trailer for that terrifying new horror movie?",
        "Show me a movie directed by Hayao Miyazaki with an intriguing plot.",
        "Hey, can you show me a visually stunning movie trailer with some intense katana action scenes?",
        "Can you play the trailer for the movie Dynamic, suitable for families with young children?",
        "Can you tell me about a movie that has some informative scene on computer hacking in 2019?",
        "Did the movie Joker receive any nominations for awards?",
        "I heard about a movie rated 1.5 out of X, what is it about?",
        "Can you recommend a movie with a forbidden love theme that has an appalling rating?",
        "I'm searching for a gripping film directed by Taika Waititi. Can you recommend something brilliant?",
        "Show me the trailer of a recent movie with a ghost in it.",
        "Can you give me a summary of the plot for The Pursuit of Happyness?",
        "Could you tell me about the soundstage where Jessica Chastain filmed a MA15+ rated movie?",
        "I'm not sure if I'm interested, but have you seen any movie clips featuring an undercover operation with Luke Skywalker",
        "Are there any unrated movies featuring strong female leads that middle-aged women would enjoy watching?",
        "Show me behind-the-scenes footage or interviews from any 1990s movies with Jennifer Aniston",
        "Could you show me a trailer for a family-friendly adventure movie with Shia LaBeouf?",
        "Can you tell me about the movie released in 2006, featuring Uhura and directed by someone famous?",
        "Which movie features a masterful portrayal of an actress by the name of Meryl Streep in a historical film set in ancient Rome?",
        "Show me a movie that delves into the costume design process, particularly with a focus on the letter 'U'.",
        "I was wondering if there's a movie with the perfect soundtrack for a hacker-themed party",
        "I need something new to watch, how about a documentary with an exciting storyline?",
        "I heard there was a movie with a thrilling trailer directed by James Cameron in 1997. Do you know the title?",
        "Spoken Movie Query 1: \"Wow, I need to find a movie with compelling performances from 2000 on a streaming platform. Are there any movies featuring Han Solo, Donkey, or the song 'Rainbow Connection' available?\"",
        "I find it hard to believe, but are there any great movies playing right now that I can watch?",
        "I'm curious if there are any critically acclaimed war dramas that Katy Perry has been involved in. Can you provide me with information on any awards or nominations received by these movies?",
        "I'm interested in getting a glimpse of a movie with Tom Hanks",
        "What is the specific subgenre of the movie Iron Man?",
        "Can I watch a trailer for the latest spy movie directed by J.J. Abrams?",
        "Hey, can you show me a sneak peek of any mystery movies from the 1950s directed by Alfred Hitchcock?",
        "Show me a movie from 1999 with a soundtrack that includes dance music.",
        "Can you tell me about the making of the movie Hallelujah that was directed by Alfonso Cuarón?",
        "I'm looking for a movie that's a bit picky and has a musical comedy flair like Mamma Mia!, with some interesting making-of tidbits.",
        "Is there a PG-rated movie that has a well-developed synopsis and was popular with middle-aged women?",
        "Could you please show me a teaser for the movie Pocahontas?",
        "I'm interested in watching a war drama from 2011, can you check if 'X' is playing anywhere nearby?",
        "Show me a glimpse of the Rocky Balboa film, please.",
        "Can you recommend a movie with a great dance soundtrack from the mid 2000s?",
        "Can you recommend a movie similar to A Star is Born, with exceptional reviews and numerous awards and nominations",
        "Hey, can I get an advance look at that movie with Cathy Yan directing? I heard it has superb casting!",
        "Could you please show me the trailer for the latest Joker movie starring Joaquin Phoenix?",
        "What are the top-rated spy movies from the 1970s with J.J. Abrams as the director?",
        "Hey, what's the plot of that dance movie with the terrific storyline?",
        "Hey, who directed that heist movie from the 1970s with Drake in it?",
        "I'm trying to decide what to watch. Do you know if the movie Ant-Man is available on any streaming platforms?",
        "Can you tell me who the versatile actors are in the movie School of Rock?",
        "I'm interested in finding a movie similar to The Incredibles, but with a different genre. Any suggestions?",
        "May I inquire about the showtimes and ticket availability for any movie related to political conspiracy?",
        "I'm feeling hopeful about finding a thought-provoking movie. Could you recommend any eye-opening documentaries about cybercrime?",
        "Can you recommend a movie directed by Lana Wachowski with a PG-13 or R rating? I'm open to any genre.",
        "Is there a TV-MA historical heist movie that offers a behind-the-scenes look at the making of the film?",
        "Spoken Movie Query: \"Can you recommend a movie similar to Deadpool with a high viewers' rating?\"",
        "I'm curious to know if there are any highly-rated movies involving a character named Fiona.",
        "Hey, has Grace Walker ever won any awards for her acting?",
        "Can you recommend a well-executed movie directed by Jordan Peele with an impeccable plot?",
        "Could you show me some movies with an innovative and innovative subgenre type, like the one with the character Scar from 1987?",
        "Can I see a teaser clip for a gripping Gothic movie from 1975-1980?",
        "I'm interested in a movie with an outstanding supporting cast, can you recommend one?",
        "Hey, do you have any movie trailers with jaw-dropping visual effects and some wicked katana action?",
        "I need a movie recommendation that's really touching. I'm a fan of Hugh Jackman, so something with him in it would be great.",
        "Can you tell me who directed the movie where Will Smith made his film debut in 1983?",
        "Which fantasy movie directed by Ron Howard has won the most awards and nominations?",
        "Are there any streaming platforms that have movies with decent reviews and a phenomenal rating?",
        "I'm feeling indecisive, but do you have a teaser for a game-changing film with the song 'I Don't Want to Miss'?",
        "Can you recommend a gangster movie that won multiple awards and nominations? I want to watch something with a lot of recognition.",
        "Has the movie Terms of Endearment won any awards or nominations?",
        "Which movie has been recognized with prestigious accolades for its outstanding cinematography?",
        "Who was the set designer for the latest Vin Diesel movie release",
        "What NR films have a compelling plot synopsis worth watching?",
        "I'm looking for an entertaining movie like Mamma Mia! with some smooth behind-the-scenes details. Can you suggest one?",
        "Can you recommend an empowering biographical movie about a historical figure?",
        "I'm not sure what I'm in the mood for. Can you show me a movie with an awesome EDM soundtrack?",
        "Is there a movie from 1988 with Winona Ryder in it that's directed by a female filmmaker and rated R?",
        "What is the viewers' rating for the latest Star Wars movie directed by J.J. Abrams?",
        "Is there a film that has some interesting behind-the-scenes stories, maybe directed by someone like Akira Kurosawa?",
        "Who directed the movie that features the song 'Smooth'? I'm interested in knowing more about the making-of details.",
        "Could you find out if the movie Can You Feel the Love Tonight has won any awards or nominations?",
        "I'm really interested in learning more about the making of the film Arrival. Could you provide me with the director's commentary and some behind-the-scenes details about the cinematography?",
        "What's a surreal family dynamics movie from 1994 that's not rated?",
        "Hey, I heard there's an excellent movie with Rey in it. Can you tell me the viewers' rating for it?",
        "Could you provide me with the showtimes and ticket availability for the movie Unforgettable directed by Clint Eastwood?",
        "Is there an action movie starring Tilda Swinton that is rated MA15+ and features some interesting behind-the-scenes footage?",
        "Can you give me a brief preview of the plot for Mr. Incredible?",
        "Can you tell me about a movie with a well-cast featuring Hugh Jackman in 2015?",
        "I'm interested in learning more about the making of a new action thriller film. Can you provide me with some behind-the-scenes details, such as the director and the MPAA rating?",
        "Spoken Movie Query: \"Can you provide information about the cinematography of The King's Speech film?\"",
        "Is there a TV-MA movie directed by Judd Apatow that I can watch?",
        "Can you give me a brief summary of the plot for The Social Network movie?",
        "I'm in the mood for something spooky, do you have any recommendations for movies with supernatural creatures in them?",
        "Can you give me a brief summary of the plot for the movie released in 2018?",
        "What is the viewers' rating for the latest sci-fi movie released this year?",
        "Do you know if there's a spy movie called Fiona with good ratings?",
        "Can you recommend a comedy movie with a touch of emotional rollercoaster?",
        "Can you give me a sneak peek at the trailer for the new Ryan Gosling movie coming out?",
        "I heard there's a new film coming out with Zendaya and Tom Holland, do you know if it's a PG-13 movie?",
        "Can you recommend a PG-rated movie from 1999 with a great dance soundtrack?",
        "Which movie featuring The Joker has been honored with multiple nominations?",
        "I heard there's a GP-rated movie with Gilderoy Lockhart in it. Can you tell me more about it?",
        "I'm indecisive about what type of movie to watch. Can you suggest a film from 1998 with Octavia Spencer and known for its great reviews?",
        "Hey, can you tell me if there are any showtimes for a well-paced and tightly edited movie from 1962?",
        "Can I find a movie with awe-inspiring cinematography featuring Denzel Washington on any streaming platform?",
        "Are there any reviews available for the film 500 Days of Summer's teaser?",
        "Can you recommend a movie with a subgenre related to adventure and mystery in the year 1977?",
        "Can you provide a teaser clip of the film Titanic and give me a brief synopsis of the plot?",
        "Who was the costume designer for the latest Mission: Impossible movie starring Ethan Hunt?",
        "I'm looking for a teaser of a movie that will make me happy, any suggestions?",
        "What can you tell me about the plot of the 1986 Dracula movie with the PG rating?",
        "Can you recommend a movie from 2013 with some provocative musical choices?",
        "Could you show me a list of award-winning animated movies from Danielle Taylor?",
        "Has A.R. Rahman received any awards for his work in movies?",
        "Is there a teaser for a movie with a compelling narrative that will be released soon?",
        "Can you provide some background on the art direction in the latest spy film featuring Jane Smith?",
        "Can you tell me who the set designer was for the movie The Departed directed by Brian De Palma?",
        "Can you recommend any environmental movies that are considered mockbusters?",
        "Can you tell me the plot of a multilayered science fiction movie with a G rating?",
        "I'm curious about the making-of details of Ben-Hur from 1996, can you share some behind-the-scenes information with me?",
        "What are some movies with a mafia theme that feature Al Pacino as the lead actor?",
        "I'm looking for a movie with a mature theme, something along the lines of a psychological thriller.",
        "I'm looking for a GP movie with some breathtaking action scenes - got any recommendations?",
        "Can you tell me the Plot of any action movie with at least an A rating ?",
        "Are there any outstanding movie showtimes for Thor this weekend?",
        "Can you tell me where to find a TV-MA movie trailer for an unbelievable spectacle",
        "I'm looking for a movie with a plot that will make me laugh, maybe something by Mel Brooks.",
        "I'm looking for movies directed by Robert Rodriguez that I can stream. Any recommendations for a non-binary young adult?",
        "Could you recommend a film deserving of accolades for its compelling storyline and exceptional acting?",
        "Do you have any information about the R-rated film starring Luke Skywalker?",
        "What genre of movies does Brian De Palma usually direct, and can you show me a trailer from one of his films?",
        "Who directed the movie Into the Woods and what is the MPAA rating?",
        "Are there any mafia family films that are actually worth watching on any streaming service?",
        "I'm curious, what genre does The Social Network fall under and how was it received by viewers?",
        "I'm looking for a movie with an impeccable director like Jordan Peele, that has received well-executed reviews. Can you suggest one?",
        "Can you recommend a movie with a disco soundtrack that adds excitement to the scenes?",
        "I'm interested in finding a behind-the-scenes featurette for a movie directed by Ryan Gosling. It has to be really in-depth and compelling, with lots of details about the production process. Got anything like that?",
        "I heard about this magnificent movie from 1998-2004, can you tell me if it's worth watching?",
        "I'm looking for a superb movie directed by Morpheus. Can you help me find one?",
        "Hey, can you play a preview of the soundtrack for the movie M?",
        "I'm looking for the showtimes and ticket availability for the movie Braveheart, which is considered a classic in the film industry.",
        "Can you recommend a science fiction movie directed by Andrea Arnold that is suitable for pre-teens, but not rated NR?",
        "What M-rated film has the most thrilling plot of all time",
        "I'm curious about a movie involving human cloning and a subtle psychological thriller, maybe something from 2010.",
        "Are there any showtimes for a movie with amazing music and high ratings?",
        "I'm looking for a movie with the song 'We Will Rock You' that came out in 2001. Can you show me a teaser?",
        "Can you tell me about the set designer for the movie with underwhelming performances",
        "Can you show me a teaser for the new science fiction movie with a solid performance by the lead actor?",
        "I'm looking for a movie with soul-stirring musical arrangements, directed by Francis Ford Coppola. Do you have any recommendations?",
        "I'm looking for a movie with an enchanting music soundtrack, do you have any recommendations?",
        "Yo, show me a movie preview that's as exciting as a rollercoaster ride and has the same thrill level as Mission Impossible.",
        "I'm feeling down, please recommend a movie where Patrick Bateman is the main character.",
        "I'm so bored, is there a Martin Scorsese movie with a great plot available on any streaming platform?",
        "Show me a movie featuring Cameron Diaz that has a captivating plot",
        "Is Black Widow worth watching? I heard it has an impressive rating.",
        "Can you recommend a behind-the-scenes documentary about the making of I Feel Pretty?",
        "Spoken movie query: \"Can you tell me the Awards and nominations received for the romantic comedy genre film The Silence of the Lambs?\"",
        "What genre does the Idris Elba film 'Beasts of No Nation' fall under?",
        "I need a sneak peek of an unmissable action movie. Can you show me a cool trailer?",
        "Hey, can you show me a charming clip from The Grand Budapest Hotel?",
        "Yo, I'm looking for a movie teaser that's a real masterpiece with some epic katana fight scenes. Got any recommendations?",
        "I'm bored, can you tell me if the movie starring John Legend received any awards or nominations for its soundtrack?",
        "Show me a behind-the-scenes analysis of the production process for the PG-rated movie directed by the cinematographer of The Bodyguard.",
        "I'm looking for a movie with a captivating plot from 2016 that has received rave reviews. Can you suggest one?",
        "Hey, can I watch Deadpool on any streaming service? I'm feeling nostalgic for some classic Ryan Reynolds comedy.",
        "I'm feeling nostalgic for some old movies featuring Lando Calrissian, can you suggest some?",
        "Can I find the groundbreaking movie 12 Years a Slave on any streaming platform?",
        "I'm really stressed about finding a theater with the most recent box office hits. Can you help me with that?",
        "Can you give me a quick overview of the plot for a movie with an undercover operation in it?",
        "Is Scarlett Johansson starring in any new movie with a synopsis available?",
        "I'm interested in a movie directed by Stanley Kubrick - maybe something with a synopsis. Do you have any recommendations, perhaps including the song You Never Can Tell?",
        "Can you provide me with the making-of details for the space opera film from the 2020s that received a B+ rating?",
        "I need to find a good movie to watch right now, something with a moving plot and great reviews. Can you recommend anything involving Legolas?",
        "Hi, can you tell me the showtimes for the movie 'Fiona'?",
        "Once showtimes for Steven Spielberg's adventure movie playing at the cinema?",
        "Do you have any footage from the Bruno Mars movie?",
        "Hey, what kind of movie is Dracula? Like, is it a horror or more of a supernatural thriller?",
        "I'm interested in learning about the making-of process for the G-rated animated film Toy Story, could you provide me with some details?",
        "Spoken Movie Query: \"Could you show me behind-the-scenes footage of a movie with Robert Downey Jr. in it?\"",
        "What is the viewers' rating for the movie starring Mel Gibson with a revenge plot?",
        "I'm looking for a movie with great reviews and ratings, perhaps involving footage from 1998. Can you help me with that?",
        "How engaging is the movie Nine to Five really? I've heard mixed opinions.",
        "Are there any exceptional behind-the-scenes documentaries about the making of Jim Carrey's movies?",
        "Hey, what's a really exciting movie from the late 1990s that's rated PG-13?",
        "I'm in the mood for an adventure film, preferably with a subgenre that involves pirates or treasure hunts.",
        "Hey, can I watch any entertaining movies by Wes Anderson on any streaming platform?",
        "Show me a movie directed by Spike Jonze with a great soundtrack from the year 1983.",
        "I'm wondering if the new Spider-Man movie has any familiar faces from other Marvel films, have you heard any casting news?",
        "Hey, can you show me a teaser for the new Puss in Boots movie?",
        "I'm looking for an unforgettable movie with a heartwarming plot. Do you have any recommendations?",
        "Show me a teaser trailer from the 80s for a war movie that has stood the test of time.",
        "Hey, can you show me a preview of that new sci-fi movie with an unmissable trailer?",
        "I'm interested in learning more about Taxi Driver - do you have any behind-the-scenes footage or interviews with the director available?",
        "I'm feeling down and could use a good movie to lift my spirits. Can you recommend a movie with a NR rating and a Montage scene?",
        "Can you tell me about the making-of documentary for the latest James Bond film with the code name M?",
        "Hey, I heard people really loved the crime spree movie, is it true?",
        "Can you recommend a behind-the-scenes documentary about the making of an eye-opening movie about space exploration?",
        "Could you recommend a documentary that explores the impressive behind-the-scenes work involved in bringing Anne Bancroft's character to life?",
        "I'm interested in movies with a love triangle plot. Can you recommend films similar to this theme, perhaps something akin to the romance genre in Poe Dameron's character arc?",
        "I'm curious if La La Land received any awards, it seems like a popular film",
        "Can you show me a teaser for the movie Dreamgirls and also provide some behind-the-scenes location scouting analysis?",
        "Hey, can I watch Jaws on any streaming platform?",
        "Hey, can you tell me about any PG-13 movies from the late 80s to early 90s that have a behind-the-scenes look at the sports industry?",
        "I'm looking for a mesmerizing movie teaser to watch. Any suggestions?",
        "I'm in the mood for something happy and light-hearted. Can you recommend a B movie that goes behind-the-scenes of a feel-good story?",
        "Can you recommend a movie with instrumental music that will leave me overwhelmed? Maybe something with the song 'Stayin' Alive' in it?",
        "What film from the 2000s has a thrilling plot and a really cool teaser?",
        "I'm interested in learning more about the CGI and animation in the movie 'Beauty and the Beast'. Can you provide some behind-the-scenes details?",
        "Spoken Movie Query: \"Can you recommend a well-reviewed movie with perfectly paced action and adventure, targeted for pre-teen girls?\"",
        "Is there an unrated movie directed by Joe Wright that has elements of both comedy and psycho-thriller?",
        "Can I watch Borat on any streaming platforms?",
        "Is there a film with Alfred Hitchcock's music that you'd recommend?",
        "Can I watch any Judd Apatow movies on any streaming platforms right now?",
        "Who directed the PG-rated movie The Terminator and who are the main cast members?",
        "What subgenre does the movie 'Tinker Tailor Soldier Spy' fall into, and is it similar to the Jason Bourne series?",
        "\"Can I see some pre-release footage of the new Tim Burton film with an animal adventure theme?",
        "I'm looking for a movie about corporate corruption that got a perfect score from critics. Any suggestions?",
        "Can you recommend any 1994 sci-fi movies that are worth watching?",
        "Is there an extended preview available for the latest George Lucas film?",
        "Which movie with a 8.5/10 rating has received the most awards and nominations in the family drama genre?",
        "Can you give me a synopsis of any travel movies directed by Channing Tatum involving betrayal?",
        "Can you provide information on any movies with underwhelming performances by the cast?",
        "Are there any G-rated movies from the past that have a fantastic Adventure theme song?",
        "I'm not sure if I want to watch a movie with excellent chemistry between the actors. Can you recommend a film?"
    ]
}