{
    "entity-not-found": [
        "Can you suggest a restaurant with a good gluten-free menu and lakeside dining?",
        "I'm in the mood for some Caribbean food, can you recommend any restaurants with a great atmosphere and live music?",
        "I'm looking for a reasonably priced seafood restaurant with outdoor seating.",
        "What coastal restaurants serve authentic Bahamian cuisine for dinner?",
        "I'm looking for a restaurant with electric vehicle charging and a good selection of Italian dishes.",
        "Do you know of any banquet halls in the area that offer a diverse menu",
        "Where can I find the best Margherita Pizza in town?",
        "What are the opening times for Red Lobster in this area?",
        "Can you recommend a seafood restaurant around Fisherman's Wharf that is not expensive?",
        "Can you recommend any hidden gems for authentic Thai cuisine?",
        "Can you recommend a restaurant with New Zealand cuisine and accepts reservations?",
        "Can you recommend a reservation app for favorably-reviewed Italian restaurants near On the Border?",
        "What are some AAA Diamond Rated restaurants in the area?",
        "I'm craving some late-night snacking. Where can I find a Japanese restaurant open late?",
        "Can you provide me directions to Seasons 52?",
        "Where can I find some Scottish cuisine for dinner tonight?",
        "What time does Eddie V's Prime Seafood close out tonight?",
        "Can you make a reservation at Thai Orchid for 7 pm tonight?",
        "Can you recommend a restaurant with good burrito options and accepts reservations?",
        "What's the best Italian restaurant in town?",
        "I'm craving some sushi, where can I find the highest-rated sushi restaurant in town?",
        "I want a sweet treat. Can you find me the nearest ice cream parlor?",
        "I need to pick up an order of sushi in 30 minutes, where can I go?",
        "What are some options for late-night dining with high Yelp reviews?",
        "I'm looking for a place to eat that offers vegetarian options and has a 4-star rating on Yelp"
    ],
    "not-allowed-entity-type": [
        "Can you recommend a restaurant with a high Infatuation score and a strategic position?",
        "I'm craving a Jersey Mike's Subs sandwich, can you find a location near the 90210 zip code",
        "What restaurants around here offer a price range of 20-30 dollars per person?",
        "I'm looking for a Paraguayan restaurant in the 10011 zip code",
        "I'm craving Cambodian food tonight. Can you recommend a restaurant?"
    ],
    "entity-not-found-overlap": [
        "I'm in the mood for some sushi, where can I find a good sushi place?",
        "I'm craving sushi, where is the best sushi place around here?",
        "I'm craving some sushi, can you recommend a good sushi place nearby?",
        "I'm craving Chinese food delivery tonight, what are some options?",
        "I am craving sushi, is there a good sushi restaurant nearby?",
        "I'm craving sushi, where can I find a good sushi restaurant with outdoor seating?",
        "I'm craving sushi, can you recommend any good sushi places in Portland?",
        "What are the hours for The Portland Steakhouse?",
        "I'm craving some tandoori chicken. Where can I find the best tandoori chicken in town?",
        "What Japanese restaurants have a 5-star rating?",
        "I'm craving sushi, where can I find a good sushi place with a high rating and affordable prices?",
        "I'm in the mood for sushi, where can I find a good sushi restaurant with outdoor seating?",
        "I'm craving sushi, can you recommend a good sushi restaurant in Denver?"
    ],
    "missing-entity-type": [
        "I need a family-friendly restaurant with a kids' menu and a play area by 7 pm.",
        "What are some points of interest for Italian cuisine open late tonight?",
        "What are the hours for Italian restaurants in Houston?",
        "What are the hours for Last Call?",
        "I'm in the mood for some Gjusta, where is the nearest location?",
        "Directions to the nearest Italian restaurant that serves gluten-free pasta",
        "I'm looking for a vegetarian restaurant with a good rating for dinner hours.",
        "Can you recommend a Mexican restaurant with outdoor seating and a children's menu for dinner hours?",
        "What's the nearest Italian restaurant with a 4-star rating and a price range of $20-30 per person for dinner hours?",
        "I'm looking for a place with outdoor seating and a good selection from Eater's The National 38",
        "I'm in the mood for Italian food, where can I dine for less than $20 per person?",
        "What are the hours for Papa John's pizza?",
        "What are the hours for the nearest Chinese restaurant?",
        "Do you know of any Italian restaurants that offer a prix fixe menu for dinner?",
        "What are the hours for The Greek Island Taverna?",
        "Can you recommend a Thai restaurant with vegan options in the county?",
        "What time does the Mexican restaurant on Main Road close tonight?",
        "Can you suggest a must-try Italian restaurant in the downtown area?",
        "Can you recommend a restaurant with a wide tea selection and serving times before 5 p m",
        "What restaurants offer catering for a party of 20 people?",
        "Find me a restaurant with outdoor seating and a good wine selection",
        "Where can I get a reservation for a fancy seafood restaurant?",
        "What are the hours for the nearest Italian restaurant in Los Angeles?"
    ],
    "low-logprob": [
        "which restaurant around here serves authentic Italian pizza",
        "I'm looking for a restaurant close by with Thai cuisine and vegetarian options.",
        "Do you know a restaurant in the area that takes reservations for French cuisine?",
        "What restaurants in the area serve vegetarian options and are open for business hours?",
        "I am in the mood for a quick sandwich, can you find the nearest Jimmy John's location?",
        "I'm on a budget, can you recommend a place with affordable prices for dinner?",
        "What are the hours of the Italian restaurant with the best pizza in town?",
        "what's a good spot for falafel and hummus in the area?",
        "What is the rating of Himalayan restaurant?",
        "can you recommend a high-rated Italian restaurant with a prix fixe menu?",
        "I'm craving some pad thai, where can I find the best one in town?",
        "What's the best Italian restaurant in the downtown area?",
        "Do you know if Bonanza Steakhouse serves breakfast?",
        "What are the operating hours for the Italian restaurant near the convention center?",
        "I'm looking for a restaurant that serves authentic Brazilian cuisine like Texas de Brazil .",
        "I need to find a place with a high rating for dinner tonight, any suggestions?",
        "Do you know of any restaurants nearby with a high rating for seafood dishes?",
        "Can you recommend a Mexican restaurant with outdoor seating and good margaritas?",
        "I'm craving lamb curry, is there a restaurant serving it near the highway?",
        "Can you recommend a restaurant with great calamari?",
        "I'm craving some comfort food, where can I find the best mac and cheese in town?",
        "show me the most affordable place to get burgers with a high rating",
        "Where is the nearest Chipotle Mexican Grill located?",
        "I'm craving some Scandinavian food, can you find me a restaurant near Noma?",
        "What are the best Italian restaurants in the area that are open late on weekends?",
        "Please recommend a restaurant with outdoor seating near Landmarks in Toronto.",
        "What's a good spot for brunch in San Francisco with vegetarian options and reasonable prices?",
        "Find us a place with outdoor seating and a view of the city for The 50 Best Discovery rating.",
        "I'm craving some Mexican food, do you know any good restaurants nearby that have outdoor games?",
        "Can you suggest any restaurants near Dave & Buster's with a high rating",
        "I'd like to find a sushi place with a high rating in this area.",
        "I'm craving some delicious risotto for dinner tonight, can you recommend any restaurants that serve it?",
        "Can you recommend a place for a fancy dinner with a view within a reasonable price range?",
        "Do you know of any budget-friendly Indian restaurants open late for dinner?",
        "When does Fleming's Prime Steakhouse close on weekends?",
        "What are the prices like at the new sushi place downtown?",
        "Do you know of any restaurants in the area that serve Kenyan cuisine?",
        "I'm craving Brazilian cuisine, can you recommend a restaurant with late opening hours?",
        "find me a domestic restaurant nearby",
        "Can you tell me the operating hours of the nearest sushi bar?",
        "Can you recommend a place for dinner with outdoor seating and a view?",
        "where can I find a budget-friendly spot with air conditioning and a diverse menu",
        "What are the opening hours for the cheapest sushi place near Toronto ?",
        "I'm craving steak frites for dinner, where's the best place to get it?",
        "What's a restaurant with a high rating and affordable prices around here?",
        "I'm craving sushi, is there a highly rated Japanese restaurant in the area",
        "What is the best Italian restaurant in the area?",
        "What restaurants offer last orders after 10pm",
        "What's the address of the restaurant Gordon Ramsay recommended?",
        "I'm craving some modern fine dining. Is there a restaurant in the city that serves avant-garde dishes?",
        "What's the best Japanese restaurant in the area?",
        "Where can I find excellent tacos in this area?",
        "I'm craving a juicy steak for dinner. Can you recommend any good steakhouses in the area?",
        "What's the best place for Canadian cuisine in this area?",
        "Where can I find a reasonably priced Italian restaurant with a good rating?",
        "What are the top-rated seafood restaurants with outdoor seating and a waterfront view?",
        "I'm in the mood for some breakfast, where can I find a good spot for that?",
        "Is there a street with a variety of restaurants offering Italian cuisine?",
        "Can you recommend a nearby restaurant that serves Israeli cuisine?",
        "What are the hours of the nearest restaurant that serves Shawarma?",
        "What are the best restaurants in town for a meal under 20 dollars",
        "I'm craving some tiramisu, where can I find a restaurant with a great dessert menu?",
        "I'm in the mood for some authentic Filipino cuisine, where can I find a highly-rated restaurant?",
        "Can you recommend a scenic restaurant with Argentine cuisine?",
        "Find a nearby Italian restaurant open late with live music.",
        "Do you know of any good seafood places with outdoor seating and a view?",
        "Where can I find a nice Italian restaurant with a set menu for dinner tonight?",
        "What's the best Italian restaurant with outdoor seating in Downtown? Established",
        "Can you recommend a nice restaurant with Affordable Luxury for dinner tonight?",
        "What are the operating hours of the Italian restaurant with the highest rating in town?",
        "What are the operating hours of the Italian restaurant near the hotel?",
        "what's the best place in town for a fancy dinner with a view",
        "What are the hours of the Jamaican restaurant nearby?",
        "I'm looking for a budget-friendly restaurant with a great selection of seafood dishes",
        "I'm craving Indian cuisine, where can I find a good Indian restaurant nearby",
        "I need a restaurant with affordable French cuisine, any recommendations?",
        "What are the delivery hours for LongHorn Steakhouse in Seattle?",
        "Can you recommend any five-course restaurants nearby for early bird hours",
        "I'm in the mood for some Neighboring cuisine, where can I find that?",
        "What Chinese restaurants in the city have extended hours and offer dim sum?",
        "What are the operating hours of Black Bear Diner on weekends?",
        "are there any reasonable places to eat around here",
        "Can you recommend a restaurant with a good wine selection, preferably The Capital Grille?",
        "I'm in the mood for some sushi, where can I find a good sushi restaurant",
        "What are the hours of operation for Chez Panisse in Berkeley",
        "Where can I find a place with affordable prices and a variety of vegetarian dishes?",
        "Can you recommend a restaurant with a 4-star rating near the beach?",
        "I'm craving some authentic Dominican cuisine, where can I find a restaurant that serves it?",
        "Can you recommend a good seafood restaurant in the area?",
        "Where is The Greek Island Taverna located?",
        "I'm craving some sushi, where can I find a highly rated sushi restaurant in the area?",
        "what are the top-rated restaurants in Las Vegas",
        "Can you recommend any expensive gastro-pubs with a good wine selection?",
        "What are the best pizza places in this area?",
        "Where can I find a cut-price buffet with a wide selection of dishes?",
        "Can you recommend a good Nicaraguan restaurant in the area?",
        "Can you recommend a restaurant with The Independent's top spot for Italian cuisine around here?",
        "Where can I find low calorie options for lunch in this area?",
        "Can you recommend any upscale steakhouses in the area with outdoor seating?",
        "What's a good seafood restaurant with a waterfront location?",
        "Where can I find a restaurant that offers vegetarian options and is open past midnight?",
        "I'm craving fish and chips. Where is the best spot to get it?",
        "where can I find a 24-hour diner nearby?",
        "Where can I find a good Italian restaurant for dinner near Rossoblu ?",
        "Find a family-friendly diner with reasonable prices for breakfast",
        "What are the coffee service hours at the nearest cafe?",
        "What restaurants nearby offer an early bird special hours dinner menu?",
        "Is Golden Corral open for breakfast on weekdays?",
        "What are the hours of the Chinese restaurant in the city center?",
        "I'm craving some Dominican food, where can I find a good spot nearby?",
        "What restaurants near the farmers' market serve organic cuisine?",
        "show me the hours for the nearest Italian restaurant",
        "Where can I find a restaurant in the area that serves Mediterranean cuisine",
        "I'm in the mood for some Pakistani food, can you recommend a place in the neighborhood?",
        "Do you know any good sushi bars with outdoor seating and a view?",
        "what is the opening times of the nearest Italian restaurant",
        "What's a popular steakhouse with a children's menu and a 4-star rating?",
        "What time does Panera Bread close tonight?",
        "I want to try some authentic Indian food, can you recommend a good Indian restaurant open past 10 pm?",
        "What time is the service cut-off for late night dessert delivery in this area?",
        "Can you recommend a restaurant with outdoor seating and a vegetarian menu?",
        "I'm craving some authentic Italian pizza, where's the best place to get it?",
        "What is the best Italian restaurant in the city with a 5-star rating?",
        "I'm craving a sub sandwich, can you find the nearest Firehouse Subs?",
        "Can you recommend a highly-applauded Italian restaurant in the downtown area",
        "I'm looking for a budget-friendly restaurant with vegan options, any suggestions",
        "I'm craving some Apple pie right now. Where can I find a restaurant with a great dessert menu?",
        "I need a recommendation for a restaurant with a timeout menu.",
        "I'm in the mood for some Asian cuisine, can you recommend a good place for noodles?",
        "I'm looking for a hidden gem with outdoor seating and a waterfront view.",
        "I'm craving Italian cuisine, where can I find a good Italian restaurant nearby?",
        "I want to take a date somewhere with a romantic ambiance, any recommendations for a restaurant with a good atmosphere?",
        "What time does the Italian restaurant close tonight?",
        "what are the hours for the local italian restaurant",
        "What are the operating hours for Bahama Breeze this weekend?",
        "Can you make a reservation at Per Se for 7 pm tonight?",
        "Can you recommend a restaurant name in the area that offers a casual dining experience and is open late at night?",
        "Can you recommend a restaurant with 24-hour service that serves authentic Mexican cuisine?",
        "What are the business hours for the Italian restaurant near the park?",
        "I'm looking for a place with outdoor seating and live music near downtown.",
        "I'm craving some French cuisine, where can I find L'Atelier de Joël Robuchon?",
        "I'm craving a buffet, can you recommend a place with a good buffet",
        "I need a reservation for a table of 4 at a fine dining spot Closeout time",
        "I'm looking for a restaurant that offers vegetarian options and has a good selection of mussels",
        "I'm looking for a non-smoking restaurant near Del Posto.",
        "Where can I find the nearest Irish pub with live music?",
        "What restaurants in the area are open for late-night dining?",
        "I'm looking to have dinner at Twin Peaks Restaurant, where is the nearest location?",
        "Can you recommend a restaurant with outstanding dining options?",
        "What is the AAA Diamond rating for Fogo de Chao?",
        "I'm craving seafood, where can I find the best coastal restaurant with a patio?",
        "Can you recommend a nearby restaurant with outdoor seating and a view of the water?",
        "I'm craving some seafood, is there a good seafood restaurant not too far from Brio Tuscan Grille ?",
        "what are the operating hours of the nearest sushi bar?",
        "I'm looking for a restaurant with outdoor seating and a moderate price range.",
        "I'm craving some Thai food, can you recommend a highly-rated restaurant?",
        "Can you recommend any good restaurants in Dallas for a family dinner?",
        "I'm looking for some Expensive Gastro-pubs in the area with a good wine selection",
        "Can you recommend a seafood restaurant with outdoor seating and a view of the ocean?",
        "Where can I find an authentic Chinese restaurant that serves delicious Chow Mein",
        "Can you recommend a nearby restaurant that serves authentic Italian cuisine for dinner tonight?",
        "Can you recommend a good restaurant with all-day dining?",
        "Where is the closest cafe for a good Cafe Mocha?",
        "I'm looking for a restaurant with a great menu for happy hour. Where's the closest one?",
        "i'm craving Italian food, is there a good Italian restaurant close to Viale dei Romani",
        "I'm in the mood for some sushi, can you find me a sushi bar with outdoor seating and a view of the water?",
        "What's a good restaurant nearby that stays open late and has outdoor seating?",
        "I want to have dinner at a beachfront restaurant in the area",
        "What are the top-rated sushi restaurants in the Local area?",
        "What are the hours for the nearest Mediterranean grill?",
        "I'm craving some authentic Japanese cuisine, can you find me a place nearby?",
        "Can you recommend a seafood restaurant with a waterfront view and outdoor seating area?",
        "what are the hours for the Lebanese restaurant downtown",
        "which restaurants offer bottomless mimosa brunches on Sundays",
        "What's the best-rated seafood restaurant in this area?",
        "I'm looking for a fancy restaurant with a farm-to-table menu in the countryside",
        "What are the top-rated Italian restaurants in this area?",
        "What are the opening hours for The Cheesecake Factory on Main Street?",
        "What's the rating of the Italian restaurant downtown?",
        "Can you recommend a restaurant with a diverse menu that includes spring rolls ?",
        "I'm looking for a reservation at Faviken for tonight.",
        "what's the best-rated restaurant in town for Italian cuisine",
        "What are the top-rated restaurants in Buenos Aires?",
        "I'm craving some lobster bisque, is there a Panamanian restaurant nearby that offers it?",
        "Where can I find the best Scandinavian cuisine in the city center?",
        "I'm looking for a budget-friendly place to grab lunch. Any good places with vegetarian options?",
        "Can you recommend a nearby sports bar with a great selection of wings and beer?",
        "What are the opening hours for the seafood restaurant that serves the best calamari in town?",
        "What's the closest restaurant with a good menu for Seniors discounts?",
        "I'm craving some authentic Chinese cuisine, where can I find it around City center?",
        "I want to try some authentic sushi within walking distance from here, any suggestions?",
        "Can you recommend a cost-effective dining option in New York City with good vegetarian dishes?",
        "I'm craving some Italian food, can you suggest a good Italian restaurant nearby?",
        "what are the operating hours for the Italian restaurant that serves Spaghetti Carbonara",
        "I'm craving some burgers, where's the closest place to Dave & Buster's",
        "I want to steal a reservation at a fancy restaurant for tonight.",
        "What are the lunch hours for The Pizza Place?",
        "What restaurants nearby offer a diverse menu with gluten-free options?",
        "Where can I find a restaurant that serves authentic Greek gyro?",
        "I'm looking for a cozy and affordable artisanal cafe with outdoor seating.",
        "I'm craving some Taiwanese food, can you recommend a budget-friendly fare nearby?",
        "I'm in the mood for some Beef and Broccoli, where is the nearest place I can find it?",
        "I'm craving sushi, where's the best place to get it?",
        "I want to have a nice dinner in a garden setting, any suggestions",
        "Can you recommend a restaurant with a great location and a reasonable price for dinner tonight?",
        "Recommend a Up-and-coming restaurant with a diverse menu and outdoor seating",
        "What's the best seafood restaurant in the area? I'm looking for something upscale.",
        "I'm craving Mexican food, where can I find a highly rated taco place in Houston?",
        "Can you recommend a restaurant with Italian cuisine like Osteria Francescana?",
        "Can you recommend a restaurant with at least a AAA Diamond rating and a cocktail bar?",
        "I'm craving some authentic French baguettes, where can I find a bakery nearby?",
        "I'm craving some authentic Italian cuisine, do you know any place with pasta dishes and a cozy ambiance",
        "What are the hours of operation for the Italian restaurant near Coordinates ?",
        "What are the opening hours of Yard House on weekends?",
        "What are the operating hours for the nearby Italian restaurant?",
        "Can you recommend a nearby Italian restaurant with a rating above 4 stars?",
        "Can you recommend any Famous seafood restaurants in the area?",
        "What's the best Italian restaurant in this area?",
        "What are the prices like at Seasons 52 for a dinner for two?",
        "I want to try some authentic Italian pasta for dinner, any suggestions for Up-and-coming places?",
        "I'm craving some brisket for dinner, can you recommend a place?",
        "Recommend a restaurant with outdoor seating and a view near the waterfront.",
        "Can you recommend a place with outdoor seating and a location near the waterfront?",
        "I only have $15 for dinner, can you suggest any restaurants with affordable options near my location?",
        "Find me a vegan-friendly restaurant with a high rating",
        "I'm in the mood for some sushi, can you recommend a good Japanese restaurant nearby?",
        "I'm craving some Italian food, can you recommend a good restaurant in the area?",
        "can you recommend any outstanding restaurants in the area",
        "Do you know any restaurants that offer brunch specials hours?",
        "I'm looking for a restaurant with a diverse menu and reasonable prices, any suggestions?",
        "What's the best seafood restaurant in Prague for a special occasion dinner?",
        "I'm craving some authentic Italian pasta, can you recommend a restaurant with a high rating?",
        "What time does The Original Papa Joe's Restaurant close on Sundays?",
        "Is there a place nearby with affordable Italian cuisine?",
        "What type of cuisine does Gaggan serve?",
        "What are the popular area options for Italian restaurants in the city?",
        "What restaurants are known for their excellent seafood dishes?",
        "I'm craving Mexican food, where can I find a good taco place around here?",
        "what's the best Italian restaurant in this area",
        "Can you recommend a restaurant with a diverse international cuisine selection?",
        "is there a fast food joint nearby with a drive-thru",
        "Where can I find a restaurant in this area that serves delicious sushi?",
        "What are the hours for Italian Village Restaurant?",
        "Where can I grab a quick bite of soup and salad near the office for a reasonable price",
        "Can you recommend a restaurant on Main Street with a high rating?",
        "What are the dessert hours for TGI Fridays?",
        "Can I find a restaurant near me that is similar to Johnny Rockets in terms of price range?",
        "Can you recommend a restaurant with a good rating and affordable prices for dinner tonight?",
        "I need to grab a quick bite without breaking the bank. Any recommendations for affordable fast food options around here?",
        "What are the hours of operation for the sushi restaurant downtown?",
        "can you recommend a restaurant in San Francisco with a 4-star rating and great ambience",
        "I'm in the mood for Chinese food. What are the hours for Golden Dragon?",
        "What are some options for Italian restaurants with a rating of 4 stars or higher?",
        "I want to try some Paraguayan cuisine, is there a restaurant that serves it?",
        "What time does the vegan cafe close on Sundays?",
        "I'm craving Italian food, do you know of any place with a good pizza menu and outdoor seating?",
        "can you recommend a restaurant with a good rating in the downtown area",
        "What are the hours of the restaurant that offers Margherita Pizza?",
        "What time does Bubba Gump Shrimp Co. close tonight?",
        "What's The Diners Club's best choice for a restaurant in this area?",
        "I'm looking for a budget-friendly sushi place in Honolulu with a high rating.",
        "I'm craving Lebanese food, can you recommend a highly-rated restaurant in the area?",
        "I'm craving sushi, can you recommend any popular area sushi bars with outdoor seating?",
        "I'm craving some American cuisine, where can I find a good burger joint?",
        "I want to find a place with a high rating for dinner, any suggestions?",
        "I'm craving some Italian cuisine, where can I find a good place with reasonable prices?",
        "What are the best restaurants with otium amenities and outdoor seating in this city?",
        "What are some foodie favorites in the area for dinner?",
        "I'm looking for a restaurant with a patio for outdoor dining in the city center.",
        "Do you know any affordable places to eat in Paris with authentic French cuisine?",
        "What are the popular dishes at Olive Garden?",
        "Can you recommend any restaurants nearby that serve authentic kebabs?",
        "What are the operating hours for the nearest sushi restaurant from here?",
        "What Italian restaurants are open for dinner tonight?",
        "what are the opening hours for the finest Japanese restaurant in town",
        "Can you recommend a top-rated Italian restaurant in the downtown area?",
        "I need a restaurant with outdoor seating and a view of the ocean.",
        "Is there a restaurant with a great atmosphere and reasonable prices nearby?",
        "I need a budget-friendly restaurant with a good rating, can you help me find one?",
        "Can you recommend a restaurant with a great selection of escargot?",
        "What are the operating hours of A&W in this area?",
        "I'm craving some authentic Italian food, where can I find a good spot for that?",
        "Can you recommend any restaurants similar to Texas de Brazil in terms of ambiance and menu?",
        "What are the hours for the closest Italian restaurant?",
        "Which restaurant in this area has the highest rating for Himalayan cuisine?",
        "where can I find a restaurant with a drive-thru to grab a quick meal",
        "Where can I find a good place for Bangers and Mash?",
        "I'm looking for a restaurant that offers a discount for happy hour, can you help me find one?",
        "What's the price range for Belgian chocolate desserts in this area?",
        "Do you know of any affordable restaurants with a good rating in this area?",
        "I'm craving some authentic sushi. Where can I find a highly-rated sushi bar?",
        "I'm in the mood for some Italian food, any nearby options",
        "Can you recommend a seafood restaurant with a waterfront view?",
        "Is there a fine dining restaurant in this area with a prix fixe menu?",
        "show me the top-rated Lebanese restaurants in the area",
        "I'm craving some Bangers and Mash , where can I find a restaurant that offers British cuisine?",
        "What are the Google reviews for the Italian restaurant on Main Street?",
        "I'm looking for a restaurant with a diverse menu that offers vegan options and is within a reasonable price range.",
        "What are the top-rated seafood restaurants in the city?",
        "can you recommend a restaurant with a diverse cuisine selection and outdoor seating",
        "What restaurants around here offer a variety of seafood dishes?",
        "I'm craving some wood-fired cuisine, where is the nearest Firebirds Wood Fired Grill?",
        "I'm looking for a restaurant with a five-star rating and a prix fixe menu for dinner.",
        "What's the best Italian restaurant in the area according to customer reviews?",
        "I'm looking for a sports bar with a rooftop patio and a view of the city skyline.",
        "where can I find some famous Italian pasta dishes?",
        "I want to try some authentic Italian pasta, can you recommend a good restaurant?",
        "I'm craving some good Italian food, where can I find a place with great lasagna?",
        "I'm looking for a prestigious restaurant in the area serving Finnish cuisine, do you have any recommendations?",
        "I'm craving some Chinese food, can you recommend a place like The Golden Dragon nearby?",
        "which restaurant has the best craft beer selection",
        "Is there a Western Living-themed restaurant in the area?",
        "I want to try a new seafood dish, any suggestions?",
        "I'm craving some authentic Italian pasta, preferably in the midtown area. What's open late?",
        "What type of cuisine does Ted's Montana Grill offer for dinner",
        "I'm in the mood for some appetizers, where can I find a Yard House nearby?",
        "I'm looking for a restaurant with a good rating and reasonable prices, can you help me out?",
        "Can you recommend a restaurant nearby that has vegetarian options and is Walk-ins welcome ?",
        "What restaurants have dinner hours and TV screens for watching sports?",
        "I'm looking for affordable eats in the downtown area, any recommendations?",
        "What's the price range for sushi at the restaurant Sakura ?",
        "I'm in the mood for steak. Is there an Outback Steakhouse nearby with high ratings?",
        "I'm in the mood for a nice steak, can you recommend a dish at Black Angus Steakhouse",
        "I'm craving some Danish food, where can I find a good Danish restaurant?",
        "I want to have dinner at Red Robin tonight, what time does it close?",
        "I'm craving some Poutine, where can I find a place that serves it?",
        "What time does the Italian restaurant 'Pasta Palace' close on weekends?",
        "Can you recommend a place with a good selection of vegan dishes within walking distance?",
        "I'm craving some delicious kebab, can you recommend a nearby restaurant?",
        "can you recommend a hidden gem for authentic Italian cuisine with outdoor seating",
        "What restaurants are recommended by the Georgia Straight in this area?",
        "Can you recommend a restaurant with the best value for dinner tonight?",
        "Can you recommend a restaurant with good weekend hours and a delicious risotto dish?",
        "I'm looking for a budget-friendly seafood place in the Caribbean area, any suggestions?",
        "I want to take my date somewhere nice, with a romantic atmosphere and outdoor seating, where should I go?",
        "I'm craving Shrimp Scampi, where's the best place to get it?",
        "I heard there's a new New Zealand restaurant in town, can you help me find it?",
        "Where is the nearest Hooters with a full bar?",
        "I'm looking for a restaurant with Jamaican dishes that's affordable.",
        "I'm looking for a highly-rated sushi bar in the downtown area.",
        "I'm in the mood for some German food, where can I find a good German restaurant"
    ],
    "sentences": [
        "Can you suggest a restaurant with a good gluten-free menu and lakeside dining?",
        "I'm in the mood for some Caribbean food, can you recommend any restaurants with a great atmosphere and live music?",
        "I'm looking for a reasonably priced seafood restaurant with outdoor seating.",
        "What coastal restaurants serve authentic Bahamian cuisine for dinner?",
        "I'm looking for a restaurant with electric vehicle charging and a good selection of Italian dishes.",
        "Do you know of any banquet halls in the area that offer a diverse menu",
        "Where can I find the best Margherita Pizza in town?",
        "What are the opening times for Red Lobster in this area?",
        "Can you recommend a seafood restaurant around Fisherman's Wharf that is not expensive?",
        "Can you recommend any hidden gems for authentic Thai cuisine?",
        "Can you recommend a restaurant with New Zealand cuisine and accepts reservations?",
        "Can you recommend a reservation app for favorably-reviewed Italian restaurants near On the Border?",
        "What are some AAA Diamond Rated restaurants in the area?",
        "I'm craving some late-night snacking. Where can I find a Japanese restaurant open late?",
        "Can you provide me directions to Seasons 52?",
        "Where can I find some Scottish cuisine for dinner tonight?",
        "What time does Eddie V's Prime Seafood close out tonight?",
        "Can you make a reservation at Thai Orchid for 7 pm tonight?",
        "Can you recommend a restaurant with good burrito options and accepts reservations?",
        "What's the best Italian restaurant in town?",
        "I'm craving some sushi, where can I find the highest-rated sushi restaurant in town?",
        "I want a sweet treat. Can you find me the nearest ice cream parlor?",
        "I need to pick up an order of sushi in 30 minutes, where can I go?",
        "What are some options for late-night dining with high Yelp reviews?",
        "I'm looking for a place to eat that offers vegetarian options and has a 4-star rating on Yelp",
        "Can you recommend a restaurant with a high Infatuation score and a strategic position?",
        "I'm craving a Jersey Mike's Subs sandwich, can you find a location near the 90210 zip code",
        "What restaurants around here offer a price range of 20-30 dollars per person?",
        "I'm looking for a Paraguayan restaurant in the 10011 zip code",
        "I'm craving Cambodian food tonight. Can you recommend a restaurant?",
        "I'm in the mood for some sushi, where can I find a good sushi place?",
        "I'm craving sushi, where is the best sushi place around here?",
        "I'm craving some sushi, can you recommend a good sushi place nearby?",
        "I'm craving Chinese food delivery tonight, what are some options?",
        "I am craving sushi, is there a good sushi restaurant nearby?",
        "I'm craving sushi, where can I find a good sushi restaurant with outdoor seating?",
        "I'm craving sushi, can you recommend any good sushi places in Portland?",
        "What are the hours for The Portland Steakhouse?",
        "I'm craving some tandoori chicken. Where can I find the best tandoori chicken in town?",
        "What Japanese restaurants have a 5-star rating?",
        "I'm craving sushi, where can I find a good sushi place with a high rating and affordable prices?",
        "I'm in the mood for sushi, where can I find a good sushi restaurant with outdoor seating?",
        "I'm craving sushi, can you recommend a good sushi restaurant in Denver?",
        "I need a family-friendly restaurant with a kids' menu and a play area by 7 pm.",
        "What are some points of interest for Italian cuisine open late tonight?",
        "What are the hours for Italian restaurants in Houston?",
        "What are the hours for Last Call?",
        "I'm in the mood for some Gjusta, where is the nearest location?",
        "Directions to the nearest Italian restaurant that serves gluten-free pasta",
        "I'm looking for a vegetarian restaurant with a good rating for dinner hours.",
        "Can you recommend a Mexican restaurant with outdoor seating and a children's menu for dinner hours?",
        "What's the nearest Italian restaurant with a 4-star rating and a price range of $20-30 per person for dinner hours?",
        "I'm looking for a place with outdoor seating and a good selection from Eater's The National 38",
        "I'm in the mood for Italian food, where can I dine for less than $20 per person?",
        "What are the hours for Papa John's pizza?",
        "What are the hours for the nearest Chinese restaurant?",
        "Do you know of any Italian restaurants that offer a prix fixe menu for dinner?",
        "What are the hours for The Greek Island Taverna?",
        "Can you recommend a Thai restaurant with vegan options in the county?",
        "What time does the Mexican restaurant on Main Road close tonight?",
        "Can you suggest a must-try Italian restaurant in the downtown area?",
        "Can you recommend a restaurant with a wide tea selection and serving times before 5 p m",
        "What restaurants offer catering for a party of 20 people?",
        "Find me a restaurant with outdoor seating and a good wine selection",
        "Where can I get a reservation for a fancy seafood restaurant?",
        "What are the hours for the nearest Italian restaurant in Los Angeles?",
        "which restaurant around here serves authentic Italian pizza",
        "I'm looking for a restaurant close by with Thai cuisine and vegetarian options.",
        "Do you know a restaurant in the area that takes reservations for French cuisine?",
        "What restaurants in the area serve vegetarian options and are open for business hours?",
        "I am in the mood for a quick sandwich, can you find the nearest Jimmy John's location?",
        "I'm on a budget, can you recommend a place with affordable prices for dinner?",
        "What are the hours of the Italian restaurant with the best pizza in town?",
        "what's a good spot for falafel and hummus in the area?",
        "What is the rating of Himalayan restaurant?",
        "can you recommend a high-rated Italian restaurant with a prix fixe menu?",
        "I'm craving some pad thai, where can I find the best one in town?",
        "What's the best Italian restaurant in the downtown area?",
        "Do you know if Bonanza Steakhouse serves breakfast?",
        "What are the operating hours for the Italian restaurant near the convention center?",
        "I'm looking for a restaurant that serves authentic Brazilian cuisine like Texas de Brazil .",
        "I need to find a place with a high rating for dinner tonight, any suggestions?",
        "Do you know of any restaurants nearby with a high rating for seafood dishes?",
        "Can you recommend a Mexican restaurant with outdoor seating and good margaritas?",
        "I'm craving lamb curry, is there a restaurant serving it near the highway?",
        "Can you recommend a restaurant with great calamari?",
        "I'm craving some comfort food, where can I find the best mac and cheese in town?",
        "show me the most affordable place to get burgers with a high rating",
        "Where is the nearest Chipotle Mexican Grill located?",
        "I'm craving some Scandinavian food, can you find me a restaurant near Noma?",
        "What are the best Italian restaurants in the area that are open late on weekends?",
        "Please recommend a restaurant with outdoor seating near Landmarks in Toronto.",
        "What's a good spot for brunch in San Francisco with vegetarian options and reasonable prices?",
        "Find us a place with outdoor seating and a view of the city for The 50 Best Discovery rating.",
        "I'm craving some Mexican food, do you know any good restaurants nearby that have outdoor games?",
        "Can you suggest any restaurants near Dave & Buster's with a high rating",
        "I'd like to find a sushi place with a high rating in this area.",
        "I'm craving some delicious risotto for dinner tonight, can you recommend any restaurants that serve it?",
        "Can you recommend a place for a fancy dinner with a view within a reasonable price range?",
        "Do you know of any budget-friendly Indian restaurants open late for dinner?",
        "When does Fleming's Prime Steakhouse close on weekends?",
        "What are the prices like at the new sushi place downtown?",
        "Do you know of any restaurants in the area that serve Kenyan cuisine?",
        "I'm craving Brazilian cuisine, can you recommend a restaurant with late opening hours?",
        "find me a domestic restaurant nearby",
        "Can you tell me the operating hours of the nearest sushi bar?",
        "Can you recommend a place for dinner with outdoor seating and a view?",
        "where can I find a budget-friendly spot with air conditioning and a diverse menu",
        "What are the opening hours for the cheapest sushi place near Toronto ?",
        "I'm craving steak frites for dinner, where's the best place to get it?",
        "What's a restaurant with a high rating and affordable prices around here?",
        "I'm craving sushi, is there a highly rated Japanese restaurant in the area",
        "What is the best Italian restaurant in the area?",
        "What restaurants offer last orders after 10pm",
        "What's the address of the restaurant Gordon Ramsay recommended?",
        "I'm craving some modern fine dining. Is there a restaurant in the city that serves avant-garde dishes?",
        "What's the best Japanese restaurant in the area?",
        "Where can I find excellent tacos in this area?",
        "I'm craving a juicy steak for dinner. Can you recommend any good steakhouses in the area?",
        "What's the best place for Canadian cuisine in this area?",
        "Where can I find a reasonably priced Italian restaurant with a good rating?",
        "What are the top-rated seafood restaurants with outdoor seating and a waterfront view?",
        "I'm in the mood for some breakfast, where can I find a good spot for that?",
        "Is there a street with a variety of restaurants offering Italian cuisine?",
        "Can you recommend a nearby restaurant that serves Israeli cuisine?",
        "What are the hours of the nearest restaurant that serves Shawarma?",
        "What are the best restaurants in town for a meal under 20 dollars",
        "I'm craving some tiramisu, where can I find a restaurant with a great dessert menu?",
        "I'm in the mood for some authentic Filipino cuisine, where can I find a highly-rated restaurant?",
        "Can you recommend a scenic restaurant with Argentine cuisine?",
        "Find a nearby Italian restaurant open late with live music.",
        "Do you know of any good seafood places with outdoor seating and a view?",
        "Where can I find a nice Italian restaurant with a set menu for dinner tonight?",
        "What's the best Italian restaurant with outdoor seating in Downtown? Established",
        "Can you recommend a nice restaurant with Affordable Luxury for dinner tonight?",
        "What are the operating hours of the Italian restaurant with the highest rating in town?",
        "What are the operating hours of the Italian restaurant near the hotel?",
        "what's the best place in town for a fancy dinner with a view",
        "What are the hours of the Jamaican restaurant nearby?",
        "I'm looking for a budget-friendly restaurant with a great selection of seafood dishes",
        "I'm craving Indian cuisine, where can I find a good Indian restaurant nearby",
        "I need a restaurant with affordable French cuisine, any recommendations?",
        "What are the delivery hours for LongHorn Steakhouse in Seattle?",
        "Can you recommend any five-course restaurants nearby for early bird hours",
        "I'm in the mood for some Neighboring cuisine, where can I find that?",
        "What Chinese restaurants in the city have extended hours and offer dim sum?",
        "What are the operating hours of Black Bear Diner on weekends?",
        "are there any reasonable places to eat around here",
        "Can you recommend a restaurant with a good wine selection, preferably The Capital Grille?",
        "I'm in the mood for some sushi, where can I find a good sushi restaurant",
        "What are the hours of operation for Chez Panisse in Berkeley",
        "Where can I find a place with affordable prices and a variety of vegetarian dishes?",
        "Can you recommend a restaurant with a 4-star rating near the beach?",
        "I'm craving some authentic Dominican cuisine, where can I find a restaurant that serves it?",
        "Can you recommend a good seafood restaurant in the area?",
        "Where is The Greek Island Taverna located?",
        "I'm craving some sushi, where can I find a highly rated sushi restaurant in the area?",
        "what are the top-rated restaurants in Las Vegas",
        "Can you recommend any expensive gastro-pubs with a good wine selection?",
        "What are the best pizza places in this area?",
        "Where can I find a cut-price buffet with a wide selection of dishes?",
        "Can you recommend a good Nicaraguan restaurant in the area?",
        "Can you recommend a restaurant with The Independent's top spot for Italian cuisine around here?",
        "Where can I find low calorie options for lunch in this area?",
        "Can you recommend any upscale steakhouses in the area with outdoor seating?",
        "What's a good seafood restaurant with a waterfront location?",
        "Where can I find a restaurant that offers vegetarian options and is open past midnight?",
        "I'm craving fish and chips. Where is the best spot to get it?",
        "where can I find a 24-hour diner nearby?",
        "Where can I find a good Italian restaurant for dinner near Rossoblu ?",
        "Find a family-friendly diner with reasonable prices for breakfast",
        "What are the coffee service hours at the nearest cafe?",
        "What restaurants nearby offer an early bird special hours dinner menu?",
        "Is Golden Corral open for breakfast on weekdays?",
        "What are the hours of the Chinese restaurant in the city center?",
        "I'm craving some Dominican food, where can I find a good spot nearby?",
        "What restaurants near the farmers' market serve organic cuisine?",
        "show me the hours for the nearest Italian restaurant",
        "Where can I find a restaurant in the area that serves Mediterranean cuisine",
        "I'm in the mood for some Pakistani food, can you recommend a place in the neighborhood?",
        "Do you know any good sushi bars with outdoor seating and a view?",
        "what is the opening times of the nearest Italian restaurant",
        "What's a popular steakhouse with a children's menu and a 4-star rating?",
        "What time does Panera Bread close tonight?",
        "I want to try some authentic Indian food, can you recommend a good Indian restaurant open past 10 pm?",
        "What time is the service cut-off for late night dessert delivery in this area?",
        "Can you recommend a restaurant with outdoor seating and a vegetarian menu?",
        "I'm craving some authentic Italian pizza, where's the best place to get it?",
        "What is the best Italian restaurant in the city with a 5-star rating?",
        "I'm craving a sub sandwich, can you find the nearest Firehouse Subs?",
        "Can you recommend a highly-applauded Italian restaurant in the downtown area",
        "I'm looking for a budget-friendly restaurant with vegan options, any suggestions",
        "I'm craving some Apple pie right now. Where can I find a restaurant with a great dessert menu?",
        "I need a recommendation for a restaurant with a timeout menu.",
        "I'm in the mood for some Asian cuisine, can you recommend a good place for noodles?",
        "I'm looking for a hidden gem with outdoor seating and a waterfront view.",
        "I'm craving Italian cuisine, where can I find a good Italian restaurant nearby?",
        "I want to take a date somewhere with a romantic ambiance, any recommendations for a restaurant with a good atmosphere?",
        "What time does the Italian restaurant close tonight?",
        "what are the hours for the local italian restaurant",
        "What are the operating hours for Bahama Breeze this weekend?",
        "Can you make a reservation at Per Se for 7 pm tonight?",
        "Can you recommend a restaurant name in the area that offers a casual dining experience and is open late at night?",
        "Can you recommend a restaurant with 24-hour service that serves authentic Mexican cuisine?",
        "What are the business hours for the Italian restaurant near the park?",
        "I'm looking for a place with outdoor seating and live music near downtown.",
        "I'm craving some French cuisine, where can I find L'Atelier de Joël Robuchon?",
        "I'm craving a buffet, can you recommend a place with a good buffet",
        "I need a reservation for a table of 4 at a fine dining spot Closeout time",
        "I'm looking for a restaurant that offers vegetarian options and has a good selection of mussels",
        "I'm looking for a non-smoking restaurant near Del Posto.",
        "Where can I find the nearest Irish pub with live music?",
        "What restaurants in the area are open for late-night dining?",
        "I'm looking to have dinner at Twin Peaks Restaurant, where is the nearest location?",
        "Can you recommend a restaurant with outstanding dining options?",
        "What is the AAA Diamond rating for Fogo de Chao?",
        "I'm craving seafood, where can I find the best coastal restaurant with a patio?",
        "Can you recommend a nearby restaurant with outdoor seating and a view of the water?",
        "I'm craving some seafood, is there a good seafood restaurant not too far from Brio Tuscan Grille ?",
        "what are the operating hours of the nearest sushi bar?",
        "I'm looking for a restaurant with outdoor seating and a moderate price range.",
        "I'm craving some Thai food, can you recommend a highly-rated restaurant?",
        "Can you recommend any good restaurants in Dallas for a family dinner?",
        "I'm looking for some Expensive Gastro-pubs in the area with a good wine selection",
        "Can you recommend a seafood restaurant with outdoor seating and a view of the ocean?",
        "Where can I find an authentic Chinese restaurant that serves delicious Chow Mein",
        "Can you recommend a nearby restaurant that serves authentic Italian cuisine for dinner tonight?",
        "Can you recommend a good restaurant with all-day dining?",
        "Where is the closest cafe for a good Cafe Mocha?",
        "I'm looking for a restaurant with a great menu for happy hour. Where's the closest one?",
        "i'm craving Italian food, is there a good Italian restaurant close to Viale dei Romani",
        "I'm in the mood for some sushi, can you find me a sushi bar with outdoor seating and a view of the water?",
        "What's a good restaurant nearby that stays open late and has outdoor seating?",
        "I want to have dinner at a beachfront restaurant in the area",
        "What are the top-rated sushi restaurants in the Local area?",
        "What are the hours for the nearest Mediterranean grill?",
        "I'm craving some authentic Japanese cuisine, can you find me a place nearby?",
        "Can you recommend a seafood restaurant with a waterfront view and outdoor seating area?",
        "what are the hours for the Lebanese restaurant downtown",
        "which restaurants offer bottomless mimosa brunches on Sundays",
        "What's the best-rated seafood restaurant in this area?",
        "I'm looking for a fancy restaurant with a farm-to-table menu in the countryside",
        "What are the top-rated Italian restaurants in this area?",
        "What are the opening hours for The Cheesecake Factory on Main Street?",
        "What's the rating of the Italian restaurant downtown?",
        "Can you recommend a restaurant with a diverse menu that includes spring rolls ?",
        "I'm looking for a reservation at Faviken for tonight.",
        "what's the best-rated restaurant in town for Italian cuisine",
        "What are the top-rated restaurants in Buenos Aires?",
        "I'm craving some lobster bisque, is there a Panamanian restaurant nearby that offers it?",
        "Where can I find the best Scandinavian cuisine in the city center?",
        "I'm looking for a budget-friendly place to grab lunch. Any good places with vegetarian options?",
        "Can you recommend a nearby sports bar with a great selection of wings and beer?",
        "What are the opening hours for the seafood restaurant that serves the best calamari in town?",
        "What's the closest restaurant with a good menu for Seniors discounts?",
        "I'm craving some authentic Chinese cuisine, where can I find it around City center?",
        "I want to try some authentic sushi within walking distance from here, any suggestions?",
        "Can you recommend a cost-effective dining option in New York City with good vegetarian dishes?",
        "I'm craving some Italian food, can you suggest a good Italian restaurant nearby?",
        "what are the operating hours for the Italian restaurant that serves Spaghetti Carbonara",
        "I'm craving some burgers, where's the closest place to Dave & Buster's",
        "I want to steal a reservation at a fancy restaurant for tonight.",
        "What are the lunch hours for The Pizza Place?",
        "What restaurants nearby offer a diverse menu with gluten-free options?",
        "Where can I find a restaurant that serves authentic Greek gyro?",
        "I'm looking for a cozy and affordable artisanal cafe with outdoor seating.",
        "I'm craving some Taiwanese food, can you recommend a budget-friendly fare nearby?",
        "I'm in the mood for some Beef and Broccoli, where is the nearest place I can find it?",
        "I'm craving sushi, where's the best place to get it?",
        "I want to have a nice dinner in a garden setting, any suggestions",
        "Can you recommend a restaurant with a great location and a reasonable price for dinner tonight?",
        "Recommend a Up-and-coming restaurant with a diverse menu and outdoor seating",
        "What's the best seafood restaurant in the area? I'm looking for something upscale.",
        "I'm craving Mexican food, where can I find a highly rated taco place in Houston?",
        "Can you recommend a restaurant with Italian cuisine like Osteria Francescana?",
        "Can you recommend a restaurant with at least a AAA Diamond rating and a cocktail bar?",
        "I'm craving some authentic French baguettes, where can I find a bakery nearby?",
        "I'm craving some authentic Italian cuisine, do you know any place with pasta dishes and a cozy ambiance",
        "What are the hours of operation for the Italian restaurant near Coordinates ?",
        "What are the opening hours of Yard House on weekends?",
        "What are the operating hours for the nearby Italian restaurant?",
        "Can you recommend a nearby Italian restaurant with a rating above 4 stars?",
        "Can you recommend any Famous seafood restaurants in the area?",
        "What's the best Italian restaurant in this area?",
        "What are the prices like at Seasons 52 for a dinner for two?",
        "I want to try some authentic Italian pasta for dinner, any suggestions for Up-and-coming places?",
        "I'm craving some brisket for dinner, can you recommend a place?",
        "Recommend a restaurant with outdoor seating and a view near the waterfront.",
        "Can you recommend a place with outdoor seating and a location near the waterfront?",
        "I only have $15 for dinner, can you suggest any restaurants with affordable options near my location?",
        "Find me a vegan-friendly restaurant with a high rating",
        "I'm in the mood for some sushi, can you recommend a good Japanese restaurant nearby?",
        "I'm craving some Italian food, can you recommend a good restaurant in the area?",
        "can you recommend any outstanding restaurants in the area",
        "Do you know any restaurants that offer brunch specials hours?",
        "I'm looking for a restaurant with a diverse menu and reasonable prices, any suggestions?",
        "What's the best seafood restaurant in Prague for a special occasion dinner?",
        "I'm craving some authentic Italian pasta, can you recommend a restaurant with a high rating?",
        "What time does The Original Papa Joe's Restaurant close on Sundays?",
        "Is there a place nearby with affordable Italian cuisine?",
        "What type of cuisine does Gaggan serve?",
        "What are the popular area options for Italian restaurants in the city?",
        "What restaurants are known for their excellent seafood dishes?",
        "I'm craving Mexican food, where can I find a good taco place around here?",
        "what's the best Italian restaurant in this area",
        "Can you recommend a restaurant with a diverse international cuisine selection?",
        "is there a fast food joint nearby with a drive-thru",
        "Where can I find a restaurant in this area that serves delicious sushi?",
        "What are the hours for Italian Village Restaurant?",
        "Where can I grab a quick bite of soup and salad near the office for a reasonable price",
        "Can you recommend a restaurant on Main Street with a high rating?",
        "What are the dessert hours for TGI Fridays?",
        "Can I find a restaurant near me that is similar to Johnny Rockets in terms of price range?",
        "Can you recommend a restaurant with a good rating and affordable prices for dinner tonight?",
        "I need to grab a quick bite without breaking the bank. Any recommendations for affordable fast food options around here?",
        "What are the hours of operation for the sushi restaurant downtown?",
        "can you recommend a restaurant in San Francisco with a 4-star rating and great ambience",
        "I'm in the mood for Chinese food. What are the hours for Golden Dragon?",
        "What are some options for Italian restaurants with a rating of 4 stars or higher?",
        "I want to try some Paraguayan cuisine, is there a restaurant that serves it?",
        "What time does the vegan cafe close on Sundays?",
        "I'm craving Italian food, do you know of any place with a good pizza menu and outdoor seating?",
        "can you recommend a restaurant with a good rating in the downtown area",
        "What are the hours of the restaurant that offers Margherita Pizza?",
        "What time does Bubba Gump Shrimp Co. close tonight?",
        "What's The Diners Club's best choice for a restaurant in this area?",
        "I'm looking for a budget-friendly sushi place in Honolulu with a high rating.",
        "I'm craving Lebanese food, can you recommend a highly-rated restaurant in the area?",
        "I'm craving sushi, can you recommend any popular area sushi bars with outdoor seating?",
        "I'm craving some American cuisine, where can I find a good burger joint?",
        "I want to find a place with a high rating for dinner, any suggestions?",
        "I'm craving some Italian cuisine, where can I find a good place with reasonable prices?",
        "What are the best restaurants with otium amenities and outdoor seating in this city?",
        "What are some foodie favorites in the area for dinner?",
        "I'm looking for a restaurant with a patio for outdoor dining in the city center.",
        "Do you know any affordable places to eat in Paris with authentic French cuisine?",
        "What are the popular dishes at Olive Garden?",
        "Can you recommend any restaurants nearby that serve authentic kebabs?",
        "What are the operating hours for the nearest sushi restaurant from here?",
        "What Italian restaurants are open for dinner tonight?",
        "what are the opening hours for the finest Japanese restaurant in town",
        "Can you recommend a top-rated Italian restaurant in the downtown area?",
        "I need a restaurant with outdoor seating and a view of the ocean.",
        "Is there a restaurant with a great atmosphere and reasonable prices nearby?",
        "I need a budget-friendly restaurant with a good rating, can you help me find one?",
        "Can you recommend a restaurant with a great selection of escargot?",
        "What are the operating hours of A&W in this area?",
        "I'm craving some authentic Italian food, where can I find a good spot for that?",
        "Can you recommend any restaurants similar to Texas de Brazil in terms of ambiance and menu?",
        "What are the hours for the closest Italian restaurant?",
        "Which restaurant in this area has the highest rating for Himalayan cuisine?",
        "where can I find a restaurant with a drive-thru to grab a quick meal",
        "Where can I find a good place for Bangers and Mash?",
        "I'm looking for a restaurant that offers a discount for happy hour, can you help me find one?",
        "What's the price range for Belgian chocolate desserts in this area?",
        "Do you know of any affordable restaurants with a good rating in this area?",
        "I'm craving some authentic sushi. Where can I find a highly-rated sushi bar?",
        "I'm in the mood for some Italian food, any nearby options",
        "Can you recommend a seafood restaurant with a waterfront view?",
        "Is there a fine dining restaurant in this area with a prix fixe menu?",
        "show me the top-rated Lebanese restaurants in the area",
        "I'm craving some Bangers and Mash , where can I find a restaurant that offers British cuisine?",
        "What are the Google reviews for the Italian restaurant on Main Street?",
        "I'm looking for a restaurant with a diverse menu that offers vegan options and is within a reasonable price range.",
        "What are the top-rated seafood restaurants in the city?",
        "can you recommend a restaurant with a diverse cuisine selection and outdoor seating",
        "What restaurants around here offer a variety of seafood dishes?",
        "I'm craving some wood-fired cuisine, where is the nearest Firebirds Wood Fired Grill?",
        "I'm looking for a restaurant with a five-star rating and a prix fixe menu for dinner.",
        "What's the best Italian restaurant in the area according to customer reviews?",
        "I'm looking for a sports bar with a rooftop patio and a view of the city skyline.",
        "where can I find some famous Italian pasta dishes?",
        "I want to try some authentic Italian pasta, can you recommend a good restaurant?",
        "I'm craving some good Italian food, where can I find a place with great lasagna?",
        "I'm looking for a prestigious restaurant in the area serving Finnish cuisine, do you have any recommendations?",
        "I'm craving some Chinese food, can you recommend a place like The Golden Dragon nearby?",
        "which restaurant has the best craft beer selection",
        "Is there a Western Living-themed restaurant in the area?",
        "I want to try a new seafood dish, any suggestions?",
        "I'm craving some authentic Italian pasta, preferably in the midtown area. What's open late?",
        "What type of cuisine does Ted's Montana Grill offer for dinner",
        "I'm in the mood for some appetizers, where can I find a Yard House nearby?",
        "I'm looking for a restaurant with a good rating and reasonable prices, can you help me out?",
        "Can you recommend a restaurant nearby that has vegetarian options and is Walk-ins welcome ?",
        "What restaurants have dinner hours and TV screens for watching sports?",
        "I'm looking for affordable eats in the downtown area, any recommendations?",
        "What's the price range for sushi at the restaurant Sakura ?",
        "I'm in the mood for steak. Is there an Outback Steakhouse nearby with high ratings?",
        "I'm in the mood for a nice steak, can you recommend a dish at Black Angus Steakhouse",
        "I'm craving some Danish food, where can I find a good Danish restaurant?",
        "I want to have dinner at Red Robin tonight, what time does it close?",
        "I'm craving some Poutine, where can I find a place that serves it?",
        "What time does the Italian restaurant 'Pasta Palace' close on weekends?",
        "Can you recommend a place with a good selection of vegan dishes within walking distance?",
        "I'm craving some delicious kebab, can you recommend a nearby restaurant?",
        "can you recommend a hidden gem for authentic Italian cuisine with outdoor seating",
        "What restaurants are recommended by the Georgia Straight in this area?",
        "Can you recommend a restaurant with the best value for dinner tonight?",
        "Can you recommend a restaurant with good weekend hours and a delicious risotto dish?",
        "I'm looking for a budget-friendly seafood place in the Caribbean area, any suggestions?",
        "I want to take my date somewhere nice, with a romantic atmosphere and outdoor seating, where should I go?",
        "I'm craving Shrimp Scampi, where's the best place to get it?",
        "I heard there's a new New Zealand restaurant in town, can you help me find it?",
        "Where is the nearest Hooters with a full bar?",
        "I'm looking for a restaurant with Jamaican dishes that's affordable.",
        "I'm looking for a highly-rated sushi bar in the downtown area.",
        "I'm in the mood for some German food, where can I find a good German restaurant"
    ]
}