{
    "entity-not-found": [
        "Billie Eilish collaborates with famous fashion brand for new clothing line.",
        "Zurich-based pharmaceutical company announces breakthrough in cancer research.",
        "President Biden signs executive order to address climate change.",
        "London police arrest suspect in connection with the recent string of robberies.",
        "Global stock markets experience sharp decline following trade tensions between China and the US.",
        "Boeing Company announces plans to cut 10,000 jobs.",
        "CEO Tim Cook announces new product launch for Apple Inc. .",
        "Stock prices soar following record-breaking quarterly earnings report from Apple Inc. .",
        "Protesters gather outside Apple Inc. headquarters to demand better working conditions.",
        "The popular subreddit r/aww reaches 10 million subscribers.",
        "Montreal Canadiens defeat Toronto Maple Leafs in overtime.",
        "The mayor of Montreal announces a new public transit plan.",
        "Protesters clash with police during Black Lives Matter demonstration in downtown Los Angeles.",
        "Black Lives Matter activist delivers powerful speech at civil rights rally in Washington D.C.",
        "New movie starring Robert Downey Jr. breaks box office records.",
        "Robert Downey Jr. launches new environmental organization to combat climate change.",
        "Russian opposition leader Alexei Navalny jailed for 30 days.",
        "Russian opposition leader Alexei Navalny hospitalized after suspected poisoning.",
        "Stock prices soar as rumors circulate about potential partnership between Apple Inc. and Tesla.",
        "California judge rules in favor of Apple Inc. in patent infringement case.",
        "ISIS claims responsibility for bombing at airport in Europe.",
        "The Seattle Seahawks won their game against the Arizona Cardinals.",
        "Turkish President meets with Greek Prime Minister in Ankara.",
        "Xi Jinping meets with Russian President Vladimir Putin to discuss bilateral cooperation."
    ],
    "entity-not-found-overlap": [
        "The Jakarta Symphony Orchestra will be performing at the grand opening of the new cultural center.",
        "The CEO of Bank of America resigns after financial misconduct allegations.",
        "Cairo Symphony Orchestra to perform at Ankara International Music Festival.",
        "Montreal Symphony Orchestra announces new season lineup.",
        "Angela Davis gives a speech at the University of California, Berkeley on social justice.",
        "CEO of Apple Inc. announces new product launch date.",
        "The president of the National Bank of Buenos Aires announces new interest rates.",
        "The Vienna Philharmonic Orchestra to perform in Delhi next month.",
        "Miami Heat trade for All-Star forward to bolster their roster for the upcoming season.",
        "Boston Symphony Orchestra to hold virtual concerts this summer.",
        "Martin Luther King Jr. Memorial Foundation holds annual scholarship event."
    ],
    "not-allowed-entity-type": [
        "Apple announces record-breaking sales for new iPhone model.",
        "Tech giant Apple announces new line of iPhone models.",
        "Tokyo to host 2021 Summer Olympics despite concerns over COVID-19.",
        "Apple unveils new iPhone with 5G capabilities.",
        "Apple Inc. unveils new line of iPhones.",
        "Apple Inc. announces launch of new iPhone model.",
        "Reykjavik University announces groundbreaking research in renewable energy.",
        "Tech giant Apple Inc. announces release date for new iPhone.",
        "Apple Inc. announces new iPhone launch date.",
        "Apple announces the release of its latest iPhone model.",
        "Apple Inc. launches new iPhone model.",
        "Brazilian soccer star scores winning goal in World Cup match.",
        "Sydney Opera House reopens for live performances.",
        "APPLE ANNOUNCES RELEASE DATE FOR IPHONE 13.",
        "HURRICANE IDA DEVASTATES LOUISIANA COASTLINE.",
        "Apple reveals new iPhone with enhanced camera features and 5G capabilities",
        "National Public Radio launches a new podcast series on climate change.",
        "Apple announces new iPhone release date.",
        "Apple releases new iPhone with enhanced camera features.",
        "Apple Inc. unveils new iPhone model at highly anticipated product launch event.",
        "Tech giant Apple unveils new iPhone models.",
        "President Biden to deliver State of the Union address on Tuesday.",
        "Apple unveils new iPhone with faster processor and improved camera capabilities.",
        "National Aeronautics and Space Administration plans to launch a new satellite to monitor climate change."
    ],
    "missing-entity-type": [
        "Local organization to host charity event for homeless population.",
        "Local organization provides aid to refugees in war-torn region.",
        "Local organization raises funds for homeless shelters",
        "Local organization hosts annual charity gala to raise funds for homeless shelter.",
        "Local organization hosts fundraiser to support families affected by recent natural disasters.",
        "Local organization in Quito organizes charity event for orphaned children.",
        "New study shows link between social media use and mental health issues among teenagers.",
        "Global organization holds conference to address climate change concerns.",
        "Apple Inc. unveils new line of iPhones with advanced 5G technology at virtual product launch event."
    ],
    "low-logprob": [
        "Mike Pence's visit to Japan strengthens bilateral trade ties.",
        "The World Trade Organization released a report on global trade tensions.",
        "President Jokowi to visit Jakarta for economic summit.",
        "Jay-Z's music label signs new up-and-coming artist.",
        "Mike Pence delivers keynote speech at Republican National Convention.",
        "NATO to increase presence in Eastern Europe to deter Russian aggression.",
        "Los Angeles mayor announces new housing initiative.",
        "American Cancer Society launches new initiative to improve access to cancer screenings in underserved communities.",
        "Former Barcelona player Lionel Messi signs with Paris Saint-Germain.",
        "Microsoft acquires cybersecurity firm for $10 billion.",
        "President Biden to meet with European leaders in Brussels to discuss trade agreements.",
        "Montreal artist wins prestigious international award.",
        "Hurricane Ida causes widespread damage in Louisiana and Mississippi.",
        "Tim Cook announces Apple's new product launch event in Berlin.",
        "Tesla announces plans to open new manufacturing facility in Texas.",
        "Quito sees an influx of tourists after being named a UNESCO World Heritage Site.",
        "Facebook CEO Mark Zuckerberg testifies before Congress on data privacy.",
        "George W. Bush Foundation for Military Service members announces new scholarship program.",
        "The CEO of Ford Motor Company predicts a surge in demand for electric cars in the next decade.",
        "Johnson & Johnson to pay $572 million in landmark opioid trial settlement.",
        "Japan's Tokyo Olympics officially kick off.",
        "Concerns rise as tensions escalate between Iran and the International Energy Agency.",
        "The Federal Aviation Administration issues new safety guidelines for Boeing 737 MAX planes.",
        "The United Nations Security Council votes to impose new sanctions on North Korea.",
        "Warren Buffett's Berkshire Hathaway invests $500 million in Brazilian digital bank.",
        "The government announced a new transportation infrastructure plan for Jakarta.",
        "International Red Cross deploys relief teams to flood-affected areas in Southeast Asia.",
        "Austrian Chancellor Kurz meets with World Trade Organization delegates in Vienna to discuss trade policies.",
        "Elon Omar speaks at the United Nations Climate Summit in New York City.",
        "European Union imposes sanctions on Belarusian officials, prompting strong response from Sergey Lavrov.",
        "The CEO of a major tech company in Ankara announced a new product launch.",
        "New York City Mayor meets with Pope Francis at Vatican.",
        "Indian government bans TikTok and 58 other Chinese apps.",
        "Angela Merkel meets with French President Macron to discuss trade relations.",
        "Martin Scorsese to collaborate with Beijing Film Academy on new film project.",
        "President Biden meets with leaders from various environmental organizations.",
        "Auckland reports record-high temperatures as heatwave continues to sweep through New Zealand.",
        "New South Wales government announces major infrastructure plan for Sydney.",
        "Elon Musk announces plans to build new Tesla manufacturing plant in Texas.",
        "Kourtney Kardashian spotted with new boyfriend in Paris.",
        "President Jokowi announces new economic policies to boost growth in Jakarta.",
        "Kim Jong Un meets with South Korean president for historic peace talks.",
        "President Obama visits Robben Island, where Nelson Mandela spent 18 years as a political prisoner.",
        "Greek authorities have arrested three suspects in the Athens bombing.",
        "Scott Morrison meets with leaders from G7 countries to discuss climate change.",
        "Montreal Canadiens defeat Toronto Maple Leafs in overtime thriller.",
        "Belgium plans to invest $1 billion in renewable energy projects in Brussels.",
        "New Zealand Prime Minister visits Auckland to discuss climate change.",
        "NATO to hold emergency meeting in response to escalation of conflict in Eastern Europe.",
        "UNICEF launches vaccination campaign in war-torn Syrian city.",
        "Tokyo Olympics officially begin with opening ceremony.",
        "Donald Trump speech at World Economic Forum calls for global cooperation.",
        "Emmanuel Macron delivers a speech at the United Nations General Assembly in New York City.",
        "Australian Prime Minister Scott Morrison visits Brussels to discuss trade agreements with the European Union.",
        "Dallas Mavericks advance to NBA playoffs.",
        "Police arrest suspect in London stabbing.",
        "Hurricane Florence makes landfall in North Carolina.",
        "Hip-hop mogul Jay-Z launches new streaming service.",
        "Former United Parcel Service CEO appointed as new chairman of board.",
        "Caracas-based oil company reports significant increase in profits.",
        "Violent protests erupt in Johannesburg following controversial police shooting.",
        "The Jakarta Post reports record-breaking heatwave in Jakarta.",
        "German Chancellor Angela Merkel visits Rohingya refugee camps in Bangladesh.",
        "Canberra to host international climate summit next year.",
        "Boeing Company to lay off 6,770 US employees.",
        "Greenpeace activists protest in Caracas over environmental issues.",
        "Volodymyr Zelensky, the President of Ukraine, delivers a speech at the United Nations General Assembly.",
        "Toronto mayor announces new public transportation initiative.",
        "Senate confirms Amy Coney Barrett to succeed Ruth Bader Ginsburg on the Supreme Court.",
        "The latest outbreak of Ebola in Africa has prompted Doctors Without Borders to deploy medical teams to the affected areas.",
        "New study shows increase in pollution levels in major cities.",
        "Discussions between European Union leaders and the United Kingdom on Brexit negotiations result in a new agreement.",
        "Miami Heat signs top free agent from Oslo.",
        "Aung San Suu Kyi calls for international aid to address Rohingya refugee crisis.",
        "Queen Elizabeth II celebrates her 70th year as monarch.",
        "U.S. urges NATO members to increase defense spending.",
        "Apple launches new iPhone with advanced facial recognition technology.",
        "Shakira's charity organization donates $1 million to the earthquake relief efforts in Haiti.",
        "Canadian Prime Minister Justin Trudeau meets with Colombian singer Shakira to discuss education funding.",
        "Researcher at National Institutes of Health discovers potential treatment for rare genetic disorder.",
        "Pro-democracy protests continue in Hong Kong as tensions rise with Chinese government.",
        "Local tech company to open new headquarters in San Francisco.",
        "Tel Aviv celebrates Pride Month with a colorful parade.",
        "Major oil organizations report decreased profits amid global market uncertainty.",
        "Doctors Without Borders provide medical aid to remote villages in Africa.",
        "Apple's new iPhone 13 to be released next month.",
        "European Central Bank President calls for fiscal stimulus to counter economic slowdown.",
        "Elon Musk announces plans to build a new SpaceX facility in Nairobi.",
        "The CEO of Apple Inc. announced a new product launch event next month.",
        "Supreme Court Justice John Roberts delivers the majority opinion in landmark case.",
        "Dr. Anthony Fauci advises caution as COVID-19 cases rise in several states.",
        "Joe Biden meets with European leaders to discuss international trade agreements.",
        "Dr. Amanda Smith appointed as new head of medical research at the University of California.",
        "New York City Marathon canceled due to extreme weather conditions.",
        "FC Barcelona signs sponsorship deal with a global technology company.",
        "Sydney native wins gold medal in swimming competition.",
        "The World Meteorological Organization forecasts extreme weather conditions in the Pacific region.",
        "New startup company in Edinburgh secures funding for expansion.",
        "Famous actress reveals her pregnancy news on Instagram.",
        "Celebrity chef opens new restaurant in Beirut.",
        "LeBron James signs four-year contract with the Los Angeles Lakers.",
        "Local organization donates to charity for wildlife conservation efforts.",
        "Bogotá Mayor announces new public transportation project.",
        "New York City Mayor announces plan to invest in renewable energy sources.",
        "Protesters gather outside the United States Department of Defense headquarters in Arlington, Virginia.",
        "Elon Musk's SpaceX successfully launches Falcon 9 rocket.",
        "Australian Prime Minister Scott Morrison addresses nation regarding economic recovery plan.",
        "The mayor of Rio de Janeiro announces new infrastructure plan for the city.",
        "Tsunami warning issued for Pacific coast.",
        "Sergey Brin, co-founder of Google, announces new venture into space exploration.",
        "Amazon CEO, Jeff Bezos, steps down from his position, handing over the reins to Andy Jassy.",
        "Selena Gomez releases new single 'Baila Conmigo' featuring Rauw Alejandro.",
        "Texan voters reelect Ted Cruz to U.S. Senate.",
        "Prime Minister of Australia travels to Canberra for emergency meeting.",
        "UNESCO announces new World Heritage Sites for 2022.",
        "India announces ambitious plan to tackle air pollution in Delhi.",
        "Apple unveils new line of iPhone models at annual product launch event.",
        "London-based company receives funding for renewable energy project.",
        "Pope Francis condemns violence in the Middle East during his visit to Iraq.",
        "Bogotá-based company awarded government contract for infrastructure project.",
        "The University of Washington football team defeated Stanford in a close game.",
        "The National Basketball Association cancels games due to COVID-19 outbreak.",
        "Elon Musk's SpaceX successfully launches 60 more Starlink satellites.",
        "Volodymyr Zelensky delivers speech at United Nations headquarters in New York.",
        "The United Nations has announced a new aid package for refugees in Cape Town .",
        "Bradley Cooper to star in upcoming movie set in Bangkok.",
        "Vienna Mayor announces new public transportation initiatives.",
        "Tel Aviv mayor announces new public transportation initiatives to reduce traffic congestion.",
        "Warsaw stock exchange sees significant increase in trading volume.",
        "An American Cancer Society fundraiser in Chicago raised over $100,000 for cancer research.",
        "Time Magazine names Prague as the top travel destination for 2022.",
        "Bogotá's mayor announces new public transportation initiative.",
        "Major electronics company headquartered in Seoul sees 15% increase in profits.",
        "Lebron James scores 45 points in Lakers' victory over Warriors.",
        "Prince Harry spotted at charity event in London.",
        "Tim Cook, CEO of Apple, visits Berlin to discuss potential collaborations with local tech startups.",
        "The United Nations Secretary-General meets with Queen Elizabeth II to discuss global peace initiatives.",
        "CEO of The Walt Disney Company steps down amidst controversy.",
        "John Roberts sworn in as Supreme Court Chief Justice.",
        "Queen Elizabeth II celebrates her diamond jubilee with a grand parade through London.",
        "Mitt Romney announces his candidacy for Utah Senate seat.",
        "First Lady Melania Trump visits International Organization for Migration facility in Guatemala.",
        "European Union imposes sanctions on Russian officials.",
        "LeBron James signs multi-million dollar endorsement deal with Nike.",
        "Australian Prime Minister to visit Sydney for climate change summit.",
        "Global leaders gather in New York for United Nations General Assembly",
        "Investigation reveals that the Helsinki-based company was involved in illegal arms trade.",
        "The OPEC members met in Wellington to discuss oil production cuts.",
        "New York City Marathon route to include iconic landmarks.",
        "Marjorie Taylor Greene's controversial comments spark debate in Congress.",
        "Elon Musk's SpaceX successfully launches 60 more Starlink satellites into orbit.",
        "Kourtney Kardashian launches her new lifestyle brand Poosh.",
        "President Biden meets with German Chancellor Angela Merkel in Washington.",
        "APPLE ANNOUNCES LAUNCH OF NEW IPHONE MODEL.",
        "Edinburgh University research team makes breakthrough in cancer treatment.",
        "Apple Inc. unveils its latest iPhone model with enhanced camera features",
        "ISIS claims responsibility for bombing in Baghdad.",
        "Berlin Philharmonic Orchestra cancels upcoming concerts due to strike.",
        "Greenpeace activists protest outside the Hanoi government building.",
        "New Harry Potter theme park opens in Orlando, Florida featuring attractions based on J.K. Rowling's books.",
        "Turkey's President visits Istanbul to discuss economic policies.",
        "Supreme Court Justice Ruth Bader Ginsburg hospitalized for treatment of possible infection.",
        "New study reveals alarming increase in pollution levels in major cities.",
        "India's Prime Minister to meet with President of Nepal for bilateral talks.",
        "Samsung recalls faulty washing machines in North America.",
        "Brad Pitt signs deal with major film production company.",
        "The Nobel Prize in Literature awarded to an American author for his outstanding work.",
        "CEO of Tesla, Elon Musk, announces plans to open a new Gigafactory in Yangon .",
        "United Nations calls for immediate ceasefire in war-torn region.",
        "Toronto Raptors defeat LA Lakers in NBA Finals Game 3.",
        "Ankara-based organization launches new initiative to combat poverty in the region.",
        "President Jokowi announces new infrastructure plan for Jakarta.",
        "Seoul Mayor announces new initiative to reduce air pollution in the city.",
        "Nelson Mandela Foundation celebrates the life and legacy of Nelson Mandela on his 100th birthday.",
        "Local organization in Beirut launches community recycling program to combat pollution.",
        "United States Department of State issues travel advisory for several countries in the Middle East.",
        "Mount Everest reopens to climbers after two-year closure due to COVID-19.",
        "Saudi Arabia welcomes investment from Sony in Riyadh.",
        "Rosalía wins Best New Artist at the Latin Grammy Awards.",
        "The Budapest Stock Exchange experienced a sharp decline in trading volume.",
        "Malala Yousafzai wins Nobel Peace Prize for her activism in education.",
        "Greenpeace protests outside London headquarters of oil company.",
        "Environmental organization led by Brad Pitt launches new conservation initiative.",
        "CELEBRITY CHEF GORDON RAMSAY OPENS NEW RESTAURANT IN LAS VEGAS.",
        "Hillary Clinton delivers keynote address at annual technology conference.",
        "Protests erupt in Caracas as opposition leader is arrested.",
        "Elon Musk's SpaceX successfully launches another batch of Starlink satellites into orbit.",
        "The United Nations and the International Organization for Standardization collaborate on a project to promote sustainable development in Africa.",
        "Montreal to host international film festival next month.",
        "J.K. Rowling's new novel tops bestseller lists in the UK and US.",
        "Dwayne \"The Rock\" Johnson announces new production company.",
        "Angela Merkel visits United States to discuss trade agreements.",
        "National Aeronautics and Space Administration announces new mission to Mars.",
        "Apple CEO Tim Cook to deliver keynote speech at technology conference in Brussels.",
        "Buckingham Palace announces Queen Elizabeth II's upcoming state visit to Canada.",
        "French President Macron meets with leaders of the European Union to discuss economic recovery efforts.",
        "New York City Mayor announces plan to improve public transportation.",
        "Prime Minister Boris Johnson visits Pfizer Inc. headquarters in New York.",
        "Protests erupt in Delhi after visit of Narendra Modi.",
        "Apple Inc. announces the release of the new iPhone 13.",
        "The CEO of Microsoft unveils new product at tech conference.",
        "Princess Diana exhibit opens at the national museum",
        "California governor announces new climate action plan.",
        "CDC releases new guidelines for COVID-19 vaccinated individuals.",
        "New York City declares state of emergency due to rising COVID-19 cases.",
        "The Indian government announces new policies to address air pollution in Delhi.",
        "Renowned physicist Stephen Hawking delivers a lecture on black holes and the origins of the universe at the University of Cambridge.",
        "Amal Clooney delivers powerful speech on human rights at conference in Geneva.",
        "Tropical storm brings heavy rain and strong winds to Florida coast.",
        "LeBron James signs a new contract with the Los Angeles Lakers.",
        "Mike Pence tests negative for COVID-19 after potential exposure.",
        "Tokyo to host 2021 Summer Olympics.",
        "German Chancellor Angela Merkel delivers a speech at the United Nations General Assembly.",
        "President Bolsonaro delivers speech in Brasília.",
        "CEO of General Electric Company resigns amidst controversy.",
        "Fire breaks out in downtown building, 5 injured.",
        "New York City sets record for highest number of daily COVID-19 cases.",
        "The mayor of Los Angeles announces new initiatives for affordable housing.",
        "San Francisco's Bay Area Rapid Transit system faces criticism for delays.",
        "SpaceX's Starship, designed by Elon Musk's company, completes successful test flight.",
        "Tech giant Apple announces new iPhone release.",
        "Benjamin Netanyahu reelected as Israeli Prime Minister.",
        "Real Madrid defeats Barcelona in a dramatic overtime victory.",
        "Donald Rumsfeld, former U.S. Secretary of Defense, passes away at the age of 88.",
        "Apple Inc. unveils new iPhone with enhanced security features.",
        "New York City Mayor announces plan to tackle homelessness crisis",
        "Amal Clooney to lead legal team in human rights case against Abu Dhabi government.",
        "Abu Dhabi Investment Authority announces plans to invest in renewable energy projects.",
        "Election results show landslide victory for incumbent mayor in Budapest.",
        "Elon Musk's SpaceX launches another batch of Starlink satellites into orbit."
    ],
    "sentences": [
        "Billie Eilish collaborates with famous fashion brand for new clothing line.",
        "Zurich-based pharmaceutical company announces breakthrough in cancer research.",
        "President Biden signs executive order to address climate change.",
        "London police arrest suspect in connection with the recent string of robberies.",
        "Global stock markets experience sharp decline following trade tensions between China and the US.",
        "Boeing Company announces plans to cut 10,000 jobs.",
        "CEO Tim Cook announces new product launch for Apple Inc. .",
        "Stock prices soar following record-breaking quarterly earnings report from Apple Inc. .",
        "Protesters gather outside Apple Inc. headquarters to demand better working conditions.",
        "The popular subreddit r/aww reaches 10 million subscribers.",
        "Montreal Canadiens defeat Toronto Maple Leafs in overtime.",
        "The mayor of Montreal announces a new public transit plan.",
        "Protesters clash with police during Black Lives Matter demonstration in downtown Los Angeles.",
        "Black Lives Matter activist delivers powerful speech at civil rights rally in Washington D.C.",
        "New movie starring Robert Downey Jr. breaks box office records.",
        "Robert Downey Jr. launches new environmental organization to combat climate change.",
        "Russian opposition leader Alexei Navalny jailed for 30 days.",
        "Russian opposition leader Alexei Navalny hospitalized after suspected poisoning.",
        "Stock prices soar as rumors circulate about potential partnership between Apple Inc. and Tesla.",
        "California judge rules in favor of Apple Inc. in patent infringement case.",
        "ISIS claims responsibility for bombing at airport in Europe.",
        "The Seattle Seahawks won their game against the Arizona Cardinals.",
        "Turkish President meets with Greek Prime Minister in Ankara.",
        "Xi Jinping meets with Russian President Vladimir Putin to discuss bilateral cooperation.",
        "The Jakarta Symphony Orchestra will be performing at the grand opening of the new cultural center.",
        "The CEO of Bank of America resigns after financial misconduct allegations.",
        "Cairo Symphony Orchestra to perform at Ankara International Music Festival.",
        "Montreal Symphony Orchestra announces new season lineup.",
        "Angela Davis gives a speech at the University of California, Berkeley on social justice.",
        "CEO of Apple Inc. announces new product launch date.",
        "The president of the National Bank of Buenos Aires announces new interest rates.",
        "The Vienna Philharmonic Orchestra to perform in Delhi next month.",
        "Miami Heat trade for All-Star forward to bolster their roster for the upcoming season.",
        "Boston Symphony Orchestra to hold virtual concerts this summer.",
        "Martin Luther King Jr. Memorial Foundation holds annual scholarship event.",
        "Apple announces record-breaking sales for new iPhone model.",
        "Tech giant Apple announces new line of iPhone models.",
        "Tokyo to host 2021 Summer Olympics despite concerns over COVID-19.",
        "Apple unveils new iPhone with 5G capabilities.",
        "Apple Inc. unveils new line of iPhones.",
        "Apple Inc. announces launch of new iPhone model.",
        "Reykjavik University announces groundbreaking research in renewable energy.",
        "Tech giant Apple Inc. announces release date for new iPhone.",
        "Apple Inc. announces new iPhone launch date.",
        "Apple announces the release of its latest iPhone model.",
        "Apple Inc. launches new iPhone model.",
        "Brazilian soccer star scores winning goal in World Cup match.",
        "Sydney Opera House reopens for live performances.",
        "APPLE ANNOUNCES RELEASE DATE FOR IPHONE 13.",
        "HURRICANE IDA DEVASTATES LOUISIANA COASTLINE.",
        "Apple reveals new iPhone with enhanced camera features and 5G capabilities",
        "National Public Radio launches a new podcast series on climate change.",
        "Apple announces new iPhone release date.",
        "Apple releases new iPhone with enhanced camera features.",
        "Apple Inc. unveils new iPhone model at highly anticipated product launch event.",
        "Tech giant Apple unveils new iPhone models.",
        "President Biden to deliver State of the Union address on Tuesday.",
        "Apple unveils new iPhone with faster processor and improved camera capabilities.",
        "National Aeronautics and Space Administration plans to launch a new satellite to monitor climate change.",
        "Local organization to host charity event for homeless population.",
        "Local organization provides aid to refugees in war-torn region.",
        "Local organization raises funds for homeless shelters",
        "Local organization hosts annual charity gala to raise funds for homeless shelter.",
        "Local organization hosts fundraiser to support families affected by recent natural disasters.",
        "Local organization in Quito organizes charity event for orphaned children.",
        "New study shows link between social media use and mental health issues among teenagers.",
        "Global organization holds conference to address climate change concerns.",
        "Apple Inc. unveils new line of iPhones with advanced 5G technology at virtual product launch event.",
        "Mike Pence's visit to Japan strengthens bilateral trade ties.",
        "The World Trade Organization released a report on global trade tensions.",
        "President Jokowi to visit Jakarta for economic summit.",
        "Jay-Z's music label signs new up-and-coming artist.",
        "Mike Pence delivers keynote speech at Republican National Convention.",
        "NATO to increase presence in Eastern Europe to deter Russian aggression.",
        "Los Angeles mayor announces new housing initiative.",
        "American Cancer Society launches new initiative to improve access to cancer screenings in underserved communities.",
        "Former Barcelona player Lionel Messi signs with Paris Saint-Germain.",
        "Microsoft acquires cybersecurity firm for $10 billion.",
        "President Biden to meet with European leaders in Brussels to discuss trade agreements.",
        "Montreal artist wins prestigious international award.",
        "Hurricane Ida causes widespread damage in Louisiana and Mississippi.",
        "Tim Cook announces Apple's new product launch event in Berlin.",
        "Tesla announces plans to open new manufacturing facility in Texas.",
        "Quito sees an influx of tourists after being named a UNESCO World Heritage Site.",
        "Facebook CEO Mark Zuckerberg testifies before Congress on data privacy.",
        "George W. Bush Foundation for Military Service members announces new scholarship program.",
        "The CEO of Ford Motor Company predicts a surge in demand for electric cars in the next decade.",
        "Johnson & Johnson to pay $572 million in landmark opioid trial settlement.",
        "Japan's Tokyo Olympics officially kick off.",
        "Concerns rise as tensions escalate between Iran and the International Energy Agency.",
        "The Federal Aviation Administration issues new safety guidelines for Boeing 737 MAX planes.",
        "The United Nations Security Council votes to impose new sanctions on North Korea.",
        "Warren Buffett's Berkshire Hathaway invests $500 million in Brazilian digital bank.",
        "The government announced a new transportation infrastructure plan for Jakarta.",
        "International Red Cross deploys relief teams to flood-affected areas in Southeast Asia.",
        "Austrian Chancellor Kurz meets with World Trade Organization delegates in Vienna to discuss trade policies.",
        "Elon Omar speaks at the United Nations Climate Summit in New York City.",
        "European Union imposes sanctions on Belarusian officials, prompting strong response from Sergey Lavrov.",
        "The CEO of a major tech company in Ankara announced a new product launch.",
        "New York City Mayor meets with Pope Francis at Vatican.",
        "Indian government bans TikTok and 58 other Chinese apps.",
        "Angela Merkel meets with French President Macron to discuss trade relations.",
        "Martin Scorsese to collaborate with Beijing Film Academy on new film project.",
        "President Biden meets with leaders from various environmental organizations.",
        "Auckland reports record-high temperatures as heatwave continues to sweep through New Zealand.",
        "New South Wales government announces major infrastructure plan for Sydney.",
        "Elon Musk announces plans to build new Tesla manufacturing plant in Texas.",
        "Kourtney Kardashian spotted with new boyfriend in Paris.",
        "President Jokowi announces new economic policies to boost growth in Jakarta.",
        "Kim Jong Un meets with South Korean president for historic peace talks.",
        "President Obama visits Robben Island, where Nelson Mandela spent 18 years as a political prisoner.",
        "Greek authorities have arrested three suspects in the Athens bombing.",
        "Scott Morrison meets with leaders from G7 countries to discuss climate change.",
        "Montreal Canadiens defeat Toronto Maple Leafs in overtime thriller.",
        "Belgium plans to invest $1 billion in renewable energy projects in Brussels.",
        "New Zealand Prime Minister visits Auckland to discuss climate change.",
        "NATO to hold emergency meeting in response to escalation of conflict in Eastern Europe.",
        "UNICEF launches vaccination campaign in war-torn Syrian city.",
        "Tokyo Olympics officially begin with opening ceremony.",
        "Donald Trump speech at World Economic Forum calls for global cooperation.",
        "Emmanuel Macron delivers a speech at the United Nations General Assembly in New York City.",
        "Australian Prime Minister Scott Morrison visits Brussels to discuss trade agreements with the European Union.",
        "Dallas Mavericks advance to NBA playoffs.",
        "Police arrest suspect in London stabbing.",
        "Hurricane Florence makes landfall in North Carolina.",
        "Hip-hop mogul Jay-Z launches new streaming service.",
        "Former United Parcel Service CEO appointed as new chairman of board.",
        "Caracas-based oil company reports significant increase in profits.",
        "Violent protests erupt in Johannesburg following controversial police shooting.",
        "The Jakarta Post reports record-breaking heatwave in Jakarta.",
        "German Chancellor Angela Merkel visits Rohingya refugee camps in Bangladesh.",
        "Canberra to host international climate summit next year.",
        "Boeing Company to lay off 6,770 US employees.",
        "Greenpeace activists protest in Caracas over environmental issues.",
        "Volodymyr Zelensky, the President of Ukraine, delivers a speech at the United Nations General Assembly.",
        "Toronto mayor announces new public transportation initiative.",
        "Senate confirms Amy Coney Barrett to succeed Ruth Bader Ginsburg on the Supreme Court.",
        "The latest outbreak of Ebola in Africa has prompted Doctors Without Borders to deploy medical teams to the affected areas.",
        "New study shows increase in pollution levels in major cities.",
        "Discussions between European Union leaders and the United Kingdom on Brexit negotiations result in a new agreement.",
        "Miami Heat signs top free agent from Oslo.",
        "Aung San Suu Kyi calls for international aid to address Rohingya refugee crisis.",
        "Queen Elizabeth II celebrates her 70th year as monarch.",
        "U.S. urges NATO members to increase defense spending.",
        "Apple launches new iPhone with advanced facial recognition technology.",
        "Shakira's charity organization donates $1 million to the earthquake relief efforts in Haiti.",
        "Canadian Prime Minister Justin Trudeau meets with Colombian singer Shakira to discuss education funding.",
        "Researcher at National Institutes of Health discovers potential treatment for rare genetic disorder.",
        "Pro-democracy protests continue in Hong Kong as tensions rise with Chinese government.",
        "Local tech company to open new headquarters in San Francisco.",
        "Tel Aviv celebrates Pride Month with a colorful parade.",
        "Major oil organizations report decreased profits amid global market uncertainty.",
        "Doctors Without Borders provide medical aid to remote villages in Africa.",
        "Apple's new iPhone 13 to be released next month.",
        "European Central Bank President calls for fiscal stimulus to counter economic slowdown.",
        "Elon Musk announces plans to build a new SpaceX facility in Nairobi.",
        "The CEO of Apple Inc. announced a new product launch event next month.",
        "Supreme Court Justice John Roberts delivers the majority opinion in landmark case.",
        "Dr. Anthony Fauci advises caution as COVID-19 cases rise in several states.",
        "Joe Biden meets with European leaders to discuss international trade agreements.",
        "Dr. Amanda Smith appointed as new head of medical research at the University of California.",
        "New York City Marathon canceled due to extreme weather conditions.",
        "FC Barcelona signs sponsorship deal with a global technology company.",
        "Sydney native wins gold medal in swimming competition.",
        "The World Meteorological Organization forecasts extreme weather conditions in the Pacific region.",
        "New startup company in Edinburgh secures funding for expansion.",
        "Famous actress reveals her pregnancy news on Instagram.",
        "Celebrity chef opens new restaurant in Beirut.",
        "LeBron James signs four-year contract with the Los Angeles Lakers.",
        "Local organization donates to charity for wildlife conservation efforts.",
        "Bogotá Mayor announces new public transportation project.",
        "New York City Mayor announces plan to invest in renewable energy sources.",
        "Protesters gather outside the United States Department of Defense headquarters in Arlington, Virginia.",
        "Elon Musk's SpaceX successfully launches Falcon 9 rocket.",
        "Australian Prime Minister Scott Morrison addresses nation regarding economic recovery plan.",
        "The mayor of Rio de Janeiro announces new infrastructure plan for the city.",
        "Tsunami warning issued for Pacific coast.",
        "Sergey Brin, co-founder of Google, announces new venture into space exploration.",
        "Amazon CEO, Jeff Bezos, steps down from his position, handing over the reins to Andy Jassy.",
        "Selena Gomez releases new single 'Baila Conmigo' featuring Rauw Alejandro.",
        "Texan voters reelect Ted Cruz to U.S. Senate.",
        "Prime Minister of Australia travels to Canberra for emergency meeting.",
        "UNESCO announces new World Heritage Sites for 2022.",
        "India announces ambitious plan to tackle air pollution in Delhi.",
        "Apple unveils new line of iPhone models at annual product launch event.",
        "London-based company receives funding for renewable energy project.",
        "Pope Francis condemns violence in the Middle East during his visit to Iraq.",
        "Bogotá-based company awarded government contract for infrastructure project.",
        "The University of Washington football team defeated Stanford in a close game.",
        "The National Basketball Association cancels games due to COVID-19 outbreak.",
        "Elon Musk's SpaceX successfully launches 60 more Starlink satellites.",
        "Volodymyr Zelensky delivers speech at United Nations headquarters in New York.",
        "The United Nations has announced a new aid package for refugees in Cape Town .",
        "Bradley Cooper to star in upcoming movie set in Bangkok.",
        "Vienna Mayor announces new public transportation initiatives.",
        "Tel Aviv mayor announces new public transportation initiatives to reduce traffic congestion.",
        "Warsaw stock exchange sees significant increase in trading volume.",
        "An American Cancer Society fundraiser in Chicago raised over $100,000 for cancer research.",
        "Time Magazine names Prague as the top travel destination for 2022.",
        "Bogotá's mayor announces new public transportation initiative.",
        "Major electronics company headquartered in Seoul sees 15% increase in profits.",
        "Lebron James scores 45 points in Lakers' victory over Warriors.",
        "Prince Harry spotted at charity event in London.",
        "Tim Cook, CEO of Apple, visits Berlin to discuss potential collaborations with local tech startups.",
        "The United Nations Secretary-General meets with Queen Elizabeth II to discuss global peace initiatives.",
        "CEO of The Walt Disney Company steps down amidst controversy.",
        "John Roberts sworn in as Supreme Court Chief Justice.",
        "Queen Elizabeth II celebrates her diamond jubilee with a grand parade through London.",
        "Mitt Romney announces his candidacy for Utah Senate seat.",
        "First Lady Melania Trump visits International Organization for Migration facility in Guatemala.",
        "European Union imposes sanctions on Russian officials.",
        "LeBron James signs multi-million dollar endorsement deal with Nike.",
        "Australian Prime Minister to visit Sydney for climate change summit.",
        "Global leaders gather in New York for United Nations General Assembly",
        "Investigation reveals that the Helsinki-based company was involved in illegal arms trade.",
        "The OPEC members met in Wellington to discuss oil production cuts.",
        "New York City Marathon route to include iconic landmarks.",
        "Marjorie Taylor Greene's controversial comments spark debate in Congress.",
        "Elon Musk's SpaceX successfully launches 60 more Starlink satellites into orbit.",
        "Kourtney Kardashian launches her new lifestyle brand Poosh.",
        "President Biden meets with German Chancellor Angela Merkel in Washington.",
        "APPLE ANNOUNCES LAUNCH OF NEW IPHONE MODEL.",
        "Edinburgh University research team makes breakthrough in cancer treatment.",
        "Apple Inc. unveils its latest iPhone model with enhanced camera features",
        "ISIS claims responsibility for bombing in Baghdad.",
        "Berlin Philharmonic Orchestra cancels upcoming concerts due to strike.",
        "Greenpeace activists protest outside the Hanoi government building.",
        "New Harry Potter theme park opens in Orlando, Florida featuring attractions based on J.K. Rowling's books.",
        "Turkey's President visits Istanbul to discuss economic policies.",
        "Supreme Court Justice Ruth Bader Ginsburg hospitalized for treatment of possible infection.",
        "New study reveals alarming increase in pollution levels in major cities.",
        "India's Prime Minister to meet with President of Nepal for bilateral talks.",
        "Samsung recalls faulty washing machines in North America.",
        "Brad Pitt signs deal with major film production company.",
        "The Nobel Prize in Literature awarded to an American author for his outstanding work.",
        "CEO of Tesla, Elon Musk, announces plans to open a new Gigafactory in Yangon .",
        "United Nations calls for immediate ceasefire in war-torn region.",
        "Toronto Raptors defeat LA Lakers in NBA Finals Game 3.",
        "Ankara-based organization launches new initiative to combat poverty in the region.",
        "President Jokowi announces new infrastructure plan for Jakarta.",
        "Seoul Mayor announces new initiative to reduce air pollution in the city.",
        "Nelson Mandela Foundation celebrates the life and legacy of Nelson Mandela on his 100th birthday.",
        "Local organization in Beirut launches community recycling program to combat pollution.",
        "United States Department of State issues travel advisory for several countries in the Middle East.",
        "Mount Everest reopens to climbers after two-year closure due to COVID-19.",
        "Saudi Arabia welcomes investment from Sony in Riyadh.",
        "Rosalía wins Best New Artist at the Latin Grammy Awards.",
        "The Budapest Stock Exchange experienced a sharp decline in trading volume.",
        "Malala Yousafzai wins Nobel Peace Prize for her activism in education.",
        "Greenpeace protests outside London headquarters of oil company.",
        "Environmental organization led by Brad Pitt launches new conservation initiative.",
        "CELEBRITY CHEF GORDON RAMSAY OPENS NEW RESTAURANT IN LAS VEGAS.",
        "Hillary Clinton delivers keynote address at annual technology conference.",
        "Protests erupt in Caracas as opposition leader is arrested.",
        "Elon Musk's SpaceX successfully launches another batch of Starlink satellites into orbit.",
        "The United Nations and the International Organization for Standardization collaborate on a project to promote sustainable development in Africa.",
        "Montreal to host international film festival next month.",
        "J.K. Rowling's new novel tops bestseller lists in the UK and US.",
        "Dwayne \"The Rock\" Johnson announces new production company.",
        "Angela Merkel visits United States to discuss trade agreements.",
        "National Aeronautics and Space Administration announces new mission to Mars.",
        "Apple CEO Tim Cook to deliver keynote speech at technology conference in Brussels.",
        "Buckingham Palace announces Queen Elizabeth II's upcoming state visit to Canada.",
        "French President Macron meets with leaders of the European Union to discuss economic recovery efforts.",
        "New York City Mayor announces plan to improve public transportation.",
        "Prime Minister Boris Johnson visits Pfizer Inc. headquarters in New York.",
        "Protests erupt in Delhi after visit of Narendra Modi.",
        "Apple Inc. announces the release of the new iPhone 13.",
        "The CEO of Microsoft unveils new product at tech conference.",
        "Princess Diana exhibit opens at the national museum",
        "California governor announces new climate action plan.",
        "CDC releases new guidelines for COVID-19 vaccinated individuals.",
        "New York City declares state of emergency due to rising COVID-19 cases.",
        "The Indian government announces new policies to address air pollution in Delhi.",
        "Renowned physicist Stephen Hawking delivers a lecture on black holes and the origins of the universe at the University of Cambridge.",
        "Amal Clooney delivers powerful speech on human rights at conference in Geneva.",
        "Tropical storm brings heavy rain and strong winds to Florida coast.",
        "LeBron James signs a new contract with the Los Angeles Lakers.",
        "Mike Pence tests negative for COVID-19 after potential exposure.",
        "Tokyo to host 2021 Summer Olympics.",
        "German Chancellor Angela Merkel delivers a speech at the United Nations General Assembly.",
        "President Bolsonaro delivers speech in Brasília.",
        "CEO of General Electric Company resigns amidst controversy.",
        "Fire breaks out in downtown building, 5 injured.",
        "New York City sets record for highest number of daily COVID-19 cases.",
        "The mayor of Los Angeles announces new initiatives for affordable housing.",
        "San Francisco's Bay Area Rapid Transit system faces criticism for delays.",
        "SpaceX's Starship, designed by Elon Musk's company, completes successful test flight.",
        "Tech giant Apple announces new iPhone release.",
        "Benjamin Netanyahu reelected as Israeli Prime Minister.",
        "Real Madrid defeats Barcelona in a dramatic overtime victory.",
        "Donald Rumsfeld, former U.S. Secretary of Defense, passes away at the age of 88.",
        "Apple Inc. unveils new iPhone with enhanced security features.",
        "New York City Mayor announces plan to tackle homelessness crisis",
        "Amal Clooney to lead legal team in human rights case against Abu Dhabi government.",
        "Abu Dhabi Investment Authority announces plans to invest in renewable energy projects.",
        "Election results show landslide victory for incumbent mayor in Budapest.",
        "Elon Musk's SpaceX launches another batch of Starlink satellites into orbit."
    ]
}