{
    "not-allowed-entity-type": [
        "Apple unveils new iPhone model with enhanced camera features.",
        "APPLE ANNOUNCES LAUNCH OF NEW iPHONE.",
        "Apple Inc. announces launch of new iPhone model.",
        "Megan Rapinoe named as keynote speaker for Women's Equality Day event.",
        "Tech giant Apple launches new iPhone model.",
        "Apple Inc. launches new iPad Pro with 5G technology.",
        "Apple unveils new iPhone with advanced facial recognition technology.",
        "Tesla reports record-breaking sales in the second quarter.",
        "APPLE ANNOUNCES LAUNCH OF NEW IPHONE MODEL.",
        "Apple unveils new iPhone model with enhanced camera features.",
        "APPLE ANNOUNCES RELEASE OF NEW IPHONE 12 PRO.",
        "Apple unveils new iPhone with advanced camera technology.",
        "APPLE ANNOUNCES LAUNCH OF NEW iPHONE.",
        "Apple Inc. unveils new iPhone with enhanced camera and battery life.",
        "Apple unveils new iPhone 13 with improved camera and battery life.",
        "Apple announces release date for new iPhone 13.",
        "Tech giant Apple announces new iPhone release.",
        "Apple Inc. to release new iPhone model next month.",
        "Tokyo Olympic Games postponed due to COVID-19 pandemic.",
        "Apple announces groundbreaking new chip for next generation of iPhones",
        "Apple announces the release of the new iPhone model.",
        "Apple unveils new iPhone with enhanced camera and 5G capability.",
        "World Health Organization urges countries to increase vaccine distribution to combat the Delta variant.",
        "Apple Inc. announces the release of the new iPhone 13.",
        "Apple announces launch of new iPhone model.",
        "Apple releases new iPhone with advanced camera technology.",
        "Apple announces new iPhone release.",
        "Apple Inc. announces new iPhone launch event.",
        "Apple to unveil new iPhone model at upcoming product event.",
        "Apple unveils new iPhone model with enhanced camera features.",
        "Apple announces new iPhone with advanced camera technology.",
        "Apple Inc. unveils new iPhone with revolutionary features.",
        "Apple surpasses expectations with record-breaking iPhone sales.",
        "Apple unveils new iPhone with enhanced camera technology.",
        "Tech giant Apple unveils new iPhone with advanced features.",
        "Apple announces new iPhone with advanced camera technology.",
        "APPLE ANNOUNCES NEW IPHONE RELEASE DATE.",
        "TOM HANKS TO STAR IN UPCOMING SCI-FI FILM.",
        "TORNADO HITS OKLAHOMA CITY, CAUSED MAJOR DAMAGE.",
        "Apple unveils new iPhone with advanced camera features.",
        "Apple Inc. unveils new iPhone with advanced features and technology.",
        "Apple unveils new iPhone with improved camera and battery life.",
        "Apple announces new iPhone with 5G capabilities.",
        "Apple announces new iPhone release date.",
        "Apple Inc. announces record-breaking sales for the latest iPhone model.",
        "Apple announces new iPhone with advanced camera features.",
        "Apple to release new iPhone with 5G capabilities.",
        "Tech giant Apple unveils new iPhone model.",
        "London to host 2022 World Chess Championship.",
        "Queen Elizabeth II celebrates her Platinum Jubilee with special events.",
        "Apple Inc. announces the release of its latest iPhone model.",
        "APPLE ANNOUNCES NEW iPHONE RELEASE DATE.",
        "Apple unveils new iPhone with advanced facial recognition technology.",
        "APPLE ANNOUNCES NEW IPHONE LAUNCH EVENT.",
        "Tesla achieves record profits in Q3, surpassing Wall Street expectations.",
        "Apple announces launch date for new iPhone.",
        "Apple unveils latest iPhone model at annual product launch event.",
        "Apple Inc. unveils new iPhone with enhanced features.",
        "Apple Inc. unveils new iPhone with advanced camera technology.",
        "Apple's new iPhone 13 to be released in September.",
        "Apple Inc. unveils new iPhone with advanced camera technology.",
        "Apple Inc. introduces new iPhone with advanced camera features",
        "Apple launches new iPhone with advanced features.",
        "FDA approves new drug for treating diabetes",
        "APPLE ANNOUNCES LAUNCH OF NEW iPHONE.",
        "APPLE ANNOUNCES LAUNCH OF NEW iPHONE MODEL.",
        "Apple unveils new iPhone with advanced AI capabilities.",
        "Apple Inc. announces new iPhone release date.",
        "Apple unveils new iPhone with advanced camera technology."
    ],
    "entity-not-found": [
        "German Chancellor Angela Merkel announces plans for retirement.",
        "German Chancellor Angela Merkel calls for more global cooperation on climate change.",
        "Canadian Prime Minister Justin Trudeau to meet with German Chancellor Angela Merkel next week."
    ],
    "low-logprob": [
        "Apple unveils new iPhone with innovative features.",
        "The United Nations report warns of a looming humanitarian crisis in Yemen as the conflict continues.",
        "Apple Inc. reports record-breaking sales for latest iPhone release.",
        "The Prime Minister of Japan visits Washington D.C. for trade talks.",
        "Hurricane Irma devastates Florida coast.",
        "Apple surpasses one trillion dollars in market value.",
        "Elon Musk's SpaceX plans to launch 60 Starlink satellites into orbit.",
        "Elon Musk's SpaceX successfully launches a new communications satellite into orbit.",
        "Apple Inc. introduces new iPhone with advanced technology.",
        "Tesla announces new electric vehicle model.",
        "The United Nations reports a spike in violence in the Democratic Republic of the Congo, leading to a humanitarian crisis.",
        "NASA successfully lands rover on Mars.",
        "Tech giant Apple reveals new line of iPhones at annual keynote event.",
        "The European Union imposes sanctions on Russian officials.",
        "The United Nations calls for global action to address climate change.",
        "Tech giant Apple unveils new product line.",
        "President Biden announces new climate change initiatives.",
        "Elon Musk's SpaceX to launch new satellite into orbit.",
        "Apple CEO Tim Cook announces new iPhone release date.",
        "Elon Musk's SpaceX to launch a satellite into orbit.",
        "Scientists discover new species of marine life in the Great Barrier Reef",
        "TOKYO OLYMPICS TO ALLOW LIMITED SPECTATORS AMID COVID-19 CONCERNS.",
        "Apple announces release date for new iPhone 13.",
        "The CEO of Google announced a new technology advancement at the annual conference.",
        "Elon Musk's SpaceX aims to launch its Starship rocket for Mars mission.",
        "The United Nations issues a statement on climate change.",
        "Mayor Johnson introduces new initiative to combat homelessness in the city.",
        "President Biden signs new climate change legislation into law.",
        "Hurricane Katrina devastates New Orleans, leaving thousands homeless.",
        "Elon Musk's SpaceX successfully launches a new batch of Starlink satellites.",
        "Tesla reports record quarterly revenue amid global chip shortage.",
        "The renowned scientist, Dr. Jane Smith, received the Nobel Prize for her groundbreaking research.",
        "NASA's Mars Rover successfully completed its mission to collect samples from the Martian surface.",
        "Tech giant Apple announces the release of the new iPhone 13.",
        "Apple Inc. launches new iPhone 13 models.",
        "New York City Mayor announces new affordable housing initiative.",
        "WHO declares Ebola outbreak in Democratic Republic of the Congo a public health emergency.",
        "Japan's Prime Minister visits South Korea for diplomatic talks.",
        "The World Health Organization urges countries to take stronger measures against the spread of COVID-19 variants.",
        "NASA's Mars rover finds evidence of ancient life.",
        "The CEO of Apple Inc. unveils the latest iPhone model at the tech conference.",
        "The CEO of Apple Inc. announces a new product launch.",
        "Tesla CEO Elon Musk unveils new electric trucks at company event.",
        "Tesla CEO Elon Musk plans to build a new factory in Texas.",
        "Rising tennis star Naomi Osaka wins her third Wimbledon match in a row.",
        "Apple CEO Tim Cook unveils new iPhone models at annual tech conference.",
        "Hurricane Ida hit Louisiana with devastating force.",
        "Tokyo, Japan experiences record-breaking heatwave.",
        "Prime Minister Trudeau visits United Nations headquarters.",
        "United States imposes sanctions on Chinese tech company Huawei.",
        "New York City Mayor announces plans for affordable housing initiative in Manhattan.",
        "The United Nations issues a statement condemning the recent cyber attacks.",
        "New York City announces plan to increase affordable housing options in Manhattan.",
        "Prime Minister Trudeau visits flood-affected areas in British Columbia.",
        "London Mayor announces plan to reduce air pollution in the city center.",
        "Apple announces the release of the new iPhone 13.",
        "Prime Minister Boris Johnson visits Kuwait to discuss trade agreements.",
        "London's Heathrow Airport to undergo major expansion.",
        "President Biden to visit United Kingdom next week.",
        "Hurricane Maria devastates Puerto Rico, leaving thousands without power.",
        "Mayor Johnson to address new school funding plan.",
        "President Biden meets with South Korean leader to discuss trade agreements.",
        "President Biden delivers speech on economy and infrastructure in New York City.",
        "Elon Musk's SpaceX launches 60 more Starlink satellites to orbit.",
        "Los Angeles Lakers sign new head coach.",
        "Prime Minister Johnson meets with German Chancellor Merkel to discuss Brexit negotiations.",
        "New York City Mayor announces plan to address homelessness crisis.",
        "Apple announces new privacy features for upcoming iPhone models.",
        "Hurricane Elsa causes widespread damage in Caribbean.",
        "The World Health Organization announces global vaccination initiative for COVID-19.",
        "Tokyo Olympics organizers face criticism over handling of COVID-19 protocols.",
        "Tesla CEO Elon Musk unveils new electric car model at annual conference.",
        "Apple reports record-breaking iPhone sales for the holiday season.",
        "The president of France, Emmanuel Macron, visits the United States for trade discussions.",
        "Apple unveils latest iPhone model with improved camera technology.",
        "Apple to unveil new iPhone 13 at virtual event next month.",
        "Japan's Prime Minister Shinzo Abe to meet with President Trump to discuss trade agreements.",
        "Apple unveils new iPhone 13 with improved camera and battery life.",
        "Tech giant Apple announces launch of new iPhone.",
        "Apple announces launch of new iPhone model.",
        "President Smith announces new trade deal with European Union.",
        "TOKYO OLYMPICS POSTPONED DUE TO COVID-19",
        "London Mayor unveils new public transport plan.",
        "PRESIDENT BIDEN SIGNS EXECUTIVE ORDER ON CLIMATE CHANGE.",
        "APPLE ANNOUNCES RELEASE OF NEW IPHONE.",
        "Russia warns US to stay away from Crimea",
        "Olympic Games in Tokyo to be held without spectators due to COVID-19 concerns.",
        "Elon Musk's SpaceX launches the Falcon 9 rocket.",
        "Tech giant Apple unveils new iPhone with 5G capability.",
        "Elon Musk's SpaceX successfully launches new batch of Starlink satellites.",
        "Japan to host 2021 Summer Olympics, despite concerns over COVID-19.",
        "APPLE ANNOUNCES RELEASE OF NEW iPHONE MODEL.",
        "Hurricane Florence makes landfall in North Carolina.",
        "World Health Organization updates guidance on COVID-19 vaccine distribution.",
        "New York City announces plans to fully reopen Broadway theaters in September.",
        "Elon Musk's SpaceX successfully launches a new series of Starlink satellites into orbit.",
        "Famous chef opens flagship restaurant in Miami.",
        "The CEO of Apple announces the launch of a new iPhone.",
        "Mayor Garcia of Long Beach declares state of emergency due to severe heat wave.",
        "Angela Merkel to step down as German Chancellor in 2021",
        "CEO of Tesla Elon Musk becomes world's richest person",
        "Hurricane Dorian devastates Bahamas, leaving widespread destruction in its wake.",
        "The president of the United States signed a new trade deal with Mexico and Canada.",
        "New York City imposes indoor mask mandate amid rising COVID cases",
        "Apple announces record-breaking sales for the latest iPhone model.",
        "Elon Musk's SpaceX plans to launch commercial spaceflights to the moon",
        "New York City Mayor announces plan to increase funding for affordable housing initiatives.",
        "Elon Musk's SpaceX successfully launches another Starlink mission.",
        "Apple to release new iPhone model next month.",
        "New study reveals link between coffee consumption and reduced risk of heart disease.",
        "COVID-19 cases surge in New York City.",
        "APPLE ANNOUNCES LAUNCH OF NEW IPHONE.",
        "NASA launched a new satellite to explore deep space.",
        "APPLE ANNOUNCES LAUNCH DATE FOR NEW iPHONE.",
        "Biden administration plans to increase funding for renewable energy projects.",
        "New York City Mayor declares state of emergency in response to severe weather conditions.",
        "Apple Inc. announces the release date for the new iPhone 13.",
        "Hurricane Irma causes widespread devastation across the Caribbean islands.",
        "Japan to host 2020 Summer Olympics.",
        "TORNADO HITS MIDWESTERN TOWN, LEAVING DEVASTATION IN ITS WAKE.",
        "New York City Mayor announces plan to increase affordable housing developments.",
        "Russian president Vladimir Putin meets with Chinese leader Xi Jinping to discuss trade agreements.",
        "Mayor Johnson announces new infrastructure plan for the city.",
        "Prime Minister Johnson to visit Germany and France for Brexit talks.",
        "President Biden meets with Prime Minister Johnson in London.",
        "New York City Mayor announces plans to invest $10 million in new public transportation initiatives.",
        "Japan's Prime Minister visits United States for trade talks.",
        "Tropical storm hits the coast, causing widespread power outages.",
        "NASA's Perseverance rover makes historic landing on Mars.",
        "Tokyo, Japan prepares for the upcoming Summer Olympics amid rising concerns about COVID-19.",
        "The CEO of Amazon plans to step down next year.",
        "Apple announces new iPhone 12 release date.",
        "The United Nations Secretary-General is expected to address the General Assembly next week.",
        "Apple unveils new updates to iPhone and iPad.",
        "The United Nations has issued a statement condemning the recent escalation of violence in the region.",
        "Apple unveils new iPhone model with improved camera and battery life.",
        "Tesla's stock price hit an all-time high on Monday.",
        "Scientists have discovered a new species of butterfly in the Amazon rainforest.",
        "Apple Inc. announces the launch of its new iPhone 13 series.",
        "Hurricane Katrina devastates New Orleans in 2005.",
        "Tensions rise as China announces new military exercises in the South China Sea.",
        "Elon Musk unveils plans for new Mars mission.",
        "Apple announces new iPhone with advanced camera technology.",
        "The CEO of Apple, Tim Cook, announces the release of a new line of iPhones.",
        "Tropical storm warning issued for coastal areas.",
        "Elon Musk's SpaceX launches its latest batch of Starlink satellites into orbit.",
        "Hurricane Maria causes widespread devastation in Puerto Rico.",
        "The CEO of Apple Inc. announced a new product launch event next month.",
        "New York City Mayor announces new plan to address homelessness crisis.",
        "European Union imposes sanctions on Russian officials for human rights violations.",
        "Elon Musk's SpaceX successfully launches 60 more Starlink internet satellites.",
        "Elon Musk announces plans to colonize Mars by 2050.",
        "President Biden announces new infrastructure plan to address aging roads and bridges.",
        "Tokyo Olympics to proceed without spectators due to COVID-19 concerns.",
        "APPLE ANNOUNCES LAUNCH OF NEW IPHONE MODEL.",
        "New York City announces plan to fully reopen Broadway theaters at 100% capacity.",
        "Tesla's shares soar after strong Q3 earnings report.",
        "Environmental organization launches campaign to protect endangered species.",
        "Tesla unveils new electric car model.",
        "Apple unveils new iPhone with enhanced camera and longer battery life.",
        "Professor Smith awarded Nobel Prize for groundbreaking research in physics.",
        "CEO Elon Musk announces SpaceX mission to Mars.",
        "APPLE ANNOUNCES NEW iPHONE RELEASE DATE.",
        "The new COVID-19 variant, originally identified in South Africa, is spreading rapidly in Europe.",
        "Apple announces the launch of its new iPhone 13 series.",
        "Climate change activists protest outside government headquarters in London.",
        "The United Nations releases a new report on climate change.",
        "Elon Musk's SpaceX plans to launch more Starlink satellites into orbit.",
        "United Nations reports sharp rise in global temperatures.",
        "Tropical storm causes flooding in coastal regions.",
        "Apple announces new iPhone launch event.",
        "Apple announces new iPhone release date and features.",
        "Japan's Prime Minister Yoshihide Suga visited the United States to discuss trade agreements.",
        "Wildfires continue to spread in the Australian state of New South Wales.",
        "President Biden meets with leaders of G7 nations to discuss climate change initiatives.",
        "Apple Inc. unveils latest iPhone model with enhanced camera features.",
        "Elon Musk's SpaceX successfully launches Falcon 9 rocket.",
        "Japan to host 2022 World Cup.",
        "Japan's Prime Minister meets with South Korea's President ahead of the upcoming trade talks.",
        "Apple unveils new iPhone with longer battery life and improved camera features.",
        "Elon Musk's SpaceX successfully lands Starship prototype.",
        "Apple unveils new iPhone with advanced camera features.",
        "United Nations adopts resolution on climate change.",
        "Elon Musk's SpaceX launches another set of Starlink satellites into orbit.",
        "New York City Mayor announces plan for affordable housing initiative.",
        "Emma Stone wins Best Actress at the Oscars.",
        "Elon Musk's SpaceX successfully launches a new batch of Starlink satellites into orbit.",
        "Earthquake hits southern California, causing minor damage.",
        "Tokyo Olympics to proceed without overseas spectators due to COVID-19 concerns.",
        "Biden administration imposes new sanctions on Russian officials.",
        "New York City Mayor announces plan to revitalize public transportation system.",
        "Elon Musk's SpaceX successfully launches 60 new Starlink satellites into orbit.",
        "German Chancellor Angela Merkel announces plans for retirement after next election.",
        "New York City mayor announces plan to improve public transportation.",
        "Los Angeles Lakers acquire top draft pick for upcoming season.",
        "In a historic move, Paris Agreement enters into force with overwhelming global support.",
        "Tesla announces record-breaking sales for the second quarter.",
        "Apple launches new iPhone with advanced camera features.",
        "Elon Musk's SpaceX successfully launches 60 more Starlink satellites.",
        "Apple unveils new iPhone with advanced camera technology.",
        "Heavy rains cause floods in southern India, leaving thousands displaced.",
        "APPLE UNVEILS NEW IPHONE WITH 5G CAPABILITIES.",
        "Apple announces record-breaking iPhone sales for the third quarter.",
        "Scientists announce major breakthrough in cancer research.",
        "Prime Minister Johnson delivers speech at UN General Assembly.",
        "Elon Musk's SpaceX launches 60 more Starlink satellites",
        "Scientists discover a new species of fish in the Pacific Ocean.",
        "Apple Inc. announces new iPhone with advanced camera technology.",
        "Hurricane Maria devastates Puerto Rico.",
        "TECH GIANT APPLE TO LAUNCH NEW IPHONE MODEL NEXT MONTH.",
        "Mayor Johnson unveils new infrastructure plan for city.",
        "Taylor Swift to perform at the Grammy Awards.",
        "Tesla to release new line of electric vehicles in 2023.",
        "Prime Minister Trudeau visits flood-ravaged town to assess damage and meet with residents.",
        "FORD ANNOUNCES PLAN TO LAUNCH NEW ELECTRIC VEHICLE MODELS.",
        "Elon Musk's SpaceX rocket successfully lands on the moon.",
        "Earthquake hits southern California, causing power outages and minor damage.",
        "London Mayor announces new housing initiative.",
        "WHO declares global health emergency due to surge in COVID-19 cases.",
        "Tech giant Apple announces new iPhone release.",
        "APPLE UNVEILS NEW iPHONE WITH 5G CAPABILITIES.",
        "Elon Musk's SpaceX launches new batch of Starlink satellites into orbit.",
        "Elon Musk's SpaceX to launch satellite for Canadian company.",
        "Parisians protest new labor laws outside government buildings.",
        "Microsoft announces acquisition of AI startup for $1 billion.",
        "Tech giant Apple to release new iPhone model next month.",
        "The United Nations has authorized a new resolution to impose sanctions on the country.",
        "Apple announces new iPhone launch event, expected to unveil the latest technology and features.",
        "Apple announces new iPhone with 5G capability.",
        "Elon Musk's SpaceX successfully launches latest batch of Starlink satellites",
        "Elon Musk's SpaceX successfully launches new batch of Starlink satellites into orbit.",
        "Elon Musk's SpaceX plans to launch another set of Starlink satellites.",
        "APPLE ANNOUNCES NEW IPHONE RELEASE DATE.",
        "New York City Mayor de Blasio announces new affordable housing initiative.",
        "New York City Mayor announces plans to invest in affordable housing initiatives.",
        "The CEO of Apple Inc. announced a new product launch event scheduled for next month.",
        "Japan announces plans to host the 2030 FIFA World Cup.",
        "Elon Musk's SpaceX successfully launches 60 more Starlink satellites",
        "President Biden delivers speech at UN General Assembly.",
        "Flooding in New Orleans forces thousands to evacuate as Hurricane Ida makes landfall.",
        "Dr. Anthony Fauci warns of potential spike in COVID-19 cases",
        "WHO warns of potential surge in COVID-19 cases as travel restrictions ease.",
        "Apple unveils new iPhone with improved camera and battery life.",
        "Apple announces release of new iPhone model.",
        "Mayor Garcia declares state of emergency for flooding in downtown area.",
        "Apple unveils new iPhone with advanced 5G technology.",
        "New York City Mayor announces plan to increase affordable housing options.",
        "Wildfires continue to ravage northern California, forcing evacuations in several communities.",
        "Apple Inc. reports record-breaking sales for the latest iPhone model.",
        "Earthquake hits southern California, causing damage to several buildings.",
        "Olympics Tokyo 2020: Simone Biles withdraws from all-around competition citing mental health concerns.",
        "Heavy rainfall leads to flooding in coastal town.",
        "President Biden delivers State of the Union address to Congress and American people.",
        "Apple's new iPhone 13 release date announced",
        "British Prime Minister Boris Johnson faces criticism over handling of COVID-19 pandemic.",
        "Apple Inc. announces launch of new iPhone with advanced features.",
        "Hurricane Maria hits Puerto Rico.",
        "The CEO of Apple plans to launch a new technology innovation next month.",
        "Elon Musk's SpaceX launches 60 more Starlink satellites in record-breaking mission.",
        "Apple announces new iPhone with advanced camera technology",
        "The CEO of Apple Inc. announces new product launch at upcoming tech conference.",
        "Paris prepares for the annual Bastille Day celebrations.",
        "The CEO of Apple Inc. announces a new product launch at the annual tech conference.",
        "Firefighters battling wildfires in Northern California.",
        "Hollywood actress Jennifer Lawrence to star in upcoming thriller.",
        "Tesla reports record-breaking sales for the third quarter.",
        "Japan to host 2021 Summer Olympics despite concerns over COVID-19 pandemic.",
        "Tokyo Olympics organizers unveil COVID-19 guidelines for athletes and officials.",
        "Hurricane Dorian devastates Bahamas",
        "APPLE ANNOUNCES NEW IPHONE RELEASE DATE",
        "Elon Musk's SpaceX successfully launches latest batch of Starlink satellites into orbit.",
        "Prime Minister Boris Johnson visits London Bridge to pay tribute to victims of terror attack.",
        "Tech giant Apple unveils new iPhone 13.",
        "United States imposes new sanctions on North Korean regime.",
        "The World Health Organization issues guidelines for COVID-19 vaccine distribution.",
        "The famous actress will be hosting a charity event to raise funds for a children's hospital.",
        "Elon Musk's SpaceX launches new satellite into orbit.",
        "President Biden announces new plan for infrastructure investment.",
        "WHO declares COVID-19 a global pandemic, urging countries to take immediate action.",
        "New York City declares a state of emergency due to rising COVID-19 cases.",
        "Dr. Anthony Fauci warns of potential surge in COVID-19 cases during holiday season.",
        "President Biden's infrastructure plan faces opposition from Republican lawmakers.",
        "Elon Musk's SpaceX company successfully launches another batch of Starlink satellites.",
        "Tech giant Apple launches new line of MacBook Pro laptops.",
        "Amazon revamps its Prime Day strategy to boost sales amid increasing competition from other e-commerce giants.",
        "Apple announces record-breaking sales for new iPhone model.",
        "Elon Musk's SpaceX successfully launches latest batch of Starlink satellites.",
        "Elon Musk's SpaceX successfully lands rocket booster on drone ship",
        "President Biden signs new infrastructure bill into law."
    ],
    "sentences": [
        "Apple unveils new iPhone model with enhanced camera features.",
        "APPLE ANNOUNCES LAUNCH OF NEW iPHONE.",
        "Apple Inc. announces launch of new iPhone model.",
        "Megan Rapinoe named as keynote speaker for Women's Equality Day event.",
        "Tech giant Apple launches new iPhone model.",
        "Apple Inc. launches new iPad Pro with 5G technology.",
        "Apple unveils new iPhone with advanced facial recognition technology.",
        "Tesla reports record-breaking sales in the second quarter.",
        "APPLE ANNOUNCES LAUNCH OF NEW IPHONE MODEL.",
        "APPLE ANNOUNCES RELEASE OF NEW IPHONE 12 PRO.",
        "Apple unveils new iPhone with advanced camera technology.",
        "Apple Inc. unveils new iPhone with enhanced camera and battery life.",
        "Apple unveils new iPhone 13 with improved camera and battery life.",
        "Apple announces release date for new iPhone 13.",
        "Tech giant Apple announces new iPhone release.",
        "Apple Inc. to release new iPhone model next month.",
        "Tokyo Olympic Games postponed due to COVID-19 pandemic.",
        "Apple announces groundbreaking new chip for next generation of iPhones",
        "Apple announces the release of the new iPhone model.",
        "Apple unveils new iPhone with enhanced camera and 5G capability.",
        "World Health Organization urges countries to increase vaccine distribution to combat the Delta variant.",
        "Apple Inc. announces the release of the new iPhone 13.",
        "Apple announces launch of new iPhone model.",
        "Apple releases new iPhone with advanced camera technology.",
        "Apple announces new iPhone release.",
        "Apple Inc. announces new iPhone launch event.",
        "Apple to unveil new iPhone model at upcoming product event.",
        "Apple announces new iPhone with advanced camera technology.",
        "Apple Inc. unveils new iPhone with revolutionary features.",
        "Apple surpasses expectations with record-breaking iPhone sales.",
        "Apple unveils new iPhone with enhanced camera technology.",
        "Tech giant Apple unveils new iPhone with advanced features.",
        "APPLE ANNOUNCES NEW IPHONE RELEASE DATE.",
        "TOM HANKS TO STAR IN UPCOMING SCI-FI FILM.",
        "TORNADO HITS OKLAHOMA CITY, CAUSED MAJOR DAMAGE.",
        "Apple unveils new iPhone with advanced camera features.",
        "Apple Inc. unveils new iPhone with advanced features and technology.",
        "Apple unveils new iPhone with improved camera and battery life.",
        "Apple announces new iPhone with 5G capabilities.",
        "Apple announces new iPhone release date.",
        "Apple Inc. announces record-breaking sales for the latest iPhone model.",
        "Apple announces new iPhone with advanced camera features.",
        "Apple to release new iPhone with 5G capabilities.",
        "Tech giant Apple unveils new iPhone model.",
        "London to host 2022 World Chess Championship.",
        "Queen Elizabeth II celebrates her Platinum Jubilee with special events.",
        "Apple Inc. announces the release of its latest iPhone model.",
        "APPLE ANNOUNCES NEW iPHONE RELEASE DATE.",
        "APPLE ANNOUNCES NEW IPHONE LAUNCH EVENT.",
        "Tesla achieves record profits in Q3, surpassing Wall Street expectations.",
        "Apple announces launch date for new iPhone.",
        "Apple unveils latest iPhone model at annual product launch event.",
        "Apple Inc. unveils new iPhone with enhanced features.",
        "Apple Inc. unveils new iPhone with advanced camera technology.",
        "Apple's new iPhone 13 to be released in September.",
        "Apple Inc. introduces new iPhone with advanced camera features",
        "Apple launches new iPhone with advanced features.",
        "FDA approves new drug for treating diabetes",
        "APPLE ANNOUNCES LAUNCH OF NEW iPHONE MODEL.",
        "Apple unveils new iPhone with advanced AI capabilities.",
        "Apple Inc. announces new iPhone release date.",
        "German Chancellor Angela Merkel announces plans for retirement.",
        "German Chancellor Angela Merkel calls for more global cooperation on climate change.",
        "Canadian Prime Minister Justin Trudeau to meet with German Chancellor Angela Merkel next week.",
        "Apple unveils new iPhone with innovative features.",
        "The United Nations report warns of a looming humanitarian crisis in Yemen as the conflict continues.",
        "Apple Inc. reports record-breaking sales for latest iPhone release.",
        "The Prime Minister of Japan visits Washington D.C. for trade talks.",
        "Hurricane Irma devastates Florida coast.",
        "Apple surpasses one trillion dollars in market value.",
        "Elon Musk's SpaceX plans to launch 60 Starlink satellites into orbit.",
        "Elon Musk's SpaceX successfully launches a new communications satellite into orbit.",
        "Apple Inc. introduces new iPhone with advanced technology.",
        "Tesla announces new electric vehicle model.",
        "The United Nations reports a spike in violence in the Democratic Republic of the Congo, leading to a humanitarian crisis.",
        "NASA successfully lands rover on Mars.",
        "Tech giant Apple reveals new line of iPhones at annual keynote event.",
        "The European Union imposes sanctions on Russian officials.",
        "The United Nations calls for global action to address climate change.",
        "Tech giant Apple unveils new product line.",
        "President Biden announces new climate change initiatives.",
        "Elon Musk's SpaceX to launch new satellite into orbit.",
        "Apple CEO Tim Cook announces new iPhone release date.",
        "Elon Musk's SpaceX to launch a satellite into orbit.",
        "Scientists discover new species of marine life in the Great Barrier Reef",
        "TOKYO OLYMPICS TO ALLOW LIMITED SPECTATORS AMID COVID-19 CONCERNS.",
        "The CEO of Google announced a new technology advancement at the annual conference.",
        "Elon Musk's SpaceX aims to launch its Starship rocket for Mars mission.",
        "The United Nations issues a statement on climate change.",
        "Mayor Johnson introduces new initiative to combat homelessness in the city.",
        "President Biden signs new climate change legislation into law.",
        "Hurricane Katrina devastates New Orleans, leaving thousands homeless.",
        "Elon Musk's SpaceX successfully launches a new batch of Starlink satellites.",
        "Tesla reports record quarterly revenue amid global chip shortage.",
        "The renowned scientist, Dr. Jane Smith, received the Nobel Prize for her groundbreaking research.",
        "NASA's Mars Rover successfully completed its mission to collect samples from the Martian surface.",
        "Tech giant Apple announces the release of the new iPhone 13.",
        "Apple Inc. launches new iPhone 13 models.",
        "New York City Mayor announces new affordable housing initiative.",
        "WHO declares Ebola outbreak in Democratic Republic of the Congo a public health emergency.",
        "Japan's Prime Minister visits South Korea for diplomatic talks.",
        "The World Health Organization urges countries to take stronger measures against the spread of COVID-19 variants.",
        "NASA's Mars rover finds evidence of ancient life.",
        "The CEO of Apple Inc. unveils the latest iPhone model at the tech conference.",
        "The CEO of Apple Inc. announces a new product launch.",
        "Tesla CEO Elon Musk unveils new electric trucks at company event.",
        "Tesla CEO Elon Musk plans to build a new factory in Texas.",
        "Rising tennis star Naomi Osaka wins her third Wimbledon match in a row.",
        "Apple CEO Tim Cook unveils new iPhone models at annual tech conference.",
        "Hurricane Ida hit Louisiana with devastating force.",
        "Tokyo, Japan experiences record-breaking heatwave.",
        "Prime Minister Trudeau visits United Nations headquarters.",
        "United States imposes sanctions on Chinese tech company Huawei.",
        "New York City Mayor announces plans for affordable housing initiative in Manhattan.",
        "The United Nations issues a statement condemning the recent cyber attacks.",
        "New York City announces plan to increase affordable housing options in Manhattan.",
        "Prime Minister Trudeau visits flood-affected areas in British Columbia.",
        "London Mayor announces plan to reduce air pollution in the city center.",
        "Apple announces the release of the new iPhone 13.",
        "Prime Minister Boris Johnson visits Kuwait to discuss trade agreements.",
        "London's Heathrow Airport to undergo major expansion.",
        "President Biden to visit United Kingdom next week.",
        "Hurricane Maria devastates Puerto Rico, leaving thousands without power.",
        "Mayor Johnson to address new school funding plan.",
        "President Biden meets with South Korean leader to discuss trade agreements.",
        "President Biden delivers speech on economy and infrastructure in New York City.",
        "Elon Musk's SpaceX launches 60 more Starlink satellites to orbit.",
        "Los Angeles Lakers sign new head coach.",
        "Prime Minister Johnson meets with German Chancellor Merkel to discuss Brexit negotiations.",
        "New York City Mayor announces plan to address homelessness crisis.",
        "Apple announces new privacy features for upcoming iPhone models.",
        "Hurricane Elsa causes widespread damage in Caribbean.",
        "The World Health Organization announces global vaccination initiative for COVID-19.",
        "Tokyo Olympics organizers face criticism over handling of COVID-19 protocols.",
        "Tesla CEO Elon Musk unveils new electric car model at annual conference.",
        "Apple reports record-breaking iPhone sales for the holiday season.",
        "The president of France, Emmanuel Macron, visits the United States for trade discussions.",
        "Apple unveils latest iPhone model with improved camera technology.",
        "Apple to unveil new iPhone 13 at virtual event next month.",
        "Japan's Prime Minister Shinzo Abe to meet with President Trump to discuss trade agreements.",
        "Tech giant Apple announces launch of new iPhone.",
        "President Smith announces new trade deal with European Union.",
        "TOKYO OLYMPICS POSTPONED DUE TO COVID-19",
        "London Mayor unveils new public transport plan.",
        "PRESIDENT BIDEN SIGNS EXECUTIVE ORDER ON CLIMATE CHANGE.",
        "APPLE ANNOUNCES RELEASE OF NEW IPHONE.",
        "Russia warns US to stay away from Crimea",
        "Olympic Games in Tokyo to be held without spectators due to COVID-19 concerns.",
        "Elon Musk's SpaceX launches the Falcon 9 rocket.",
        "Tech giant Apple unveils new iPhone with 5G capability.",
        "Elon Musk's SpaceX successfully launches new batch of Starlink satellites.",
        "Japan to host 2021 Summer Olympics, despite concerns over COVID-19.",
        "APPLE ANNOUNCES RELEASE OF NEW iPHONE MODEL.",
        "Hurricane Florence makes landfall in North Carolina.",
        "World Health Organization updates guidance on COVID-19 vaccine distribution.",
        "New York City announces plans to fully reopen Broadway theaters in September.",
        "Elon Musk's SpaceX successfully launches a new series of Starlink satellites into orbit.",
        "Famous chef opens flagship restaurant in Miami.",
        "The CEO of Apple announces the launch of a new iPhone.",
        "Mayor Garcia of Long Beach declares state of emergency due to severe heat wave.",
        "Angela Merkel to step down as German Chancellor in 2021",
        "CEO of Tesla Elon Musk becomes world's richest person",
        "Hurricane Dorian devastates Bahamas, leaving widespread destruction in its wake.",
        "The president of the United States signed a new trade deal with Mexico and Canada.",
        "New York City imposes indoor mask mandate amid rising COVID cases",
        "Apple announces record-breaking sales for the latest iPhone model.",
        "Elon Musk's SpaceX plans to launch commercial spaceflights to the moon",
        "New York City Mayor announces plan to increase funding for affordable housing initiatives.",
        "Elon Musk's SpaceX successfully launches another Starlink mission.",
        "Apple to release new iPhone model next month.",
        "New study reveals link between coffee consumption and reduced risk of heart disease.",
        "COVID-19 cases surge in New York City.",
        "APPLE ANNOUNCES LAUNCH OF NEW IPHONE.",
        "NASA launched a new satellite to explore deep space.",
        "APPLE ANNOUNCES LAUNCH DATE FOR NEW iPHONE.",
        "Biden administration plans to increase funding for renewable energy projects.",
        "New York City Mayor declares state of emergency in response to severe weather conditions.",
        "Apple Inc. announces the release date for the new iPhone 13.",
        "Hurricane Irma causes widespread devastation across the Caribbean islands.",
        "Japan to host 2020 Summer Olympics.",
        "TORNADO HITS MIDWESTERN TOWN, LEAVING DEVASTATION IN ITS WAKE.",
        "New York City Mayor announces plan to increase affordable housing developments.",
        "Russian president Vladimir Putin meets with Chinese leader Xi Jinping to discuss trade agreements.",
        "Mayor Johnson announces new infrastructure plan for the city.",
        "Prime Minister Johnson to visit Germany and France for Brexit talks.",
        "President Biden meets with Prime Minister Johnson in London.",
        "New York City Mayor announces plans to invest $10 million in new public transportation initiatives.",
        "Japan's Prime Minister visits United States for trade talks.",
        "Tropical storm hits the coast, causing widespread power outages.",
        "NASA's Perseverance rover makes historic landing on Mars.",
        "Tokyo, Japan prepares for the upcoming Summer Olympics amid rising concerns about COVID-19.",
        "The CEO of Amazon plans to step down next year.",
        "Apple announces new iPhone 12 release date.",
        "The United Nations Secretary-General is expected to address the General Assembly next week.",
        "Apple unveils new updates to iPhone and iPad.",
        "The United Nations has issued a statement condemning the recent escalation of violence in the region.",
        "Apple unveils new iPhone model with improved camera and battery life.",
        "Tesla's stock price hit an all-time high on Monday.",
        "Scientists have discovered a new species of butterfly in the Amazon rainforest.",
        "Apple Inc. announces the launch of its new iPhone 13 series.",
        "Hurricane Katrina devastates New Orleans in 2005.",
        "Tensions rise as China announces new military exercises in the South China Sea.",
        "Elon Musk unveils plans for new Mars mission.",
        "The CEO of Apple, Tim Cook, announces the release of a new line of iPhones.",
        "Tropical storm warning issued for coastal areas.",
        "Elon Musk's SpaceX launches its latest batch of Starlink satellites into orbit.",
        "Hurricane Maria causes widespread devastation in Puerto Rico.",
        "The CEO of Apple Inc. announced a new product launch event next month.",
        "New York City Mayor announces new plan to address homelessness crisis.",
        "European Union imposes sanctions on Russian officials for human rights violations.",
        "Elon Musk's SpaceX successfully launches 60 more Starlink internet satellites.",
        "Elon Musk announces plans to colonize Mars by 2050.",
        "President Biden announces new infrastructure plan to address aging roads and bridges.",
        "Tokyo Olympics to proceed without spectators due to COVID-19 concerns.",
        "New York City announces plan to fully reopen Broadway theaters at 100% capacity.",
        "Tesla's shares soar after strong Q3 earnings report.",
        "Environmental organization launches campaign to protect endangered species.",
        "Tesla unveils new electric car model.",
        "Apple unveils new iPhone with enhanced camera and longer battery life.",
        "Professor Smith awarded Nobel Prize for groundbreaking research in physics.",
        "CEO Elon Musk announces SpaceX mission to Mars.",
        "The new COVID-19 variant, originally identified in South Africa, is spreading rapidly in Europe.",
        "Apple announces the launch of its new iPhone 13 series.",
        "Climate change activists protest outside government headquarters in London.",
        "The United Nations releases a new report on climate change.",
        "Elon Musk's SpaceX plans to launch more Starlink satellites into orbit.",
        "United Nations reports sharp rise in global temperatures.",
        "Tropical storm causes flooding in coastal regions.",
        "Apple announces new iPhone launch event.",
        "Apple announces new iPhone release date and features.",
        "Japan's Prime Minister Yoshihide Suga visited the United States to discuss trade agreements.",
        "Wildfires continue to spread in the Australian state of New South Wales.",
        "President Biden meets with leaders of G7 nations to discuss climate change initiatives.",
        "Apple Inc. unveils latest iPhone model with enhanced camera features.",
        "Elon Musk's SpaceX successfully launches Falcon 9 rocket.",
        "Japan to host 2022 World Cup.",
        "Japan's Prime Minister meets with South Korea's President ahead of the upcoming trade talks.",
        "Apple unveils new iPhone with longer battery life and improved camera features.",
        "Elon Musk's SpaceX successfully lands Starship prototype.",
        "United Nations adopts resolution on climate change.",
        "Elon Musk's SpaceX launches another set of Starlink satellites into orbit.",
        "New York City Mayor announces plan for affordable housing initiative.",
        "Emma Stone wins Best Actress at the Oscars.",
        "Elon Musk's SpaceX successfully launches a new batch of Starlink satellites into orbit.",
        "Earthquake hits southern California, causing minor damage.",
        "Tokyo Olympics to proceed without overseas spectators due to COVID-19 concerns.",
        "Biden administration imposes new sanctions on Russian officials.",
        "New York City Mayor announces plan to revitalize public transportation system.",
        "Elon Musk's SpaceX successfully launches 60 new Starlink satellites into orbit.",
        "German Chancellor Angela Merkel announces plans for retirement after next election.",
        "New York City mayor announces plan to improve public transportation.",
        "Los Angeles Lakers acquire top draft pick for upcoming season.",
        "In a historic move, Paris Agreement enters into force with overwhelming global support.",
        "Tesla announces record-breaking sales for the second quarter.",
        "Apple launches new iPhone with advanced camera features.",
        "Elon Musk's SpaceX successfully launches 60 more Starlink satellites.",
        "Heavy rains cause floods in southern India, leaving thousands displaced.",
        "APPLE UNVEILS NEW IPHONE WITH 5G CAPABILITIES.",
        "Apple announces record-breaking iPhone sales for the third quarter.",
        "Scientists announce major breakthrough in cancer research.",
        "Prime Minister Johnson delivers speech at UN General Assembly.",
        "Elon Musk's SpaceX launches 60 more Starlink satellites",
        "Scientists discover a new species of fish in the Pacific Ocean.",
        "Apple Inc. announces new iPhone with advanced camera technology.",
        "Hurricane Maria devastates Puerto Rico.",
        "TECH GIANT APPLE TO LAUNCH NEW IPHONE MODEL NEXT MONTH.",
        "Mayor Johnson unveils new infrastructure plan for city.",
        "Taylor Swift to perform at the Grammy Awards.",
        "Tesla to release new line of electric vehicles in 2023.",
        "Prime Minister Trudeau visits flood-ravaged town to assess damage and meet with residents.",
        "FORD ANNOUNCES PLAN TO LAUNCH NEW ELECTRIC VEHICLE MODELS.",
        "Elon Musk's SpaceX rocket successfully lands on the moon.",
        "Earthquake hits southern California, causing power outages and minor damage.",
        "London Mayor announces new housing initiative.",
        "WHO declares global health emergency due to surge in COVID-19 cases.",
        "APPLE UNVEILS NEW iPHONE WITH 5G CAPABILITIES.",
        "Elon Musk's SpaceX launches new batch of Starlink satellites into orbit.",
        "Elon Musk's SpaceX to launch satellite for Canadian company.",
        "Parisians protest new labor laws outside government buildings.",
        "Microsoft announces acquisition of AI startup for $1 billion.",
        "Tech giant Apple to release new iPhone model next month.",
        "The United Nations has authorized a new resolution to impose sanctions on the country.",
        "Apple announces new iPhone launch event, expected to unveil the latest technology and features.",
        "Apple announces new iPhone with 5G capability.",
        "Elon Musk's SpaceX successfully launches latest batch of Starlink satellites",
        "Elon Musk's SpaceX successfully launches new batch of Starlink satellites into orbit.",
        "Elon Musk's SpaceX plans to launch another set of Starlink satellites.",
        "New York City Mayor de Blasio announces new affordable housing initiative.",
        "New York City Mayor announces plans to invest in affordable housing initiatives.",
        "The CEO of Apple Inc. announced a new product launch event scheduled for next month.",
        "Japan announces plans to host the 2030 FIFA World Cup.",
        "Elon Musk's SpaceX successfully launches 60 more Starlink satellites",
        "President Biden delivers speech at UN General Assembly.",
        "Flooding in New Orleans forces thousands to evacuate as Hurricane Ida makes landfall.",
        "Dr. Anthony Fauci warns of potential spike in COVID-19 cases",
        "WHO warns of potential surge in COVID-19 cases as travel restrictions ease.",
        "Apple announces release of new iPhone model.",
        "Mayor Garcia declares state of emergency for flooding in downtown area.",
        "Apple unveils new iPhone with advanced 5G technology.",
        "New York City Mayor announces plan to increase affordable housing options.",
        "Wildfires continue to ravage northern California, forcing evacuations in several communities.",
        "Apple Inc. reports record-breaking sales for the latest iPhone model.",
        "Earthquake hits southern California, causing damage to several buildings.",
        "Olympics Tokyo 2020: Simone Biles withdraws from all-around competition citing mental health concerns.",
        "Heavy rainfall leads to flooding in coastal town.",
        "President Biden delivers State of the Union address to Congress and American people.",
        "Apple's new iPhone 13 release date announced",
        "British Prime Minister Boris Johnson faces criticism over handling of COVID-19 pandemic.",
        "Apple Inc. announces launch of new iPhone with advanced features.",
        "Hurricane Maria hits Puerto Rico.",
        "The CEO of Apple plans to launch a new technology innovation next month.",
        "Elon Musk's SpaceX launches 60 more Starlink satellites in record-breaking mission.",
        "Apple announces new iPhone with advanced camera technology",
        "The CEO of Apple Inc. announces new product launch at upcoming tech conference.",
        "Paris prepares for the annual Bastille Day celebrations.",
        "The CEO of Apple Inc. announces a new product launch at the annual tech conference.",
        "Firefighters battling wildfires in Northern California.",
        "Hollywood actress Jennifer Lawrence to star in upcoming thriller.",
        "Tesla reports record-breaking sales for the third quarter.",
        "Japan to host 2021 Summer Olympics despite concerns over COVID-19 pandemic.",
        "Tokyo Olympics organizers unveil COVID-19 guidelines for athletes and officials.",
        "Hurricane Dorian devastates Bahamas",
        "APPLE ANNOUNCES NEW IPHONE RELEASE DATE",
        "Elon Musk's SpaceX successfully launches latest batch of Starlink satellites into orbit.",
        "Prime Minister Boris Johnson visits London Bridge to pay tribute to victims of terror attack.",
        "Tech giant Apple unveils new iPhone 13.",
        "United States imposes new sanctions on North Korean regime.",
        "The World Health Organization issues guidelines for COVID-19 vaccine distribution.",
        "The famous actress will be hosting a charity event to raise funds for a children's hospital.",
        "Elon Musk's SpaceX launches new satellite into orbit.",
        "President Biden announces new plan for infrastructure investment.",
        "WHO declares COVID-19 a global pandemic, urging countries to take immediate action.",
        "New York City declares a state of emergency due to rising COVID-19 cases.",
        "Dr. Anthony Fauci warns of potential surge in COVID-19 cases during holiday season.",
        "President Biden's infrastructure plan faces opposition from Republican lawmakers.",
        "Elon Musk's SpaceX company successfully launches another batch of Starlink satellites.",
        "Tech giant Apple launches new line of MacBook Pro laptops.",
        "Amazon revamps its Prime Day strategy to boost sales amid increasing competition from other e-commerce giants.",
        "Apple announces record-breaking sales for new iPhone model.",
        "Elon Musk's SpaceX successfully launches latest batch of Starlink satellites.",
        "Elon Musk's SpaceX successfully lands rocket booster on drone ship",
        "President Biden signs new infrastructure bill into law."
    ]
}