{
    "not-allowed-entity-type": [
        "What movie features the song 'My Heart Will Go On' by Celine Dion?",
        "Can you tell me about the movie that won the most Oscars in the 1990s?",
        "I remember a classic movie with Humphrey Bogart that received a lot of awards. Can you remind me which one it was?",
        "I'm feeling nostalgic for an iconic film from the 80s that was nominated for multiple Golden Globes. Can you help me remember the title?",
        "Can you tell me which movie won the Best Picture award at the Oscars in 2019? I'm curious to know.",
        "I'm in the mood for a critically acclaimed movie. Can you recommend a film that has won multiple awards, please?",
        "I'm looking for a feel-good movie that has been nominated for a Golden Globe. Any suggestions?",
        "Can you tell me which movie won the Academy Award for Best Picture in 1994?",
        "Show me a film that received multiple nominations at the Golden Globes this year.",
        "I'm looking for a movie that won both the Palme d'Or and the BAFTA Award for Best Film.",
        "I want to watch a film that has great music, do you have any recommendations?",
        "Is there a movie known for its iconic soundtrack?",
        "Spoken Query: \"Can you tell me about any movie that has won a lot of awards?\"",
        "Spoken Query: \"I'm curious, which movie has been recognized for its exceptional performances?\"",
        "Spoken Query: \"Are there any movies that have received critical acclaim and recognition?\"",
        "Can I watch any George Clooney films on Netflix?",
        "Spoken Query: \"Can we watch a fantasy movie suitable for kids this evening?\"",
        "Can I watch the new Disney princess movie on Netflix?",
        "Is there a romantic comedy from the 2000s available on Hulu?",
        "Do you have any recommendations for family-friendly animated films on Amazon Prime?",
        "Can you recommend a movie with a great soundtrack for a girls' night?",
        "Can you tell me a movie that won an Oscar for best picture from the 1970s?",
        "I'm looking for a film that was nominated for a Golden Globe for best actress in a drama.",
        "What movie received the most nominations at the BAFTA awards last year?",
        "Are there any classic movies from the 1950s available on Netflix?",
        "Can I find any western films on Amazon Prime?",
        "Is there a way to watch musicals from the 1960s on Hulu?",
        "I'm interested in watching a critically acclaimed film, ideally one that was nominated for an Oscar. Can you suggest anything?",
        "Can I watch the movie Inception on Netflix?",
        "Are there any highly-rated comedy movies from the 1990s available on Hulu?",
        "Is there a classic Alfred Hitchcock film with a mystery plot that I can stream on Amazon Prime?",
        "Can I watch the movie Interstellar on Netflix?",
        "Is there a comedy film from the 90s available on Hulu?",
        "Do you have any information on The Dark Knight, directed by Christopher Nolan, available on Amazon Prime?",
        "Are there any romantic comedy movies playing tonight where I can get tickets?",
        "Could you provide me with the director's commentary for the film Inception?",
        "Please show me the interviews with the cast and crew of the film Titanic.",
        "Spoken Query: \"Can you tell me about any movies directed by Martin Scorsese that have won an Oscar?\"",
        "Spoken Query: \"Show me a film featuring Meryl Streep that received multiple Golden Globe nominations.\"",
        "Which movie received the most nominations at the Oscars last year?",
        "which movie won the most awards in the year 2020",
        "what film received the most nominations at the Oscars",
        "show me a movie that won the Palme d'Or at the Cannes Film Festival",
        "What's the story behind the movie Die Hard?",
        "Can you tell me which movie won the most awards this year?",
        "I'm looking for a movie with the most nominations for prestigious awards",
        "Show me a film with an actor or actress who has won multiple Academy Awards",
        "Which movie won the most Academy Awards in 2020?",
        "Can you tell me the list of films nominated for Best Picture in 2015?",
        "What movie received the most nominations at the Golden Globes last year?",
        "Can you tell me if the movie Frozen won any awards?",
        "What movie from 2019 got the most nominations?",
        "I want to watch a movie with a strong female lead who has won a lot of awards, can you recommend one?",
        "what movie is currently showing with a soundtrack by Hans Zimmer?",
        "Can you tell me which movie won the most awards at the Oscars last year?",
        "I'm looking for a movie that was nominated for both Best Picture and Best Director at the Golden Globes",
        "Show me a film with a Golden Bear award from the Berlin International Film Festival",
        "I am looking for a comedy film that falls under the dark comedy subgenre and involves a heist",
        "I want to watch a science fiction movie set in a dystopian future with artificial intelligence as the main theme",
        "can I watch the movie Inception on Netflix?",
        "is there a trailer available for the new Mission: Impossible movie on Amazon Prime Video?",
        "what are the top-rated horror movies on Hulu?",
        "Spoken Query: \"Are there any movies that received multiple awards despite mixed reviews?\"",
        "Spoken Query: \"Can you really trust the award nominations for the new romantic comedy film?\"",
        "Spoken Query: \"Is it true that the sci-fi movie won best picture at the Oscars despite its low viewers' rating?\"",
        "What time is the next showing for Jurassic Park?",
        "I'm looking for a classic movie with Humphrey Bogart, preferably on a streaming service. Any recommendations?",
        "Tell me the movie that won the most Oscars in the 90s",
        "I need to know which film was nominated for Best Picture, hurry up",
        "What movie was the winner of the Cannes Film Festival in the past 5 years",
        "What movie won the most awards in 2020",
        "Has any movie with Meryl Streep won an Oscar",
        "Which film received the most nominations in the comedy genre",
        "Is the movie Frozen available on Netflix for kids to watch?",
        "Are there any romantic movies from the 90s on Disney+?",
        "Can I find any animated films on Amazon Prime with strong female characters?",
        "Which movie received the most awards last year?",
        "Can you recommend a movie directed by a woman that has won multiple awards?",
        "can I watch any good classic romance movies on Netflix tonight",
        "are there any comedy movies from the 2000s available on Amazon Prime",
        "show me some action-packed films with strong female leads that I can stream on Hulu",
        "What movie won the most Oscars in 1997",
        "Has Clint Eastwood's directed films ever received Golden Globe nominations",
        "Can you tell me about the movie with the most Bafta nominations in the 1980s",
        "Show me a children's movie with a high viewers' rating and multiple nominations for best animated feature",
        "Are there any comedy movies from the 1990s available on Netflix?",
        "Could you recommend a movie with a strong female lead that's on Hulu?",
        "Is there a romantic drama film on Amazon Prime Video directed by Ang Lee?",
        "Spoken Query: \"Are there any movies that have won an Oscar for Best Picture?\"",
        "Spoken Query: \"Which film has received the most nominations at the Golden Globe Awards?\"",
        "Spoken Query: \"Can you recommend a movie that has won multiple BAFTA awards?\"",
        "Can you tell me if the movie Inception is available on Netflix, and if so, could you show me a trailer of it?",
        "I'm looking for a highly-rated horror movie from the 1980s with a catchy soundtrack. Can you recommend one available on Amazon Prime?",
        "I want to watch a classic black and white film featuring Audrey Hepburn. Could you find me one with a high viewers' rating that's currently on Hulu?",
        "Can you recommend a film in the horror genre that falls under the supernatural subgenre",
        "I'm looking for a science fiction movie with cyberpunk elements, can you suggest one",
        "What are some of the top action movies with martial arts as the main subgenre",
        "Hey, what's a cool action movie on Netflix with lots of explosions?",
        "Can I watch a scary movie on Disney+ with zombies and stuff like that?",
        "I want to see a really funny movie on Amazon Prime, maybe with superheroes or something.",
        "Show me a movie directed by Greta Gerwig that has won an Oscar.",
        "Can I see the schedule for the romantic comedy movies playing this weekend?",
        "which movie won the most Academy Awards in 2020",
        "show me a movie directed by Christopher Nolan that was nominated for a Golden Globe",
        "What movies directed by Christopher Nolan are available on Netflix?",
        "Find me a movie with a high IMDb rating that I can watch on Amazon Prime",
        "Show me a film starring Meryl Streep that I can stream on Hulu",
        "what is the highest rated movie of 2020 and can I watch it on Netflix",
        "show me a list of comedy movies directed by Christopher Guest that I can stream",
        "Is there a movie playing tonight that has a great soundtrack?",
        "I need to watch a movie with Chris Hemsworth on Netflix right now.",
        "Is there any good action movie with a high IMDb rating that I can stream on Amazon Prime?",
        "I'm desperately in need of a comedy film to watch on Hulu. Can you recommend something with a high Rotten Tomatoes score?",
        "What movie won the Best Picture award at the Oscars in 2019?",
        "Has Steven Spielberg directed any films that have won multiple Academy Awards?",
        "Show me a movie that was nominated for both Best Actor and Best Actress at the Golden Globes.",
        "Is the movie The Matrix available for streaming?",
        "Can I watch any action movies starring Will Smith on any streaming service?",
        "Are there any recent romantic comedies directed by Nancy Meyers that I can stream?",
        "Can you tell me about the movie that won the most awards in 2020",
        "Which movie with a female lead was nominated for the most prestigious award last year",
        "Is there a film that has won multiple awards and is considered a classic?",
        "Show me a film from the 2000s that won the Palme d'Or at Cannes Film Festival",
        "Can I buy tickets for the movie Casablanca at 7pm tonight?",
        "Do you have any information on the movie Inception's showtimes this weekend?",
        "Have any James Bond movies won an Academy Award?",
        "Can I watch any Cary Grant movies on Netflix that are considered classic comedies?",
        "Show me a list of movies from the 1960s that feature the song 'My Girl' by The Temptations and are available on Amazon Prime.",
        "What are some action movies directed by Steven Spielberg that I can stream online?",
        "Spoken Query: \"Can I watch The Shawshank Redemption on Netflix?\"",
        "Spoken Query: \"Does the movie Inception have a high viewers' rating and is it available on Amazon Prime?\"",
        "Spoken Query: \"Is the director Christopher Nolan known for any science fiction films that are currently on Hulu?\"",
        "What is the title of the movie where Leonardo DiCaprio starred alongside Kate Winslet and had a theme song that won an Oscar?",
        "Can you tell me which movie won the most awards at the Oscars this year?",
        "I'm curious to know if the film 'The Shawshank Redemption' has received any prestigious nominations.",
        "I'm feeling hopeful that the movie 'La La Land' has won some major accolades. Can you share that with me?",
        "Which streaming platform offers the movie 'Inception' directed by Christopher Nolan and released in 2010?",
        "Can I watch the film 'Pulp Fiction' with an R rating on any streaming platform?",
        "I heard that there's a movie with a lot of awards, can you tell me which one it is?",
        "I'm looking for a film that received great recognition from the critics, can you help me find it?",
        "I'm curious about a certain movie that got a lot of nominations, do you have any idea which one I'm thinking of?",
        "Can I watch The Shawshank Redemption on Netflix?",
        "I want to see a Quentin Tarantino film with a gritty plot. Is Pulp Fiction available on Amazon Prime?",
        "Any idea what movies are playing at the theater down the street?",
        "which movie won the most Oscars in 2021",
        "can you tell me if the movie Inception received any Golden Globe nominations",
        "show me a film that won the Palme d'Or at the Cannes Film Festival",
        "Are there any action movies playing in theaters tonight?",
        "Can you recommend a popular comedy from the 90s currently showing in my area?",
        "Is there a theater nearby playing a recent thriller film that has received positive reviews?",
        "Can you recommend a good horror movie with a strong focus on psychological suspense?",
        "Do you have any action-adventure movies set in a post-apocalyptic world that feature a strong female lead?",
        "Is there a movie with a soundtrack by Hans Zimmer available to watch?",
        "Is there a streaming service where I can watch the film The Godfather?",
        "What's the scoop on the new Christopher Nolan movie? Any insider details about the cast and crew?",
        "What movie from the 1990s with a high viewers' rating has won multiple Oscars?",
        "Can you tell me which film won the Best Picture award in 2019 at the Oscars?",
        "Has any movie from the 1990s been nominated for the Palme d'Or at the Cannes Film Festival?",
        "I'm looking for a movie directed by Quentin Tarantino that received multiple Oscar nominations.",
        "Can you tell me about any movies that have won big awards?",
        "I'm curious about any highly acclaimed films, could you share some with me?",
        "Do you know any movies that have been nominated for prestigious awards recently?",
        "Can you provide me with a list of films with scores composed by Hans Zimmer?",
        "Spoken Query: \"Can you recommend a comedy film that is categorized as a romantic comedy and revolves around a workplace romance?\"",
        "Can you tell me which movie won the Oscar for Best Picture in 2020?",
        "I am looking for a film that was nominated for the Palme d'Or at the Cannes Film Festival in the past five years.",
        "Please find me a movie directed by a filmmaker who has won the Golden Globe for Best Director.",
        "Did that movie with Tom Hanks win any awards?",
        "Have any of the recent animated movies been nominated for anything?",
        "I heard that the movie directed by Christopher Nolan got some awards, is that true?",
        "Which movie from the 90s can I watch with my family on a streaming service?",
        "I'm bored, can you tell me which movie won the most Oscars?",
        "I need something to watch, what movie received the most nominations at the Golden Globes?",
        "I'm looking for a highly acclaimed film, can you recommend a movie that won Best Picture at the Academy Awards?",
        "Did the movie 'The Godfather' really win three Academy Awards?",
        "I heard 'Schindler's List' was nominated for seven BAFTA Awards, is that true?",
        "Can you confirm if 'Titanic' actually won 11 Oscars?",
        "Which director has won the most Academy Awards?",
        "What film received the most nominations for the Oscars this year?",
        "Can I watch the movie Inception on Netflix right now?",
        "Is there a way to stream the film Avatar online?",
        "Can you recommend any horror movies with a strong psychological thriller plot?",
        "Do you know any famous movies featuring a legendary song by Queen?",
        "I'm trying to find a movie with a memorable musical score, can you show me one with a captivating soundtrack?",
        "Who were the main actors in the making of the classic film Psycho?",
        "Yo, can I stream a movie with Keanu Reeves on Netflix?",
        "Hey, is there a movie with some dope fight scenes available on Hulu?",
        "I'm not sure if this movie won any awards, but did the film Inception receive any nominations?",
        "I'm not entirely certain, but I heard that the actor Leonardo DiCaprio was outstanding in the movie Titanic. Did he win any awards for his performance?",
        "I'm not 100% sure, but I think the film La La Land was highly praised. Can you tell me if it received any awards or nominations?",
        "hey, can I watch the movie Titanic on Netflix?",
        "is there a movie from the 90s with a killer soundtrack available on Amazon Prime?",
        "show me a thriller directed by Alfred Hitchcock that I can stream on Hulu",
        "Can you recommend a comedy movie with a romantic subgenre?",
        "I'm looking for a thriller film with a mystery subgenre that will keep me on the edge of my seat. Can you suggest one?",
        "I want to watch a sci-fi movie that has a dystopian subgenre. Can you help me find one?",
        "Has the film Gladiator won any awards?",
        "What movie from the 1960s was nominated for the most Oscars?",
        "Did Steven Spielberg direct any movies that won a Golden Globe?",
        "Which movie won the most Oscars in 2020",
        "Did any films directed by Christopher Nolan receive Golden Globe nominations",
        "What movie was nominated for the Cannes Film Festival Palm d'Or in 2019",
        "Show me a romantic comedy movie available for streaming with Julia Roberts in it",
        "Can you tell me which movie won the most Academy Awards in 2020?",
        "I'm interested in knowing if the film 'The Godfather' received any nominations for the Golden Globe Awards?",
        "I'd like to watch a classic movie that won the Palme d'Or at the Cannes Film Festival. Can you recommend one?",
        "Spoken query: \"Has the movie Interstellar won any major awards?\"",
        "Spoken query: \"Is there a movie with Leonardo DiCaprio that won multiple Oscars?\"",
        "Spoken query: \"What war film from the 2000s has received the most nominations?\"",
        "Which movie won the most awards in 2020?",
        "I need to know the Oscars nominations for the best animated film this year, hurry up!",
        "Tell me quickly, what film received the most nominations for the Golden Globes in the drama category?",
        "Which movie won the most awards in 2020?",
        "Can you tell me about any highly acclaimed movies from the 1980s?",
        "What film received the most nominations at the Oscars last year?",
        "What's a good horror movie I can watch on Hulu?",
        "Can I stream a romantic comedy movie from the 1980s that is available on Netflix?",
        "Is there a good mystery thriller film on Amazon Prime that was released in the 2000s?",
        "I'm looking for a classic drama movie on Hulu. Can you recommend one from the 1960s?",
        "Can you provide me with a list of films with scores composed by Hans Zimmer?",
        "Which movie from the 1990s won the most awards?",
        "I heard that the director of Parasite won several awards, can you provide more information?",
        "Can you recommend a horror movie that is also a psychological thriller?",
        "Show me a musical movie with a romantic comedy subplot.",
        "What's the name of the film that won the Academy Award for Best Picture in the 1960s, and can you share any trivia about the filming process?",
        "Can I find a movie from the 1960s that is available on Netflix and has a high rating?",
        "Which director made an action film that is on Amazon Prime, and can you show me the trailer?",
        "I'm craving a classic romance movie that I can watch on Hulu, can you recommend one with a popular actor?",
        "What movies are playing on Friday at the downtown cinema?",
        "Are there any romantic comedies showing this weekend at the theaters near me?",
        "Can I watch a Steven Spielberg directed movie on any streaming platform?",
        "Is there a popular action movie from the 1990s that I can find on a streaming platform?",
        "What is a good romantic comedy movie to watch this weekend?",
        "can I find the movie The Godfather on Netflix",
        "show me a movie with Clint Eastwood from the 1970s on Amazon Prime",
        "I'm looking for a classic black and white film with Humphrey Bogart on Hulu",
        "Is the movie Inception available to stream anywhere?",
        "I need to find a platform to stream the new James Bond film, No Time to Die, quickly.",
        "I'm in the mood for an action movie with intense fight scenes, preferably something with martial arts or superhero elements.",
        "Is there a highly-rated comedy movie from 2010 available on Netflix or Hulu?",
        "I want to watch a thriller directed by David Fincher, with a rating of at least 4 stars, on Amazon Prime or HBO Max",
        "Show me a classic movie from the 1950s with Audrey Hepburn, available on Disney+ or Apple TV+",
        "I'm interested in the cinematographer for the behind-the-scenes footage of the film Avatar, can you assist me with that?",
        "Which production company was responsible for creating the behind-the-scenes featurette for the movie Gravity?",
        "Which film won the most Oscars in 2020?",
        "Can you recommend a movie that received both Golden Globe and BAFTA nominations?",
        "I'm looking for a film that was both a box office success and won several prestigious awards. Any suggestions?",
        "Can you tell me which movie won the most awards at the Oscars last year?",
        "I'm interested in movies that have been nominated for both Best Picture and Best Director at the Golden Globes. Can you recommend any?",
        "I heard that there's a movie that received a lot of nominations at the BAFTA Awards. Can you tell me which one it is?",
        "Hey, can I watch a movie like The Dark Knight on Netflix tonight?",
        "Show me a good action movie from the 90s, preferably on Hulu.",
        "Do you know where I can find a classic film like Casablanca on any streaming service?",
        "What are the showtimes for any action movie playing tonight?",
        "Can I buy tickets for a well-reviewed comedy film for this weekend?",
        "Do you have any information on dramatic movies showing near me?",
        "Has the movie La La Land won any awards?",
        "Can you tell me about the movie Titanic's nominations?",
        "What awards has the director Christopher Nolan received for his movies?",
        "Do you have any tickets available for a comedy film this weekend?",
        "Has the movie Titanic won any awards?",
        "What movie directed by Martin Scorsese has received the most nominations?",
        "Show me a film with Tom Hanks that has won an Oscar.",
        "Can I watch a classic western movie on Netflix?",
        "I want to watch a suspenseful movie from the 1950s, is there anything available on Amazon Prime?",
        "Are there any action movies on Hulu with a high viewers' rating?",
        "What are the top-rated horror films currently showing and where can I buy tickets?"
    ],
    "entity-not-found": [
        "Is there a documentary about the making of the movie Parasite?",
        "Who directed the making-of documentary for the movie Inception?",
        "Hey, did that movie with the amazing soundtrack and great plot win any awards?",
        "Have you seen that movie with the incredible visual effects and awesome fight scenes? Did it get any nominations?",
        "I'm curious, did the movie with the mind-blowing twist ending and intense storyline win any awards?",
        "What movies are playing near me right now?",
        "Is there a new action movie out this week?",
        "Who directed the sci-fi movie The Matrix and when did it come out?",
        "Can you give me a quick overview of the plot for the latest action thriller film?",
        "Can you give me a quick summary of the plot for the movie Inception?",
        "Can you give me a brief summary of the plot for the movie Inception?",
        "Who directed the classic movie Gone with the Wind and can you show me a trailer for it?",
        "Can you show me a teaser for any new animated movies?",
        "Could you show me a documentary about the making of the movie Inception?",
        "Who directed the movie 'The Princess Diaries' and what is its viewers' rating?",
        "Can you please hurry up and show me a behind-the-scenes look at the making of the new Spider-Man movie?",
        "Can you show me a behind-the-scenes look at the making of the movie Inception?",
        "Can you tell me what Turbo Kid is about?",
        "I want to know the story of How to Train Your Dragon. Can you tell me?",
        "Spoken Query: \"Who directed the film The Godfather and what year was it released?\"",
        "What's the story behind the making of the movie Apocalypse Now, directed by Francis Ford Coppola?",
        "Hey, I heard there's a new documentary about the making of The Godfather, can you tell me more about it?",
        "Who directed the iconic 1994 film Forrest Gump?",
        "What movie is currently playing in theaters near me",
        "Can you give me a brief overview of the plot for the movie Inception",
        "Is the movie 'The Shawshank Redemption' available for streaming on any platform?",
        "Who directed the making of the Avengers: Endgame and what were the major challenges they faced during the production process?",
        "who's the director of that popular movie with action and drama",
        "Who directed the action movie that came out in 1999?",
        "Hey, can you tell me who directed The Avengers and whether there's a documentary about the making of the film?",
        "Has the movie Black Panther received any awards or nominations?",
        "I want to explore some classic film noirs, do you have any recommendations?",
        "Where can I find a teaser for the upcoming Marvel movie with Scarlett Johansson as the lead?",
        "I'm not sure if it's worth watching, but did the film The Social Network win any awards?",
        "I'm not really a fan of musicals, but did La La Land receive any nominations?",
        "I'm not sure if it's relevant, but has the director of The Shape of Water, Guillermo del Toro, won any awards?",
        "What awards did the movie The Shawshank Redemption win?",
        "Who was the director of the movie Titanic, and what awards did it receive?",
        "Is the movie Inception available for streaming?",
        "Can you give me a brief summary of the plot of the movie Inception?",
        "Where can I watch the latest Spider-Man movie online?",
        "Can you give me a brief summary of the plot for the movie Inception",
        "Can you give me a brief overview of the plot for the movie Inception?",
        "I'm hesitant about the reviews for the superhero movie Avengers: Endgame. Can you share a brief synopsis of the plot to help me decide if it's worth watching?",
        "I need to know who directed the movie Interstellar, and also who are the main actors and the genre of the film. I am in a rush!"
    ],
    "entity-overlap": [
        "I'm interested in learning about the making of the Titanic movie, can you show me any interviews with the director or cast members?",
        "I'm curious to know if the director of The Dark Knight has won any prestigious awards."
    ],
    "missing-entity-type": [
        "Who directed the movie Inception?",
        "What's the genre of the movie The Matrix?",
        "Who directed the top horror movie of the 90s?",
        "Can you recommend a good comedy playing at the theater?",
        "Can you tell me who directed the making-of documentary for The Avengers film?",
        "What awards did the movie La La Land win? Hurry up, I don't have all day.",
        "Which director's films have won the most Oscars? I need an answer now.",
        "Can you tell me the top-rated movie of all time? Chop chop, I'm in a hurry.",
        "Can you provide me with a review of the film Inception directed by Christopher Nolan?",
        "Show me a trailer for the movie Titanic, directed by James Cameron.",
        "Which director has the most number of Oscar-winning movies?",
        "What movie directed by Brad Bird has won the most awards?",
        "Can you tell me who directed the movie that won the most Oscars in 2020?",
        "is the movie Forrest Gump available on any streaming platforms",
        "Who directed the film 'The Godfather' and what is the viewers' rating for it?",
        "Do you have any information about the latest movie directed by Christopher Nolan and its plot?",
        "Can I watch a movie with Humphrey Bogart on any streaming platforms?",
        "Is there a classic musical film available to watch on streaming platforms?",
        "Show me a romantic comedy movie from the 1950s that I can watch online",
        "Who directed the 1994 film The Shawshank Redemption and what is the viewers' rating for it?",
        "Which actor starred in a science fiction movie with the highest viewers' rating",
        "Can I watch the movie 'Frozen' on any streaming platforms?",
        "What kind of movies does Taylor Swift star in, and are they available on Netflix?",
        "Are there any romantic comedies from the 2000s that I can watch on Amazon Prime?",
        "Show me a film with a character that sings the song 'Let It Go.'",
        "what year did the film Inception come out?",
        "Is the movie Inception available on any streaming platforms?",
        "Can I watch the director's cut of Blade Runner on any streaming services?",
        "Is the movie Shawshank Redemption available in 4K resolution on any streaming platforms?",
        "Who directed the highest-rated action movie of the year?",
        "Who directed the making of the Avengers: Endgame film and can you show me a behind-the-scenes clip?",
        "Has the movie Toy Story won any awards?",
        "What movie from the 2010s has the most nominations?",
        "Are there any action movies with lots of awards?"
    ],
    "low-logprob": [
        "I miss classic musicals with great songs. Can you suggest one for me?",
        "I'm interested in learning about the history behind the making of the sci-fi movie Blade Runner. Can you provide me with some details about the creative process involved in its production?",
        "What are some highly-rated movies from the 80s that are suitable for family viewing?",
        "Can you show me a movie trailer for the latest horror film directed by Jordan Peele",
        "What are the top-rated action films from the 90s?",
        "Can you provide me with a brief plot synopsis of the movie The Shawshank Redemption?",
        "Could you provide me with the soundtrack of the movie Inception directed by Christopher Nolan?",
        "Can you tell me who directed the making of the movie 'Inception'?",
        "Could you recommend a family-friendly movie with a strong female character as the lead?",
        "Spoken Query: \"What are some popular movies with amazing teasers?\"",
        "can you recommend a film with an iconic soundtrack",
        "Hey, can you tell me if the movie 'The Shawshank Redemption' won any awards?",
        "Can you tell me the plot of the classic film The Sound of Music?",
        "What movie with romance as the genre has a captivating and heartwarming plot?",
        "Show me a film with a compelling plot and strong performances from Meryl Streep.",
        "Hey there! Can you show me a trailer for the new James Bond movie?",
        "Can you tell me the highest-rated animated movies of all time?",
        "Can you tell me about any acclaimed movies in terms of recognition?",
        "Which movie directed by Christopher Nolan has the highest viewers' rating?",
        "Is there a new action movie out this year that's worth watching on any streaming services?",
        "I'm looking for a movie with a captivating plot and the song 'My Heart Will Go On'. Can you suggest one?",
        "Has the movie La La Land won any awards?",
        "Yo, did that movie with Leo DiCaprio win any sick awards or get any nominations?",
        "I'm looking for a movie with a character who performs a memorable musical number. Can you suggest one?",
        "I'm looking for a movie directed by Christopher Nolan with a complex and mind-bending storyline",
        "What is the plot of the movie Inception?",
        "Hey, what's the coolest action movie of all time?",
        "Can you play the trailer for the classic movie Ghostbusters?",
        "Spoken Query: \"I need to find a movie with the best original song from the 80s, can you help?\"",
        "Can you tell me which movie won the most awards in the 1990s?",
        "Can you recommend a coming-of-age movie in the drama genre?",
        "Can you recommend a film with an iconic soundtrack from the 80s?",
        "I need a recommendation for a scary movie, but nothing too intense. Can you suggest something with a supernatural thriller vibe and maybe a strong female lead?",
        "What are the showtimes for the latest Tarantino film?",
        "Tell me about the sci-fi movie Interstellar directed by Christopher Nolan.",
        "I would like to see a teaser for the upcoming Marvel superhero movie, if possible.",
        "I'm in the mood for a classic film. Could you recommend a highly acclaimed black and white movie from the 1950s and share some trivia about the director?",
        "What are some iconic historical films directed by Steven Spielberg that I should watch?",
        "I want to see a critically acclaimed romantic comedy from the 2000s with Hugh Grant in it, can you help me find showtimes?",
        "Who directed the sci-fi thriller film titled Interstellar and what technologies were used in its visual effects?",
        "Who directed the science fiction film from 1997 that received the highest rating from viewers?",
        "I'm looking for a classic film directed by Alfred Hitchcock, with a suspenseful plot and a high viewers' rating.",
        "What is the name of the actor who plays Iron Man in the Marvel movies?",
        "Could you show me a preview for a new release that leaves something to the imagination?",
        "I'm in the mood for a scary movie. Can you recommend a good horror film from the 80s or 90s?",
        "Which theater is playing the latest Marvel movie and what time does it start?",
        "What type of films fall under the crime genre, particularly those involving heists or capers?",
        "Can you tell me the storyline of the latest Marvel movie?",
        "Which director has released a new film with a thrilling plot that I can get a sneak peek of?",
        "What's the latest movie that everyone's talking about?",
        "I'm in the mood for a movie with a great soundtrack. Can you recommend a film with iconic songs from the 80s?",
        "Can you tell me what the latest Liam Neeson movie is about?",
        "Are there any good action movies playing today?",
        "What's the buzz on the new thriller film that just came out?",
        "Do you have tickets available for the re-release of The Lion King?",
        "Do you have any teasers for the upcoming Marvel superhero film?",
        "Is there a teaser for the new animated Disney movie with the song 'Let It Go'?",
        "Who directed the latest fantasy adventure film for kids?",
        "Who are the main actors in the latest sci-fi movie directed by Christopher Nolan?",
        "I heard there's a popular movie with a great soundtrack, is it available to stream anywhere?",
        "Can you provide me with behind-the-scenes footage of the Avengers: Endgame movie",
        "Can you recommend a movie with a great romantic song that came out in the 1980s?",
        "What is the specific subgenre of horror does the movie Hereditary fall under",
        "Who directed the top-rated romantic comedy of the past decade?",
        "I need a movie that will make me cry. Can you find a title with a heartwarming plot and a highly rated director?",
        "I'm looking for a thriller with elements of mystery. Any suggestions?",
        "Can I see the trailer for the new high school musical movie?",
        "Can you recommend a highly-rated action movie from the 2000s?",
        "Can I trust the ratings for the new horror film?",
        "Who directed the movie Inception and who were the main actors?",
        "Hey, what's a really good movie to watch this weekend?",
        "Which movie, directed by Steven Spielberg, has the most nominations for the Academy Awards?",
        "I'm in a rush, so tell me who directed the highest-rated action film of last year",
        "Spoken query: \"Can you recommend a good action movie from the 90s?\"",
        "I'm looking for an action movie from the 2000s with a high viewers' rating. Any suggestions?",
        "can you tell me about a movie with a really interesting storyline",
        "which movie has a famous theme song like 'My Heart Will Go On' by Celine Dion from Titanic?",
        "What nominations did the movie The Shape of Water receive?",
        "I'm interested in learning about the cinematography techniques used in the classic movie The Godfather, could you provide some insights?",
        "Who directed the fantasy film with the best visual effects of all time?",
        "I am looking for a thriller movie directed by David Fincher, could you suggest a title?",
        "Who composed the music for the classic film Casablanca?",
        "Can you play the trailer for the new animated movie featuring talking animals?",
        "I'd like to know about a movie that had a famous director known for their unique approach to filmmaking. Can you tell me more about this film and its behind-the-scenes dynamics?",
        "Can you play the trailer for the latest Marvel movie for me?",
        "I need to know the storyline of the highest-rated horror film of 2021 ASAP",
        "Can you recommend a good movie with a high viewers' rating?",
        "I'm interested in seeing a movie from the thriller genre this weekend. Can you tell me the showtimes for any recent releases?",
        "Can you show me some teaser for a new action movie?",
        "What movie has the best soundtrack of all time?",
        "Can you recommend a movie with high viewers' rating and a thrilling plot for young adults?",
        "I heard there's a new Pixar animated movie out, can you show me a sneak peek or something?",
        "Can you recommend a good action movie from the 90s with Bruce Willis in it?",
        "Who directed the movie Shawshank Redemption?",
        "Show me a classic movie directed by Alfred Hitchcock and share some behind-the-scenes stories about the making of the film.",
        "Can you list the nominations for the movie Inception?",
        "I'm looking for a movie from the 90s that was nominated for multiple Oscars, can you help me find one?",
        "Can I buy tickets for the latest James Bond movie?",
        "Are there any good movies playing at the theater right now?",
        "I'm looking for a film with a legendary actor known for their dedication to perfecting their roles, like in those behind-the-scenes documentaries. Can you recommend one?",
        "Can you show me the trailer for the latest Star Wars movie?",
        "Can you recommend a movie with an epic soundtrack and action-packed scenes?",
        "Can you provide me with the director of the making-of documentary for the movie Inception?",
        "Show me a movie featuring a detailed behind-the-scenes look at the special effects in the Lord of the Rings trilogy.",
        "I'm looking for a feel-good movie with an uplifting song that will brighten my day. Can you suggest one that's family-friendly?",
        "I'm dying to know the synopsis of the upcoming action-packed superhero film. Could you give me some details about the plot, please?",
        "I want to learn more about the special effects in a recent fantasy film.",
        "Could you recommend a movie with a beautiful instrumental soundtrack for relaxation?",
        "What's the highest rated action movie of all time?",
        "What are some of the best musical movies of all time?",
        "Can you tell me about the behind-the-scenes details of the movie Jaws, directed by Steven Spielberg?",
        "I need to watch a comedy movie right now, is 'The Hangover' available on any streaming platform?",
        "What's the latest movie with an amazing original song? I'm in the mood to discover some new music that will blow my mind!",
        "Can you suggest a family-friendly film with a lot of nominations for major awards?",
        "Hey, what's that super scary horror movie with the killer clown that came out in 2017?",
        "I'm lookin' for a movie that's like, action but also crime, you know what I mean?",
        "Can you check out the trailer for that new action flick starring Keanu Reeves?",
        "What's the buzz on the latest action flick?",
        "Are there any old movies with a great love song?",
        "I need a quick rundown of the plot for the latest James Bond film",
        "Can I find tickets for the new James Bond movie?",
        "Show me interviews with the director and cast members of The Dark Knight. I need something to do.",
        "Show me some exclusive interviews with the cast of the movie Titanic.",
        "Can you provide me with the viewers' rating for the film Fargo?",
        "What movie from last year has a fun and exciting preview that kids will love?",
        "Hey, I'm looking for a movie with some crazy action scenes, like, fast and furious style.",
        "Can you recommend a movie with a great soundtrack from the 80s?",
        "Show me a preview of the new Marvel movie directed by Taika Waititi",
        "What action movies with a superhero theme have been popular lately?",
        "I heard there's a documentary about the making of a classic horror film, can you provide more information?",
        "Show me the trailer for the latest Meryl Streep movie",
        "Can you find me a movie with a great soundtrack playing nearby?",
        "I'm in the mood for a movie with an engaging storyline, can you tell me about a film that has a captivating plot?",
        "Hey, is there a dope action movie playing at the theaters this weekend?",
        "Hey, what's the latest comedy that's playing in theaters right now?",
        "Who directed the western movie Tombstone?",
        "What are some must-see films that explore the behind-the-scenes of famous Hollywood blockbusters",
        "What family-friendly movie with a catchy theme song was released in the past year?",
        "Can I find the movie Inception with Leonardo DiCaprio available on any streaming platform?",
        "Hey, can you tell me who directed that awesome sci-fi movie with the killer soundtrack?",
        "Do you know if there are any good action movies playing this weekend?",
        "Show me the trailer for the latest Quentin Tarantino movie.",
        "I'm so pumped to learn about a classic action movie from the 80s with a killer soundtrack. Can you show me a behind-the-scenes clip?",
        "Do you know if there's a trailer out for the upcoming superhero movie?",
        "Can you show me a trailer for the latest action movie directed by Michael Bay?",
        "Who directed that awesome horror movie with a killer clown that scared the pants off everyone?",
        "I'm feeling nostalgic for the 80s - can you play the teaser for the film E.T. the Extra-Terrestrial?",
        "Who directed the movie that reveals the making of the Titanic film",
        "Are there any streaming platforms where I can watch the movie Inception?",
        "I'm interested in seeing a gripping thriller. Could you recommend a movie directed by Alfred Hitchcock?",
        "Who directed the classic film with a stellar performance by Meryl Streep?",
        "I'm interested in a film about the history of visual effects in cinema, what options do you have?",
        "I'm looking for a feel-good movie with a catchy soundtrack. Any suggestions?",
        "Are there any special features or bonus content available for the Blu-ray edition of the film Jurassic Park?",
        "Who directed the movie Gone with the Wind and what's it about?",
        "What's the plot of the new Disney princess movie that came out this year?",
        "I'm looking for a movie with a mysterious and twisty plot. Any suggestions?",
        "Spoken Query: \"Can you tell me about the director of that one movie with lots of action scenes?\"",
        "Can you tell me about the awards and nominations for the animated movie Frozen?",
        "Can you recommend any classic movies with a catchy song in the teaser?",
        "What's a movie from the 90s with a popular love song in its soundtrack?",
        "What is the viewer rating for the latest James Cameron film?",
        "Who directed the making-of documentary for the movie Inception?",
        "Can you give me a brief summary of the plot for the movie Inception?",
        "show me a documentary about the special effects in the Star Wars movies",
        "Spoken Query: \"I'm in a rush to find a movie with a killer soundtrack, any recommendations?\"",
        "Can I stream the movie Arrival on any platform?",
        "Hey, what's the deal with that movie everyone's gossiping about? Is it worth checking out?",
        "can I see the trailer for the latest Marvel movie",
        "I want to watch a drama film from the 90s with a strong female lead and a compelling storyline",
        "Can you tell me about the plot of the movie Blade Runner 2049 directed by Denis Villeneuve?",
        "I'm really looking forward to seeing a new action movie. What are the showtimes for 'Mad Max: Fury Road' in 3D?",
        "Who directed the latest science fiction movie set in space?",
        "I can't wait to learn more about the director's cut of Blade Runner, when will it be released?",
        "Could you provide a summary of the plot for the film Inception directed by Christopher Nolan?",
        "Are there any must-see films with intense action movie trailers?",
        "I'm not sure if the trailer for the new James Bond film truly represents the storyline. Can you provide a summary of the plot?",
        "Can you recommend a highly-rated action movie from the 1990s?",
        "I'm looking for a movie with an amazing soundtrack, particularly one with a popular pop song. Can you suggest one?",
        "I heard great things about the new James Bond movie, can you help me find tickets for it?",
        "Can you recommend a highly-rated mystery movie from the 1980s?",
        "Do you have any trailers for those blockbuster action movies coming out next year?",
        "What kind of movie is The Dark Knight? Like, is it action or thriller or what?",
        "Can you show me the trailer for the new James Bond movie?",
        "Can I really trust that the action movie has good reviews?",
        "Do you have any documentaries about the making of classic Hollywood movies from the 1950s?",
        "Can you tell me what the new Marvel superhero movie is all about?",
        "I'm curious to know which actor has worked on the most iconic romantic films throughout their career.",
        "Yo, who's the mastermind behind that dope action movie from last year with the insane stunts?",
        "Can you recommend a high-rated action movie from the 1990s?",
        "Can you tell me the plot of the movie Frozen?",
        "Are there any theaters playing the new Marvel movie tonight?",
        "Can you recommend a crime movie directed by Quentin Tarantino that has a neo-noir style",
        "What is the most intense horror movie to watch with friends and what was the inspiration behind the set design and overall atmosphere?",
        "What's the highest rated movie of all time?",
        "Which director is known for creating movies in the psychological thriller subgenre?",
        "Could you show me a movie with a great love song in it?",
        "What children's movie from the 90s has a princess as the main character?",
        "Can you tell me the plot of the latest Avengers movie?",
        "Who played the lead in that classic romance film?",
        "Can you tell me about the director and some interesting behind-the-scenes facts of the movie The Notebook?",
        "Yo, where can I stream that new Spider-Man flick?",
        "What's the deal with that new horror movie? Is it really as scary as they say?",
        "Is there any Netflix original movie with Tom Hardy in it?",
        "Who is the director of the top-rated science fiction film of all time?",
        "Can I buy tickets for the new James Bond movie today?",
        "I'm not sure if I want to watch a scary movie trailer or a romantic one, can you help me decide?",
        "I need to see a preview of the new Spider-Man movie right now",
        "I'm looking for a movie with a compelling plot and strong performances, is it possible to find such a film on a streaming platform?",
        "Can you recommend a movie starring Leonardo DiCaprio?",
        "Can you recommend a classic western movie with lots of action?",
        "I'm curious to learn about the creative process behind a classic movie that was quite influential. Can you provide insight into the making of this film?",
        "Can you recommend a heartwarming romance movie from the 90s with a strong female lead",
        "Do you know any recent movies with a score by a female composer?",
        "Hey, who directed that awesome action movie with Tom Hardy and Charlize Theron?",
        "Spoken Query: \"I remember a movie with a catchy song, can you show me a teaser for the film with the song 'My Heart Will Go On'?\"",
        "Can you recommend a good action movie from the 90s?",
        "I want to know the plot of the action film directed by Christopher Nolan and rated PG-13",
        "Which movie has the most exciting teaser of all time?",
        "What's the deal with that movie where the dude from Avengers plays a spy or something?",
        "I heard there's a thrilling new trailer for the upcoming sci-fi film. I cannot wait to watch it!",
        "Show me a movie with Meryl Streep as the lead character.",
        "What's the story behind that Tom Hanks movie where he gets stranded on a desert island?",
        "I need something to watch, is there a comedy movie from the 1990s available to stream?",
        "Show me a trailer for a classic film that was both critically acclaimed and commercially successful.",
        "Can you tell me about the special effects in the latest Avengers movie?",
        "Can you tell me the plot of the movie Sleepless in Seattle from 1993?",
        "What are some highly-rated romantic movies from the 1950s?",
        "Who directed the science fiction movie with a high viewers' rating",
        "I'm looking for a comedy film directed by Christopher Guest, do you have any suggestions?",
        "What awards did the movie The Shape of Water win?",
        "Can you recommend a film about the history and production of Disney animated classics?",
        "I'm interested in watching a science fiction movie with a focus on time travel. Are there any recent ones with good viewer ratings?",
        "Who directed the science fiction film that won best picture in the 90s?",
        "I'm craving a horror movie that will scare the daylights out of me. What's a truly terrifying supernatural thriller worth watching?",
        "I'm looking for a film with a soundtrack filled with classic rock hits, can you suggest one?",
        "Which director is known for creating amazing movie teasers?",
        "I'm so pumped for the upcoming Marvel movie, can you hook me up with a glimpse of the trailer?",
        "Show me a film that delves into the production process of a classic western movie",
        "tell me about the storyline of the matrix trilogy",
        "Can you tell me about the making-of the newest Star Wars movie?",
        "I'm curious about the director behind the scenes of that action-packed film with the intense fight scenes. Can you tell me who directed it?",
        "I'm looking for a film where I can see how they created the magical costumes and props for a fantasy world",
        "What are the showtimes for the latest Marvel movie?",
        "I need to know the deal with the movie Pulp Fiction, can you give me a quick rundown?",
        "I'd like to see the new Marvel superhero movie, can you tell me the showtimes and ticket availability?",
        "Who directed the highest rated movie for young adults in the past 5 years?",
        "What are some classic western movies available for streaming?",
        "I'm looking for a movie with a great soundtrack. Can you recommend a film with a memorable song performed by Whitney Houston?",
        "Can you play the trailer for the newest animated movie for kids?",
        "I'm a big fan of Quentin Tarantino's work. Can you tell me the plot of his latest movie and if there's a trailer available?",
        "Hey, what's the name of that movie with the awesome soundtrack that has a bunch of 80s hits?",
        "Can you play the trailer for the latest James Bond film?",
        "What movie from the 1990s is a must-see action film?",
        "Show me the sneak peek of the upcoming Marvel superhero movie scheduled for release next year.",
        "I heard that the director of The Dark Knight also made a behind-the-scenes documentary. Can you tell me more about it?",
        "Yo, where can I peep the trailer for that new superhero flick with the kickass special effects?",
        "Can you recommend a movie with a director's commentary by a non-binary filmmaker",
        "I heard there's a new thriller movie out. What's the plot and who stars in it?",
        "Spoken Query: \"What family-friendly movies are showing this weekend?\"",
        "What's the highest rated action movie from the 90s? I really need to find something exciting to watch!",
        "What's the deal with that new Tarantino movie, is it any good?",
        "What is the best-rated action movie of the year and when can I see it?",
        "Has the movie The Shawshank Redemption won any awards?",
        "Can I get tickets for the new James Bond movie?",
        "I'm in the mood for a classic musical, preferably from the 1950s or 1960s.",
        "I'm looking for a film from the 90s with a very intense plot. Do you know if it's available on any streaming platforms?",
        "Could you provide me with a review of the latest Quentin Tarantino movie?",
        "What movie has the best trailer of all time?",
        "I'm interested in learning about the making-of process of an iconic 90s film. Do you have any recommendations?",
        "What's that movie where Tom Hanks plays a character stranded on an island?",
        "What year was the movie Inception released, and who directed it?",
        "What's the rating for the latest Marvel movie?",
        "Can you recommend a romantic comedy that's not super cheesy, but still makes you feel all warm and fuzzy inside?",
        "Who directed the movie Titanic and who starred in it? I need to know now!",
        "What are some classic sci-fi films from the 80s directed by Steven Spielberg",
        "Can you show me the trailer for the new romantic comedy directed by Nancy Meyers?",
        "Can you show me the trailer for the film Inception?",
        "Can you recommend a detective movie where the main character is a retired cop hunting down a serial killer",
        "I'm interested in a movie that features an epic soundtrack, preferably in the adventure or fantasy genre. Any suggestions?",
        "Could you give me an overview of the storyline for the movie The Shawshank Redemption?",
        "I'm not sure which movie to watch, can you suggest one with a memorable theme song that's worth listening to?",
        "I'm looking for a critically acclaimed film with the highest number of nominations for Best Picture."
    ],
    "sentences": [
        "What movie features the song 'My Heart Will Go On' by Celine Dion?",
        "Can you tell me about the movie that won the most Oscars in the 1990s?",
        "I remember a classic movie with Humphrey Bogart that received a lot of awards. Can you remind me which one it was?",
        "I'm feeling nostalgic for an iconic film from the 80s that was nominated for multiple Golden Globes. Can you help me remember the title?",
        "Can you tell me which movie won the Best Picture award at the Oscars in 2019? I'm curious to know.",
        "I'm in the mood for a critically acclaimed movie. Can you recommend a film that has won multiple awards, please?",
        "I'm looking for a feel-good movie that has been nominated for a Golden Globe. Any suggestions?",
        "Can you tell me which movie won the Academy Award for Best Picture in 1994?",
        "Show me a film that received multiple nominations at the Golden Globes this year.",
        "I'm looking for a movie that won both the Palme d'Or and the BAFTA Award for Best Film.",
        "I want to watch a film that has great music, do you have any recommendations?",
        "Is there a movie known for its iconic soundtrack?",
        "Spoken Query: \"Can you tell me about any movie that has won a lot of awards?\"",
        "Spoken Query: \"I'm curious, which movie has been recognized for its exceptional performances?\"",
        "Spoken Query: \"Are there any movies that have received critical acclaim and recognition?\"",
        "Can I watch any George Clooney films on Netflix?",
        "Spoken Query: \"Can we watch a fantasy movie suitable for kids this evening?\"",
        "Can I watch the new Disney princess movie on Netflix?",
        "Is there a romantic comedy from the 2000s available on Hulu?",
        "Do you have any recommendations for family-friendly animated films on Amazon Prime?",
        "Can you recommend a movie with a great soundtrack for a girls' night?",
        "Can you tell me a movie that won an Oscar for best picture from the 1970s?",
        "I'm looking for a film that was nominated for a Golden Globe for best actress in a drama.",
        "What movie received the most nominations at the BAFTA awards last year?",
        "Are there any classic movies from the 1950s available on Netflix?",
        "Can I find any western films on Amazon Prime?",
        "Is there a way to watch musicals from the 1960s on Hulu?",
        "I'm interested in watching a critically acclaimed film, ideally one that was nominated for an Oscar. Can you suggest anything?",
        "Can I watch the movie Inception on Netflix?",
        "Are there any highly-rated comedy movies from the 1990s available on Hulu?",
        "Is there a classic Alfred Hitchcock film with a mystery plot that I can stream on Amazon Prime?",
        "Can I watch the movie Interstellar on Netflix?",
        "Is there a comedy film from the 90s available on Hulu?",
        "Do you have any information on The Dark Knight, directed by Christopher Nolan, available on Amazon Prime?",
        "Are there any romantic comedy movies playing tonight where I can get tickets?",
        "Could you provide me with the director's commentary for the film Inception?",
        "Please show me the interviews with the cast and crew of the film Titanic.",
        "Spoken Query: \"Can you tell me about any movies directed by Martin Scorsese that have won an Oscar?\"",
        "Spoken Query: \"Show me a film featuring Meryl Streep that received multiple Golden Globe nominations.\"",
        "Which movie received the most nominations at the Oscars last year?",
        "which movie won the most awards in the year 2020",
        "what film received the most nominations at the Oscars",
        "show me a movie that won the Palme d'Or at the Cannes Film Festival",
        "What's the story behind the movie Die Hard?",
        "Can you tell me which movie won the most awards this year?",
        "I'm looking for a movie with the most nominations for prestigious awards",
        "Show me a film with an actor or actress who has won multiple Academy Awards",
        "Which movie won the most Academy Awards in 2020?",
        "Can you tell me the list of films nominated for Best Picture in 2015?",
        "What movie received the most nominations at the Golden Globes last year?",
        "Can you tell me if the movie Frozen won any awards?",
        "What movie from 2019 got the most nominations?",
        "I want to watch a movie with a strong female lead who has won a lot of awards, can you recommend one?",
        "what movie is currently showing with a soundtrack by Hans Zimmer?",
        "Can you tell me which movie won the most awards at the Oscars last year?",
        "I'm looking for a movie that was nominated for both Best Picture and Best Director at the Golden Globes",
        "Show me a film with a Golden Bear award from the Berlin International Film Festival",
        "I am looking for a comedy film that falls under the dark comedy subgenre and involves a heist",
        "I want to watch a science fiction movie set in a dystopian future with artificial intelligence as the main theme",
        "can I watch the movie Inception on Netflix?",
        "is there a trailer available for the new Mission: Impossible movie on Amazon Prime Video?",
        "what are the top-rated horror movies on Hulu?",
        "Spoken Query: \"Are there any movies that received multiple awards despite mixed reviews?\"",
        "Spoken Query: \"Can you really trust the award nominations for the new romantic comedy film?\"",
        "Spoken Query: \"Is it true that the sci-fi movie won best picture at the Oscars despite its low viewers' rating?\"",
        "What time is the next showing for Jurassic Park?",
        "I'm looking for a classic movie with Humphrey Bogart, preferably on a streaming service. Any recommendations?",
        "Tell me the movie that won the most Oscars in the 90s",
        "I need to know which film was nominated for Best Picture, hurry up",
        "What movie was the winner of the Cannes Film Festival in the past 5 years",
        "What movie won the most awards in 2020",
        "Has any movie with Meryl Streep won an Oscar",
        "Which film received the most nominations in the comedy genre",
        "Is the movie Frozen available on Netflix for kids to watch?",
        "Are there any romantic movies from the 90s on Disney+?",
        "Can I find any animated films on Amazon Prime with strong female characters?",
        "Which movie received the most awards last year?",
        "Can you recommend a movie directed by a woman that has won multiple awards?",
        "can I watch any good classic romance movies on Netflix tonight",
        "are there any comedy movies from the 2000s available on Amazon Prime",
        "show me some action-packed films with strong female leads that I can stream on Hulu",
        "What movie won the most Oscars in 1997",
        "Has Clint Eastwood's directed films ever received Golden Globe nominations",
        "Can you tell me about the movie with the most Bafta nominations in the 1980s",
        "Show me a children's movie with a high viewers' rating and multiple nominations for best animated feature",
        "Are there any comedy movies from the 1990s available on Netflix?",
        "Could you recommend a movie with a strong female lead that's on Hulu?",
        "Is there a romantic drama film on Amazon Prime Video directed by Ang Lee?",
        "Spoken Query: \"Are there any movies that have won an Oscar for Best Picture?\"",
        "Spoken Query: \"Which film has received the most nominations at the Golden Globe Awards?\"",
        "Spoken Query: \"Can you recommend a movie that has won multiple BAFTA awards?\"",
        "Can you tell me if the movie Inception is available on Netflix, and if so, could you show me a trailer of it?",
        "I'm looking for a highly-rated horror movie from the 1980s with a catchy soundtrack. Can you recommend one available on Amazon Prime?",
        "I want to watch a classic black and white film featuring Audrey Hepburn. Could you find me one with a high viewers' rating that's currently on Hulu?",
        "Can you recommend a film in the horror genre that falls under the supernatural subgenre",
        "I'm looking for a science fiction movie with cyberpunk elements, can you suggest one",
        "What are some of the top action movies with martial arts as the main subgenre",
        "Hey, what's a cool action movie on Netflix with lots of explosions?",
        "Can I watch a scary movie on Disney+ with zombies and stuff like that?",
        "I want to see a really funny movie on Amazon Prime, maybe with superheroes or something.",
        "Show me a movie directed by Greta Gerwig that has won an Oscar.",
        "Can I see the schedule for the romantic comedy movies playing this weekend?",
        "which movie won the most Academy Awards in 2020",
        "show me a movie directed by Christopher Nolan that was nominated for a Golden Globe",
        "What movies directed by Christopher Nolan are available on Netflix?",
        "Find me a movie with a high IMDb rating that I can watch on Amazon Prime",
        "Show me a film starring Meryl Streep that I can stream on Hulu",
        "what is the highest rated movie of 2020 and can I watch it on Netflix",
        "show me a list of comedy movies directed by Christopher Guest that I can stream",
        "Is there a movie playing tonight that has a great soundtrack?",
        "I need to watch a movie with Chris Hemsworth on Netflix right now.",
        "Is there any good action movie with a high IMDb rating that I can stream on Amazon Prime?",
        "I'm desperately in need of a comedy film to watch on Hulu. Can you recommend something with a high Rotten Tomatoes score?",
        "What movie won the Best Picture award at the Oscars in 2019?",
        "Has Steven Spielberg directed any films that have won multiple Academy Awards?",
        "Show me a movie that was nominated for both Best Actor and Best Actress at the Golden Globes.",
        "Is the movie The Matrix available for streaming?",
        "Can I watch any action movies starring Will Smith on any streaming service?",
        "Are there any recent romantic comedies directed by Nancy Meyers that I can stream?",
        "Can you tell me about the movie that won the most awards in 2020",
        "Which movie with a female lead was nominated for the most prestigious award last year",
        "Is there a film that has won multiple awards and is considered a classic?",
        "Show me a film from the 2000s that won the Palme d'Or at Cannes Film Festival",
        "Can I buy tickets for the movie Casablanca at 7pm tonight?",
        "Do you have any information on the movie Inception's showtimes this weekend?",
        "Have any James Bond movies won an Academy Award?",
        "Can I watch any Cary Grant movies on Netflix that are considered classic comedies?",
        "Show me a list of movies from the 1960s that feature the song 'My Girl' by The Temptations and are available on Amazon Prime.",
        "What are some action movies directed by Steven Spielberg that I can stream online?",
        "Spoken Query: \"Can I watch The Shawshank Redemption on Netflix?\"",
        "Spoken Query: \"Does the movie Inception have a high viewers' rating and is it available on Amazon Prime?\"",
        "Spoken Query: \"Is the director Christopher Nolan known for any science fiction films that are currently on Hulu?\"",
        "What is the title of the movie where Leonardo DiCaprio starred alongside Kate Winslet and had a theme song that won an Oscar?",
        "Can you tell me which movie won the most awards at the Oscars this year?",
        "I'm curious to know if the film 'The Shawshank Redemption' has received any prestigious nominations.",
        "I'm feeling hopeful that the movie 'La La Land' has won some major accolades. Can you share that with me?",
        "Which streaming platform offers the movie 'Inception' directed by Christopher Nolan and released in 2010?",
        "Can I watch the film 'Pulp Fiction' with an R rating on any streaming platform?",
        "I heard that there's a movie with a lot of awards, can you tell me which one it is?",
        "I'm looking for a film that received great recognition from the critics, can you help me find it?",
        "I'm curious about a certain movie that got a lot of nominations, do you have any idea which one I'm thinking of?",
        "Can I watch The Shawshank Redemption on Netflix?",
        "I want to see a Quentin Tarantino film with a gritty plot. Is Pulp Fiction available on Amazon Prime?",
        "Any idea what movies are playing at the theater down the street?",
        "which movie won the most Oscars in 2021",
        "can you tell me if the movie Inception received any Golden Globe nominations",
        "show me a film that won the Palme d'Or at the Cannes Film Festival",
        "Are there any action movies playing in theaters tonight?",
        "Can you recommend a popular comedy from the 90s currently showing in my area?",
        "Is there a theater nearby playing a recent thriller film that has received positive reviews?",
        "Can you recommend a good horror movie with a strong focus on psychological suspense?",
        "Do you have any action-adventure movies set in a post-apocalyptic world that feature a strong female lead?",
        "Is there a movie with a soundtrack by Hans Zimmer available to watch?",
        "Is there a streaming service where I can watch the film The Godfather?",
        "What's the scoop on the new Christopher Nolan movie? Any insider details about the cast and crew?",
        "What movie from the 1990s with a high viewers' rating has won multiple Oscars?",
        "Can you tell me which film won the Best Picture award in 2019 at the Oscars?",
        "Has any movie from the 1990s been nominated for the Palme d'Or at the Cannes Film Festival?",
        "I'm looking for a movie directed by Quentin Tarantino that received multiple Oscar nominations.",
        "Can you tell me about any movies that have won big awards?",
        "I'm curious about any highly acclaimed films, could you share some with me?",
        "Do you know any movies that have been nominated for prestigious awards recently?",
        "Can you provide me with a list of films with scores composed by Hans Zimmer?",
        "Spoken Query: \"Can you recommend a comedy film that is categorized as a romantic comedy and revolves around a workplace romance?\"",
        "Can you tell me which movie won the Oscar for Best Picture in 2020?",
        "I am looking for a film that was nominated for the Palme d'Or at the Cannes Film Festival in the past five years.",
        "Please find me a movie directed by a filmmaker who has won the Golden Globe for Best Director.",
        "Did that movie with Tom Hanks win any awards?",
        "Have any of the recent animated movies been nominated for anything?",
        "I heard that the movie directed by Christopher Nolan got some awards, is that true?",
        "Which movie from the 90s can I watch with my family on a streaming service?",
        "I'm bored, can you tell me which movie won the most Oscars?",
        "I need something to watch, what movie received the most nominations at the Golden Globes?",
        "I'm looking for a highly acclaimed film, can you recommend a movie that won Best Picture at the Academy Awards?",
        "Did the movie 'The Godfather' really win three Academy Awards?",
        "I heard 'Schindler's List' was nominated for seven BAFTA Awards, is that true?",
        "Can you confirm if 'Titanic' actually won 11 Oscars?",
        "Which director has won the most Academy Awards?",
        "What film received the most nominations for the Oscars this year?",
        "Can I watch the movie Inception on Netflix right now?",
        "Is there a way to stream the film Avatar online?",
        "Can you recommend any horror movies with a strong psychological thriller plot?",
        "Do you know any famous movies featuring a legendary song by Queen?",
        "I'm trying to find a movie with a memorable musical score, can you show me one with a captivating soundtrack?",
        "Who were the main actors in the making of the classic film Psycho?",
        "Yo, can I stream a movie with Keanu Reeves on Netflix?",
        "Hey, is there a movie with some dope fight scenes available on Hulu?",
        "I'm not sure if this movie won any awards, but did the film Inception receive any nominations?",
        "I'm not entirely certain, but I heard that the actor Leonardo DiCaprio was outstanding in the movie Titanic. Did he win any awards for his performance?",
        "I'm not 100% sure, but I think the film La La Land was highly praised. Can you tell me if it received any awards or nominations?",
        "hey, can I watch the movie Titanic on Netflix?",
        "is there a movie from the 90s with a killer soundtrack available on Amazon Prime?",
        "show me a thriller directed by Alfred Hitchcock that I can stream on Hulu",
        "Can you recommend a comedy movie with a romantic subgenre?",
        "I'm looking for a thriller film with a mystery subgenre that will keep me on the edge of my seat. Can you suggest one?",
        "I want to watch a sci-fi movie that has a dystopian subgenre. Can you help me find one?",
        "Has the film Gladiator won any awards?",
        "What movie from the 1960s was nominated for the most Oscars?",
        "Did Steven Spielberg direct any movies that won a Golden Globe?",
        "Which movie won the most Oscars in 2020",
        "Did any films directed by Christopher Nolan receive Golden Globe nominations",
        "What movie was nominated for the Cannes Film Festival Palm d'Or in 2019",
        "Show me a romantic comedy movie available for streaming with Julia Roberts in it",
        "Can you tell me which movie won the most Academy Awards in 2020?",
        "I'm interested in knowing if the film 'The Godfather' received any nominations for the Golden Globe Awards?",
        "I'd like to watch a classic movie that won the Palme d'Or at the Cannes Film Festival. Can you recommend one?",
        "Spoken query: \"Has the movie Interstellar won any major awards?\"",
        "Spoken query: \"Is there a movie with Leonardo DiCaprio that won multiple Oscars?\"",
        "Spoken query: \"What war film from the 2000s has received the most nominations?\"",
        "Which movie won the most awards in 2020?",
        "I need to know the Oscars nominations for the best animated film this year, hurry up!",
        "Tell me quickly, what film received the most nominations for the Golden Globes in the drama category?",
        "Can you tell me about any highly acclaimed movies from the 1980s?",
        "What film received the most nominations at the Oscars last year?",
        "What's a good horror movie I can watch on Hulu?",
        "Can I stream a romantic comedy movie from the 1980s that is available on Netflix?",
        "Is there a good mystery thriller film on Amazon Prime that was released in the 2000s?",
        "I'm looking for a classic drama movie on Hulu. Can you recommend one from the 1960s?",
        "Which movie from the 1990s won the most awards?",
        "I heard that the director of Parasite won several awards, can you provide more information?",
        "Can you recommend a horror movie that is also a psychological thriller?",
        "Show me a musical movie with a romantic comedy subplot.",
        "What's the name of the film that won the Academy Award for Best Picture in the 1960s, and can you share any trivia about the filming process?",
        "Can I find a movie from the 1960s that is available on Netflix and has a high rating?",
        "Which director made an action film that is on Amazon Prime, and can you show me the trailer?",
        "I'm craving a classic romance movie that I can watch on Hulu, can you recommend one with a popular actor?",
        "What movies are playing on Friday at the downtown cinema?",
        "Are there any romantic comedies showing this weekend at the theaters near me?",
        "Can I watch a Steven Spielberg directed movie on any streaming platform?",
        "Is there a popular action movie from the 1990s that I can find on a streaming platform?",
        "What is a good romantic comedy movie to watch this weekend?",
        "can I find the movie The Godfather on Netflix",
        "show me a movie with Clint Eastwood from the 1970s on Amazon Prime",
        "I'm looking for a classic black and white film with Humphrey Bogart on Hulu",
        "Is the movie Inception available to stream anywhere?",
        "I need to find a platform to stream the new James Bond film, No Time to Die, quickly.",
        "I'm in the mood for an action movie with intense fight scenes, preferably something with martial arts or superhero elements.",
        "Is there a highly-rated comedy movie from 2010 available on Netflix or Hulu?",
        "I want to watch a thriller directed by David Fincher, with a rating of at least 4 stars, on Amazon Prime or HBO Max",
        "Show me a classic movie from the 1950s with Audrey Hepburn, available on Disney+ or Apple TV+",
        "I'm interested in the cinematographer for the behind-the-scenes footage of the film Avatar, can you assist me with that?",
        "Which production company was responsible for creating the behind-the-scenes featurette for the movie Gravity?",
        "Which film won the most Oscars in 2020?",
        "Can you recommend a movie that received both Golden Globe and BAFTA nominations?",
        "I'm looking for a film that was both a box office success and won several prestigious awards. Any suggestions?",
        "I'm interested in movies that have been nominated for both Best Picture and Best Director at the Golden Globes. Can you recommend any?",
        "I heard that there's a movie that received a lot of nominations at the BAFTA Awards. Can you tell me which one it is?",
        "Hey, can I watch a movie like The Dark Knight on Netflix tonight?",
        "Show me a good action movie from the 90s, preferably on Hulu.",
        "Do you know where I can find a classic film like Casablanca on any streaming service?",
        "What are the showtimes for any action movie playing tonight?",
        "Can I buy tickets for a well-reviewed comedy film for this weekend?",
        "Do you have any information on dramatic movies showing near me?",
        "Has the movie La La Land won any awards?",
        "Can you tell me about the movie Titanic's nominations?",
        "What awards has the director Christopher Nolan received for his movies?",
        "Do you have any tickets available for a comedy film this weekend?",
        "Has the movie Titanic won any awards?",
        "What movie directed by Martin Scorsese has received the most nominations?",
        "Show me a film with Tom Hanks that has won an Oscar.",
        "Can I watch a classic western movie on Netflix?",
        "I want to watch a suspenseful movie from the 1950s, is there anything available on Amazon Prime?",
        "Are there any action movies on Hulu with a high viewers' rating?",
        "What are the top-rated horror films currently showing and where can I buy tickets?",
        "Is there a documentary about the making of the movie Parasite?",
        "Who directed the making-of documentary for the movie Inception?",
        "Hey, did that movie with the amazing soundtrack and great plot win any awards?",
        "Have you seen that movie with the incredible visual effects and awesome fight scenes? Did it get any nominations?",
        "I'm curious, did the movie with the mind-blowing twist ending and intense storyline win any awards?",
        "What movies are playing near me right now?",
        "Is there a new action movie out this week?",
        "Who directed the sci-fi movie The Matrix and when did it come out?",
        "Can you give me a quick overview of the plot for the latest action thriller film?",
        "Can you give me a quick summary of the plot for the movie Inception?",
        "Can you give me a brief summary of the plot for the movie Inception?",
        "Who directed the classic movie Gone with the Wind and can you show me a trailer for it?",
        "Can you show me a teaser for any new animated movies?",
        "Could you show me a documentary about the making of the movie Inception?",
        "Who directed the movie 'The Princess Diaries' and what is its viewers' rating?",
        "Can you please hurry up and show me a behind-the-scenes look at the making of the new Spider-Man movie?",
        "Can you show me a behind-the-scenes look at the making of the movie Inception?",
        "Can you tell me what Turbo Kid is about?",
        "I want to know the story of How to Train Your Dragon. Can you tell me?",
        "Spoken Query: \"Who directed the film The Godfather and what year was it released?\"",
        "What's the story behind the making of the movie Apocalypse Now, directed by Francis Ford Coppola?",
        "Hey, I heard there's a new documentary about the making of The Godfather, can you tell me more about it?",
        "Who directed the iconic 1994 film Forrest Gump?",
        "What movie is currently playing in theaters near me",
        "Can you give me a brief overview of the plot for the movie Inception",
        "Is the movie 'The Shawshank Redemption' available for streaming on any platform?",
        "Who directed the making of the Avengers: Endgame and what were the major challenges they faced during the production process?",
        "who's the director of that popular movie with action and drama",
        "Who directed the action movie that came out in 1999?",
        "Hey, can you tell me who directed The Avengers and whether there's a documentary about the making of the film?",
        "Has the movie Black Panther received any awards or nominations?",
        "I want to explore some classic film noirs, do you have any recommendations?",
        "Where can I find a teaser for the upcoming Marvel movie with Scarlett Johansson as the lead?",
        "I'm not sure if it's worth watching, but did the film The Social Network win any awards?",
        "I'm not really a fan of musicals, but did La La Land receive any nominations?",
        "I'm not sure if it's relevant, but has the director of The Shape of Water, Guillermo del Toro, won any awards?",
        "What awards did the movie The Shawshank Redemption win?",
        "Who was the director of the movie Titanic, and what awards did it receive?",
        "Is the movie Inception available for streaming?",
        "Can you give me a brief summary of the plot of the movie Inception?",
        "Where can I watch the latest Spider-Man movie online?",
        "Can you give me a brief summary of the plot for the movie Inception",
        "Can you give me a brief overview of the plot for the movie Inception?",
        "I'm hesitant about the reviews for the superhero movie Avengers: Endgame. Can you share a brief synopsis of the plot to help me decide if it's worth watching?",
        "I need to know who directed the movie Interstellar, and also who are the main actors and the genre of the film. I am in a rush!",
        "I'm interested in learning about the making of the Titanic movie, can you show me any interviews with the director or cast members?",
        "I'm curious to know if the director of The Dark Knight has won any prestigious awards.",
        "Who directed the movie Inception?",
        "What's the genre of the movie The Matrix?",
        "Who directed the top horror movie of the 90s?",
        "Can you recommend a good comedy playing at the theater?",
        "Can you tell me who directed the making-of documentary for The Avengers film?",
        "What awards did the movie La La Land win? Hurry up, I don't have all day.",
        "Which director's films have won the most Oscars? I need an answer now.",
        "Can you tell me the top-rated movie of all time? Chop chop, I'm in a hurry.",
        "Can you provide me with a review of the film Inception directed by Christopher Nolan?",
        "Show me a trailer for the movie Titanic, directed by James Cameron.",
        "Which director has the most number of Oscar-winning movies?",
        "What movie directed by Brad Bird has won the most awards?",
        "Can you tell me who directed the movie that won the most Oscars in 2020?",
        "is the movie Forrest Gump available on any streaming platforms",
        "Who directed the film 'The Godfather' and what is the viewers' rating for it?",
        "Do you have any information about the latest movie directed by Christopher Nolan and its plot?",
        "Can I watch a movie with Humphrey Bogart on any streaming platforms?",
        "Is there a classic musical film available to watch on streaming platforms?",
        "Show me a romantic comedy movie from the 1950s that I can watch online",
        "Who directed the 1994 film The Shawshank Redemption and what is the viewers' rating for it?",
        "Which actor starred in a science fiction movie with the highest viewers' rating",
        "Can I watch the movie 'Frozen' on any streaming platforms?",
        "What kind of movies does Taylor Swift star in, and are they available on Netflix?",
        "Are there any romantic comedies from the 2000s that I can watch on Amazon Prime?",
        "Show me a film with a character that sings the song 'Let It Go.'",
        "what year did the film Inception come out?",
        "Is the movie Inception available on any streaming platforms?",
        "Can I watch the director's cut of Blade Runner on any streaming services?",
        "Is the movie Shawshank Redemption available in 4K resolution on any streaming platforms?",
        "Who directed the highest-rated action movie of the year?",
        "Who directed the making of the Avengers: Endgame film and can you show me a behind-the-scenes clip?",
        "Has the movie Toy Story won any awards?",
        "What movie from the 2010s has the most nominations?",
        "Are there any action movies with lots of awards?",
        "I miss classic musicals with great songs. Can you suggest one for me?",
        "I'm interested in learning about the history behind the making of the sci-fi movie Blade Runner. Can you provide me with some details about the creative process involved in its production?",
        "What are some highly-rated movies from the 80s that are suitable for family viewing?",
        "Can you show me a movie trailer for the latest horror film directed by Jordan Peele",
        "What are the top-rated action films from the 90s?",
        "Can you provide me with a brief plot synopsis of the movie The Shawshank Redemption?",
        "Could you provide me with the soundtrack of the movie Inception directed by Christopher Nolan?",
        "Can you tell me who directed the making of the movie 'Inception'?",
        "Could you recommend a family-friendly movie with a strong female character as the lead?",
        "Spoken Query: \"What are some popular movies with amazing teasers?\"",
        "can you recommend a film with an iconic soundtrack",
        "Hey, can you tell me if the movie 'The Shawshank Redemption' won any awards?",
        "Can you tell me the plot of the classic film The Sound of Music?",
        "What movie with romance as the genre has a captivating and heartwarming plot?",
        "Show me a film with a compelling plot and strong performances from Meryl Streep.",
        "Hey there! Can you show me a trailer for the new James Bond movie?",
        "Can you tell me the highest-rated animated movies of all time?",
        "Can you tell me about any acclaimed movies in terms of recognition?",
        "Which movie directed by Christopher Nolan has the highest viewers' rating?",
        "Is there a new action movie out this year that's worth watching on any streaming services?",
        "I'm looking for a movie with a captivating plot and the song 'My Heart Will Go On'. Can you suggest one?",
        "Yo, did that movie with Leo DiCaprio win any sick awards or get any nominations?",
        "I'm looking for a movie with a character who performs a memorable musical number. Can you suggest one?",
        "I'm looking for a movie directed by Christopher Nolan with a complex and mind-bending storyline",
        "What is the plot of the movie Inception?",
        "Hey, what's the coolest action movie of all time?",
        "Can you play the trailer for the classic movie Ghostbusters?",
        "Spoken Query: \"I need to find a movie with the best original song from the 80s, can you help?\"",
        "Can you tell me which movie won the most awards in the 1990s?",
        "Can you recommend a coming-of-age movie in the drama genre?",
        "Can you recommend a film with an iconic soundtrack from the 80s?",
        "I need a recommendation for a scary movie, but nothing too intense. Can you suggest something with a supernatural thriller vibe and maybe a strong female lead?",
        "What are the showtimes for the latest Tarantino film?",
        "Tell me about the sci-fi movie Interstellar directed by Christopher Nolan.",
        "I would like to see a teaser for the upcoming Marvel superhero movie, if possible.",
        "I'm in the mood for a classic film. Could you recommend a highly acclaimed black and white movie from the 1950s and share some trivia about the director?",
        "What are some iconic historical films directed by Steven Spielberg that I should watch?",
        "I want to see a critically acclaimed romantic comedy from the 2000s with Hugh Grant in it, can you help me find showtimes?",
        "Who directed the sci-fi thriller film titled Interstellar and what technologies were used in its visual effects?",
        "Who directed the science fiction film from 1997 that received the highest rating from viewers?",
        "I'm looking for a classic film directed by Alfred Hitchcock, with a suspenseful plot and a high viewers' rating.",
        "What is the name of the actor who plays Iron Man in the Marvel movies?",
        "Could you show me a preview for a new release that leaves something to the imagination?",
        "I'm in the mood for a scary movie. Can you recommend a good horror film from the 80s or 90s?",
        "Which theater is playing the latest Marvel movie and what time does it start?",
        "What type of films fall under the crime genre, particularly those involving heists or capers?",
        "Can you tell me the storyline of the latest Marvel movie?",
        "Which director has released a new film with a thrilling plot that I can get a sneak peek of?",
        "What's the latest movie that everyone's talking about?",
        "I'm in the mood for a movie with a great soundtrack. Can you recommend a film with iconic songs from the 80s?",
        "Can you tell me what the latest Liam Neeson movie is about?",
        "Are there any good action movies playing today?",
        "What's the buzz on the new thriller film that just came out?",
        "Do you have tickets available for the re-release of The Lion King?",
        "Do you have any teasers for the upcoming Marvel superhero film?",
        "Is there a teaser for the new animated Disney movie with the song 'Let It Go'?",
        "Who directed the latest fantasy adventure film for kids?",
        "Who are the main actors in the latest sci-fi movie directed by Christopher Nolan?",
        "I heard there's a popular movie with a great soundtrack, is it available to stream anywhere?",
        "Can you provide me with behind-the-scenes footage of the Avengers: Endgame movie",
        "Can you recommend a movie with a great romantic song that came out in the 1980s?",
        "What is the specific subgenre of horror does the movie Hereditary fall under",
        "Who directed the top-rated romantic comedy of the past decade?",
        "I need a movie that will make me cry. Can you find a title with a heartwarming plot and a highly rated director?",
        "I'm looking for a thriller with elements of mystery. Any suggestions?",
        "Can I see the trailer for the new high school musical movie?",
        "Can you recommend a highly-rated action movie from the 2000s?",
        "Can I trust the ratings for the new horror film?",
        "Who directed the movie Inception and who were the main actors?",
        "Hey, what's a really good movie to watch this weekend?",
        "Which movie, directed by Steven Spielberg, has the most nominations for the Academy Awards?",
        "I'm in a rush, so tell me who directed the highest-rated action film of last year",
        "Spoken query: \"Can you recommend a good action movie from the 90s?\"",
        "I'm looking for an action movie from the 2000s with a high viewers' rating. Any suggestions?",
        "can you tell me about a movie with a really interesting storyline",
        "which movie has a famous theme song like 'My Heart Will Go On' by Celine Dion from Titanic?",
        "What nominations did the movie The Shape of Water receive?",
        "I'm interested in learning about the cinematography techniques used in the classic movie The Godfather, could you provide some insights?",
        "Who directed the fantasy film with the best visual effects of all time?",
        "I am looking for a thriller movie directed by David Fincher, could you suggest a title?",
        "Who composed the music for the classic film Casablanca?",
        "Can you play the trailer for the new animated movie featuring talking animals?",
        "I'd like to know about a movie that had a famous director known for their unique approach to filmmaking. Can you tell me more about this film and its behind-the-scenes dynamics?",
        "Can you play the trailer for the latest Marvel movie for me?",
        "I need to know the storyline of the highest-rated horror film of 2021 ASAP",
        "Can you recommend a good movie with a high viewers' rating?",
        "I'm interested in seeing a movie from the thriller genre this weekend. Can you tell me the showtimes for any recent releases?",
        "Can you show me some teaser for a new action movie?",
        "What movie has the best soundtrack of all time?",
        "Can you recommend a movie with high viewers' rating and a thrilling plot for young adults?",
        "I heard there's a new Pixar animated movie out, can you show me a sneak peek or something?",
        "Can you recommend a good action movie from the 90s with Bruce Willis in it?",
        "Who directed the movie Shawshank Redemption?",
        "Show me a classic movie directed by Alfred Hitchcock and share some behind-the-scenes stories about the making of the film.",
        "Can you list the nominations for the movie Inception?",
        "I'm looking for a movie from the 90s that was nominated for multiple Oscars, can you help me find one?",
        "Can I buy tickets for the latest James Bond movie?",
        "Are there any good movies playing at the theater right now?",
        "I'm looking for a film with a legendary actor known for their dedication to perfecting their roles, like in those behind-the-scenes documentaries. Can you recommend one?",
        "Can you show me the trailer for the latest Star Wars movie?",
        "Can you recommend a movie with an epic soundtrack and action-packed scenes?",
        "Can you provide me with the director of the making-of documentary for the movie Inception?",
        "Show me a movie featuring a detailed behind-the-scenes look at the special effects in the Lord of the Rings trilogy.",
        "I'm looking for a feel-good movie with an uplifting song that will brighten my day. Can you suggest one that's family-friendly?",
        "I'm dying to know the synopsis of the upcoming action-packed superhero film. Could you give me some details about the plot, please?",
        "I want to learn more about the special effects in a recent fantasy film.",
        "Could you recommend a movie with a beautiful instrumental soundtrack for relaxation?",
        "What's the highest rated action movie of all time?",
        "What are some of the best musical movies of all time?",
        "Can you tell me about the behind-the-scenes details of the movie Jaws, directed by Steven Spielberg?",
        "I need to watch a comedy movie right now, is 'The Hangover' available on any streaming platform?",
        "What's the latest movie with an amazing original song? I'm in the mood to discover some new music that will blow my mind!",
        "Can you suggest a family-friendly film with a lot of nominations for major awards?",
        "Hey, what's that super scary horror movie with the killer clown that came out in 2017?",
        "I'm lookin' for a movie that's like, action but also crime, you know what I mean?",
        "Can you check out the trailer for that new action flick starring Keanu Reeves?",
        "What's the buzz on the latest action flick?",
        "Are there any old movies with a great love song?",
        "I need a quick rundown of the plot for the latest James Bond film",
        "Can I find tickets for the new James Bond movie?",
        "Show me interviews with the director and cast members of The Dark Knight. I need something to do.",
        "Show me some exclusive interviews with the cast of the movie Titanic.",
        "Can you provide me with the viewers' rating for the film Fargo?",
        "What movie from last year has a fun and exciting preview that kids will love?",
        "Hey, I'm looking for a movie with some crazy action scenes, like, fast and furious style.",
        "Can you recommend a movie with a great soundtrack from the 80s?",
        "Show me a preview of the new Marvel movie directed by Taika Waititi",
        "What action movies with a superhero theme have been popular lately?",
        "I heard there's a documentary about the making of a classic horror film, can you provide more information?",
        "Show me the trailer for the latest Meryl Streep movie",
        "Can you find me a movie with a great soundtrack playing nearby?",
        "I'm in the mood for a movie with an engaging storyline, can you tell me about a film that has a captivating plot?",
        "Hey, is there a dope action movie playing at the theaters this weekend?",
        "Hey, what's the latest comedy that's playing in theaters right now?",
        "Who directed the western movie Tombstone?",
        "What are some must-see films that explore the behind-the-scenes of famous Hollywood blockbusters",
        "What family-friendly movie with a catchy theme song was released in the past year?",
        "Can I find the movie Inception with Leonardo DiCaprio available on any streaming platform?",
        "Hey, can you tell me who directed that awesome sci-fi movie with the killer soundtrack?",
        "Do you know if there are any good action movies playing this weekend?",
        "Show me the trailer for the latest Quentin Tarantino movie.",
        "I'm so pumped to learn about a classic action movie from the 80s with a killer soundtrack. Can you show me a behind-the-scenes clip?",
        "Do you know if there's a trailer out for the upcoming superhero movie?",
        "Can you show me a trailer for the latest action movie directed by Michael Bay?",
        "Who directed that awesome horror movie with a killer clown that scared the pants off everyone?",
        "I'm feeling nostalgic for the 80s - can you play the teaser for the film E.T. the Extra-Terrestrial?",
        "Who directed the movie that reveals the making of the Titanic film",
        "Are there any streaming platforms where I can watch the movie Inception?",
        "I'm interested in seeing a gripping thriller. Could you recommend a movie directed by Alfred Hitchcock?",
        "Who directed the classic film with a stellar performance by Meryl Streep?",
        "I'm interested in a film about the history of visual effects in cinema, what options do you have?",
        "I'm looking for a feel-good movie with a catchy soundtrack. Any suggestions?",
        "Are there any special features or bonus content available for the Blu-ray edition of the film Jurassic Park?",
        "Who directed the movie Gone with the Wind and what's it about?",
        "What's the plot of the new Disney princess movie that came out this year?",
        "I'm looking for a movie with a mysterious and twisty plot. Any suggestions?",
        "Spoken Query: \"Can you tell me about the director of that one movie with lots of action scenes?\"",
        "Can you tell me about the awards and nominations for the animated movie Frozen?",
        "Can you recommend any classic movies with a catchy song in the teaser?",
        "What's a movie from the 90s with a popular love song in its soundtrack?",
        "What is the viewer rating for the latest James Cameron film?",
        "show me a documentary about the special effects in the Star Wars movies",
        "Spoken Query: \"I'm in a rush to find a movie with a killer soundtrack, any recommendations?\"",
        "Can I stream the movie Arrival on any platform?",
        "Hey, what's the deal with that movie everyone's gossiping about? Is it worth checking out?",
        "can I see the trailer for the latest Marvel movie",
        "I want to watch a drama film from the 90s with a strong female lead and a compelling storyline",
        "Can you tell me about the plot of the movie Blade Runner 2049 directed by Denis Villeneuve?",
        "I'm really looking forward to seeing a new action movie. What are the showtimes for 'Mad Max: Fury Road' in 3D?",
        "Who directed the latest science fiction movie set in space?",
        "I can't wait to learn more about the director's cut of Blade Runner, when will it be released?",
        "Could you provide a summary of the plot for the film Inception directed by Christopher Nolan?",
        "Are there any must-see films with intense action movie trailers?",
        "I'm not sure if the trailer for the new James Bond film truly represents the storyline. Can you provide a summary of the plot?",
        "Can you recommend a highly-rated action movie from the 1990s?",
        "I'm looking for a movie with an amazing soundtrack, particularly one with a popular pop song. Can you suggest one?",
        "I heard great things about the new James Bond movie, can you help me find tickets for it?",
        "Can you recommend a highly-rated mystery movie from the 1980s?",
        "Do you have any trailers for those blockbuster action movies coming out next year?",
        "What kind of movie is The Dark Knight? Like, is it action or thriller or what?",
        "Can you show me the trailer for the new James Bond movie?",
        "Can I really trust that the action movie has good reviews?",
        "Do you have any documentaries about the making of classic Hollywood movies from the 1950s?",
        "Can you tell me what the new Marvel superhero movie is all about?",
        "I'm curious to know which actor has worked on the most iconic romantic films throughout their career.",
        "Yo, who's the mastermind behind that dope action movie from last year with the insane stunts?",
        "Can you recommend a high-rated action movie from the 1990s?",
        "Can you tell me the plot of the movie Frozen?",
        "Are there any theaters playing the new Marvel movie tonight?",
        "Can you recommend a crime movie directed by Quentin Tarantino that has a neo-noir style",
        "What is the most intense horror movie to watch with friends and what was the inspiration behind the set design and overall atmosphere?",
        "What's the highest rated movie of all time?",
        "Which director is known for creating movies in the psychological thriller subgenre?",
        "Could you show me a movie with a great love song in it?",
        "What children's movie from the 90s has a princess as the main character?",
        "Can you tell me the plot of the latest Avengers movie?",
        "Who played the lead in that classic romance film?",
        "Can you tell me about the director and some interesting behind-the-scenes facts of the movie The Notebook?",
        "Yo, where can I stream that new Spider-Man flick?",
        "What's the deal with that new horror movie? Is it really as scary as they say?",
        "Is there any Netflix original movie with Tom Hardy in it?",
        "Who is the director of the top-rated science fiction film of all time?",
        "Can I buy tickets for the new James Bond movie today?",
        "I'm not sure if I want to watch a scary movie trailer or a romantic one, can you help me decide?",
        "I need to see a preview of the new Spider-Man movie right now",
        "I'm looking for a movie with a compelling plot and strong performances, is it possible to find such a film on a streaming platform?",
        "Can you recommend a movie starring Leonardo DiCaprio?",
        "Can you recommend a classic western movie with lots of action?",
        "I'm curious to learn about the creative process behind a classic movie that was quite influential. Can you provide insight into the making of this film?",
        "Can you recommend a heartwarming romance movie from the 90s with a strong female lead",
        "Do you know any recent movies with a score by a female composer?",
        "Hey, who directed that awesome action movie with Tom Hardy and Charlize Theron?",
        "Spoken Query: \"I remember a movie with a catchy song, can you show me a teaser for the film with the song 'My Heart Will Go On'?\"",
        "Can you recommend a good action movie from the 90s?",
        "I want to know the plot of the action film directed by Christopher Nolan and rated PG-13",
        "Which movie has the most exciting teaser of all time?",
        "What's the deal with that movie where the dude from Avengers plays a spy or something?",
        "I heard there's a thrilling new trailer for the upcoming sci-fi film. I cannot wait to watch it!",
        "Show me a movie with Meryl Streep as the lead character.",
        "What's the story behind that Tom Hanks movie where he gets stranded on a desert island?",
        "I need something to watch, is there a comedy movie from the 1990s available to stream?",
        "Show me a trailer for a classic film that was both critically acclaimed and commercially successful.",
        "Can you tell me about the special effects in the latest Avengers movie?",
        "Can you tell me the plot of the movie Sleepless in Seattle from 1993?",
        "What are some highly-rated romantic movies from the 1950s?",
        "Who directed the science fiction movie with a high viewers' rating",
        "I'm looking for a comedy film directed by Christopher Guest, do you have any suggestions?",
        "What awards did the movie The Shape of Water win?",
        "Can you recommend a film about the history and production of Disney animated classics?",
        "I'm interested in watching a science fiction movie with a focus on time travel. Are there any recent ones with good viewer ratings?",
        "Who directed the science fiction film that won best picture in the 90s?",
        "I'm craving a horror movie that will scare the daylights out of me. What's a truly terrifying supernatural thriller worth watching?",
        "I'm looking for a film with a soundtrack filled with classic rock hits, can you suggest one?",
        "Which director is known for creating amazing movie teasers?",
        "I'm so pumped for the upcoming Marvel movie, can you hook me up with a glimpse of the trailer?",
        "Show me a film that delves into the production process of a classic western movie",
        "tell me about the storyline of the matrix trilogy",
        "Can you tell me about the making-of the newest Star Wars movie?",
        "I'm curious about the director behind the scenes of that action-packed film with the intense fight scenes. Can you tell me who directed it?",
        "I'm looking for a film where I can see how they created the magical costumes and props for a fantasy world",
        "What are the showtimes for the latest Marvel movie?",
        "I need to know the deal with the movie Pulp Fiction, can you give me a quick rundown?",
        "I'd like to see the new Marvel superhero movie, can you tell me the showtimes and ticket availability?",
        "Who directed the highest rated movie for young adults in the past 5 years?",
        "What are some classic western movies available for streaming?",
        "I'm looking for a movie with a great soundtrack. Can you recommend a film with a memorable song performed by Whitney Houston?",
        "Can you play the trailer for the newest animated movie for kids?",
        "I'm a big fan of Quentin Tarantino's work. Can you tell me the plot of his latest movie and if there's a trailer available?",
        "Hey, what's the name of that movie with the awesome soundtrack that has a bunch of 80s hits?",
        "Can you play the trailer for the latest James Bond film?",
        "What movie from the 1990s is a must-see action film?",
        "Show me the sneak peek of the upcoming Marvel superhero movie scheduled for release next year.",
        "I heard that the director of The Dark Knight also made a behind-the-scenes documentary. Can you tell me more about it?",
        "Yo, where can I peep the trailer for that new superhero flick with the kickass special effects?",
        "Can you recommend a movie with a director's commentary by a non-binary filmmaker",
        "I heard there's a new thriller movie out. What's the plot and who stars in it?",
        "Spoken Query: \"What family-friendly movies are showing this weekend?\"",
        "What's the highest rated action movie from the 90s? I really need to find something exciting to watch!",
        "What's the deal with that new Tarantino movie, is it any good?",
        "What is the best-rated action movie of the year and when can I see it?",
        "Has the movie The Shawshank Redemption won any awards?",
        "Can I get tickets for the new James Bond movie?",
        "I'm in the mood for a classic musical, preferably from the 1950s or 1960s.",
        "I'm looking for a film from the 90s with a very intense plot. Do you know if it's available on any streaming platforms?",
        "Could you provide me with a review of the latest Quentin Tarantino movie?",
        "What movie has the best trailer of all time?",
        "I'm interested in learning about the making-of process of an iconic 90s film. Do you have any recommendations?",
        "What's that movie where Tom Hanks plays a character stranded on an island?",
        "What year was the movie Inception released, and who directed it?",
        "What's the rating for the latest Marvel movie?",
        "Can you recommend a romantic comedy that's not super cheesy, but still makes you feel all warm and fuzzy inside?",
        "Who directed the movie Titanic and who starred in it? I need to know now!",
        "What are some classic sci-fi films from the 80s directed by Steven Spielberg",
        "Can you show me the trailer for the new romantic comedy directed by Nancy Meyers?",
        "Can you show me the trailer for the film Inception?",
        "Can you recommend a detective movie where the main character is a retired cop hunting down a serial killer",
        "I'm interested in a movie that features an epic soundtrack, preferably in the adventure or fantasy genre. Any suggestions?",
        "Could you give me an overview of the storyline for the movie The Shawshank Redemption?",
        "I'm not sure which movie to watch, can you suggest one with a memorable theme song that's worth listening to?",
        "I'm looking for a critically acclaimed film with the highest number of nominations for Best Picture."
    ]
}